THE BOURBON NEWS, PARIS, KENTUCKY, JAN. 30, 1912
fa
(
it .m
1 l'l
m
Iti a i
Mr
ill
t.
M
II
18
1
1
15
1
I
Ti
FACTORY
CLEARANCE
S R L E I
- -
Saturday, January 20th,
At 8 O'CIock, p. m., We Opened Our Doors With a
Sale That Eclipse Anything Ever Before
Attempted in Paris.
Several large Eastern manufacturers, anticipating a
record-breaking holiday trade, stocked heavily so as to
take care of "hurry orders." The unseasonable weather
and the lack of snow in December, throughout the entire
country, affected the Shoe industry more than other lines,
and "hurry orders" were few and far between. Our
buyers, always on the spot, finally induced them, owing
to our immense outlet, to consign these goods to Dan
Cohen to be converted into ready money.
if You Value Money, It You Value Shoe Comfort, and
- If You Value Style, We Advise You
To Come
One Lot Ladies' $1 .75 and
Gun Metal and Kid, button
Sate Price
Ladies' $1.25 Congress Slippers, made SQ ji.
of soft Kid, tip or plain toe, Safe Price
Ladies' 60c Storm Rubbers
Sale Price
One Lot of Ladies' $2.50
some of the latest style 1 6
Boots, in Gun Metal and
Reduced to
One Lot Ladies' new style 16-Button Boots, made
rn Tan, Gun Metal, Patent Colt and f Jk
Velvet, $3.50 value, Reduced to 9h4Z7
Misses' $2 and $2.25 values in Patent Colt, Gun
Metal, aud Kid, button and
ReducecJ to ..
150 pairs Misses' $1.25 to
values, at T
Grown Girls' high 1 6-Button
Metal, school heels, $2.50
Reduced to
Boys' and Youths' Box Calf Shoes, all
sizes, 1 1 -2 to 5 1 -2, Sale Price
One Lot Boys' $2.00 Box,
sizes, high cuts included,
Sale Price .:
One Lot Infant's Soft Soles,
Misses' Storm Rubbers, at
One LotMen's Tan and Black, heavy E4 t
High Cuts, $3 value, Reduced to 9 I
One Lot Men's $2 and $2.50 Shoes, fl"fl JfkCk
broken sizes, Reduced to mV&
One Lot Men's Patent
$4.00 values,
Reduced to
One Lot Men's 3-Buckle All
Arctics, $3.50 value, at ,
Onk Lot Men's Cloth Buckle
Arctics, at
One Lot Men's Patent $4 Walk
Over Shoes, Reduced to
One Lot Men's Patent Shoes, broken sizes, Q QC
$2.00 to $3.00 values, at
DAN COHEN,
g 336 Main St., Paris, Ky.
JttlLLERSBURG ITEMS.
I Kev.'W. A. Swift was in Lexington
Fnursday.
Mr. R. M. Rice, rof f Paris, was the
et of his sister-in-law, Mrs. Fannie
Norton, Thursday.
Elder Smith, who preached at the
Christian church Sunday morning and
tening, January 21, has been called as
At Once.
$2 values in Patent CoSt,
and lace,
39c
and $2.75 vaiucs includes
- Button
Patent,
$1.99
lace, Jt
$1.75
Boots Patent and Gun
values,
Calf Shoes, some odd
1 IUJj ovinia uuu
$1.49
25c value, at 9c
39c
and Gun Metal Shoes,
Mil IIICIUI tJIIUCi
$2.99
- Rubber tfr
$3.19
pastor and will enter on his duties
Sunday. His family will come in a
few weeks from Texas.
Dante's "Inferno" in moving pic
tures was put on at tne opera house
Friday eveoning. A good sized audi
ence witnessed the production.
A small blaze was discovered in the
electric power house Friday night
about 11 o'clock. The east end of the
building was damaged to the extent of
99
Truly and widely representative of the city's automobile industry are
the seven members of the Cincinnati Automobile Dealers' Association, who
are pictured above, as committee-in-chargc of the annual auto show to be
' eld in Music Hall d iring the week of Washington's Birthday, February
19-21 inclusive, with three days to follow in the succeeding week for display
of commercial vehicles only.
Centering the group above is president of the Association, Edward
Herschede, of the Herschede Jewelry & Motor Car Companies.
Grouped about him, by number, are: J. Robert C. Crowthers, of the
R. C. Crowthers Co. ; 2. H. S. Leyman, of the Leyman-Buick Co. ; 3.
George Behlen, of the Charles Behlen Sons; 5. Frank H. Miller, of George
C. Miller Sons; 6. W. G. Welbon, of the Olds-Oakland: 7. E. A. Kruse, of
of the Kruse Motor Car Co.
Unselfishly this septet are giving of their time and money to the one end
that the middle west shall have an exhibit of. motor cars worthy of its con
constituency, and every prospect is that they are to be rewarded with a
lavish out-pouring on part of an interested public, not only from Cincinnati
herself, but notably from the sections lying on her border.
Every inducement to attendance will be at the show ; interesting and
valuable displays ; splendid music; superior facilities for refreshment of both
liquid and solid kind and finally a decorative setting so unique that
Music Hall is to 1j2 transformed into a veritable cozy corner of warm and
glowing beauty.
A large number of persons of this city have already signified their inten
tion of paying a vHt to Cincinnati for one of more days during the progress
of this coming automobile show.
S100. The fire wrs caused from the Laymen's Conference in Ses
heat from the exhaust pipe. ,
i sion Today,
Mr. H. B. Jett, of Jackscn, entered
his son in M. M. 1. yesterday. fne Laymen s Conference of rJbenez-
.T T . . . n ... j er Presbytery will begin its session
Mrs. Leslie Shrout, of Owingsville. this morning at 10 o'clock. The con
is the guests of her parents, Mr. - and ference will be held in the Presbyter
Mrs. J. H. Carpenter. jan church. The afternoon session will
Mr. and Mrs. W. V. Shaw were begin at 2 o'clock this afternoon and
guests of Mr. and Mrs, H. K. Shaw, J at 6 :30 an elaborate banquet will be
of Menton, from Saturday till Monday, held in the basement of the church.
, . , r. i- rhe Prsram will -conclude with the
Mr. R. O. Ghambets, at Sardis, was j evening session which will convene at
the guest of his sonand daughter, Mr. eight o'clock. A cordial invitation is
and Mrs. R. M. Johnson, from Satur- extended to all to attend these sessions
day till Monday. ! with the exception of the banquet
ATTENTON FARMERS Every' which is tendered to the - Laymen and
farmer should own a tarpaulin ; we officers of the church. Following is
keep them in stock. Both phones 22. j tn,e Program:
PEALE COLLER & CO. 1 Devotional exercises, Rev. R. S.
Sanders.
Ihe slaughter house of Mr. CD. 0 n,i, c wi i r -
Tackett was broken into Friday night ! jFnnZtnnt pIJ'T nth?urpAe
. i u:,j n-i.. n.:- of Conference, Rev. B. m. bhive. D.
and one beef hide taken. The thief or
thieves have not yet been apprehended.
Mr. ar,d Mrs. J. W. Bouldc-n, 0f '4-Conference Sermon, "The Healthy
Maysville, was here from Saturday toifa"- Eccle. 12:12, 13, Rev. Henry
Monday to attend the funeral of Mr. j H- sweets, D. D.
Jo? Dennington, which took place Sun- j AFTERNOON -2 O'CLOCK
a," . . , I 5 "The Assembly's Every Member
1 he following are among the number Canvass Plan, and How to Work It,"
who started tobacco from here to Lex- Rev Henry H Sweets D D
ington yesterday : Chas. Martin, 3. 6-"The Effect on' the ' Average
, x U,1'CF e z Joaas;
W. D. Mclntrye, 2 loads; J. O. Robin-
son and J
J reeu, jne each. The
loads averaged
each.
about 5,000 pounds j
Ide Herrington, aged 23, died at the
home of his father. Mr. 0nnr Herring.
ton, Saturday at eight o'clock p. m. i IUV c , , . . m
after a several weeks' illness of d Should There be 1 wo Traesurers.
typhoid pneumonia. The funeral was ! ? is Pbf Honorable or Disgrace
held at the grave in the Millersburg ful, Helpful or Injurious to the Work
cemetery yesterday morning at 11 oih.e h1".0- 0 . T,
o'clock i f Is the Tithe Still in I? orce. If So,
! in What Way.
Mrs. Hannibal A. Wi:liams, a noted S Concrete Cases, Showing How the
reader, will give a Shakespearian Vlan Works,
reading at M. F. C. chapel this even-' 8 Resolutions.
ing at 7:30. She will lead the popular i 9 "At Your Own Door," Prof. C.
play "As iTou Like It." Mrs. Wil-'. G. Crooks.
h'anib comes highly recommended and; 6:30 P. M. BANQUET IN BASE
is indeed an artist. Everyone should) MENT.
avail themselves of the opportunity of j 10 Toastmaster, Hon. E. M. Dick
hearing her. Reserved seats 35 cents, 1 sen.
genelral admission 25 cents. Tickets j a' Toast, "The Deacon's Part in the
on sale at the .college and Waddell's Assembly's Plan. " Rev. S. M. Loeran.
drug store.
Mr. James Dunnington, aged about
70 years, died at his home near Colville
Friday night after a lingering illness,
for a number of years he owned and
resided on the farm now owned and
occupied by Mr. J. C. Layson. About
twenty-five years ago hb moved to ,the
home where he died. He was a bache
lor and is survived by one brother,
Mr. John Dunnington, who resided
with him. The funeral took place
Sunday afternoon at 2 o'clock at the
Presbyterian church. Services by Rev.
R. S. Sanders. Interement in Millers
burg cemetery. i
Won Bronze Turkey Premiums.
error occurred in the news item people refuse to pay ; a year ago the
published! last week of the premium court ordered the County Judge ?nd
awards made at the Louisville poultry ; Fiscal Court before him on a charge
show. The News stated that Talbott of contempt because they employed a
& Gaitskill, of Austerhtz, won all the special collector to collect county
prizes on Bronze turkeys. We ar in- - taxes. The bond holders feel that they
formed that Mrs. Walter Kenney took ! will get their money, while the tax
hist premium on cockrel and second 'payers doubt if there is anybody with
and third premiums on pullets. u authority to collect even county tsxes.
D.
3 Enrollment of Delegates and
Organization.
church of Adopting the Assemblv's
Plan," Rev. Carey F. Moore.
7 Kound ladle Conference:
a Defects in the Old System of
Church Finance,
b How Many Canvasses and When,
c Importance of the. Waelv Offer-
b Toast by Dr. Lyons.
8 P. M., IN AUDTORUM.
11 "Home Missions," Rev. Homer
McMillan, D. D.
12 "Presbyterian Men," Rev. J. S.
Lyons, D. D.
13 Resolutions and General Discus
sion. 14 Benediction
Sad State ol Affairs.
Years ago Green county Issued bonds
to build a railroad. The bonds were
sold but have never been paid. The
Federal Court has given judgment for
the full amount, and for years the
sheriffs have resigned as fast as elect
ed, because the cuurfc has ordered taxe3
fn nflv t.hnsp. hnnris p.nllpptprl and fhp
(Continued From Page 1)
the time for holding the congressional
primary and declaring that "the said
action as for the purpose of prevent
ing and stifling a lair expression of
the wishes of the people, and with the
sule purpose of imposing upon the
Democracy the nomination of J. Camp
bell Cantrill, who now misrepresents
the halls of Congress a proud consti
tuency, and whom we believe to be
utterly unfit Morally and politically
longer to hold this exalted "position."
The resolutions urge and insist that
the Democratic State Executive Com
mittee shall take steps to restore to
the Democratic voters of the district
thier rights as fre men and to aid in
overthrowing a machine which has al
ready done the party incalculable
harm, and which will ultimately rush
the party to destruction unless inter
fered with.
The meeting was presided over by
William D. Jesse, County Attorney,
and was attended by one hundred
Democrats, including a number of the
party leaders in this county. The reso
lutions were adopted without a dissent
ing vote.
Public Sale of Desirable Building Lots.
On Saturday, Feb 1 O, '12, at 2p. m.3
on the premises, I will sell to the highest and best bidder, the following de
scribed property, to-wit:
Two building lots, fronting 4.4)4 feet each on Mt. Airy, Paris, Ky., anf
extending back 217 feet.
These lots adjoin the property o? Mrs. Henry Spears, and are excellent
building sites, being level, high ani dry, and have concrete pavements ii.
front. They are in. a good neighborhood, convenient to the business pars of
town, and are the most desiraole building lots on -the market, and anyon.
desiring to purchase a home site should attend this sale.
One lot fronting 85 feet on Stoner avenue and expending back between
rarallel lines to creek. It has a two story brick building, suitable 'or a bus
iness house or wareroom.
TERMS One-third cash, balance in two equal pavments, due in one anr?
two years. GEO. . STUART.
For further information call on Harris & Sp.eakes, Paris, Ky. Georg?
D. Speakes, Auctioneer.
PUBLIC SAL
Stock a
nd Farming Implemen
Having decided to quit farming
will sell on
Thursday, February 15, 1912
at 10 o'clock at "Oakland Stock Farm," miles from Paris, on the Cane
Ridge pike the following stock and farm implements:
HORSES, MULES, PONIES.
1 pair chestnut draft mares, one in
foal to jack and one to horse;
1 pair red sorrel draft mares, in foal
to horse;
1 sorrel addle and harness mare in
foal ;
3 work muls, good ones ;
1 2-year-old Percheron colt ;
2 2-year-old harness colts ;
1 2-year-old filly ;
1 yearling filly :
1 aged family horse ;
1 pony gentle for lady or child to
drive.
CATTLE, HOGS, SHEEP.
4 Jersey cows, 1 red cow ;
1 black pole cow, will be fresh
of sale ;
1 red cow, fresh by day of sale ;
1 mountain cow, fresh by day
day
of
sale ;
2 Jersey heifers, 1 yearling red bull,
1 ypaiiing steer ;
13 home raised yearling heifers,
etxra good ;
1 sow, will pig in March ;
1 sow and 6 pigs, 1 sow and 10 pigs ;
All my implements are good, having been used but one year.
Sale rain or shine. Everything will be sold without reserve or by-bid.
TERMS All snms under $25 cash, over that amount, six months ere ait
with negotiable note, bearing interest at 6 per cent, from date of sale.
Do L. LEGGETT.
G. O. Speakes, Auct. E. T. Phone 61 G
4I0-Acre Tract of
AT
PUBLI
As Executor cf Chas. Hall, deceased, I will sell at public auction on
the premises, located five miles north-east of Georgetown, Ky. , on the Am
merman dirt road, a few hundred yards from the Newtown and Oxford turn
pike, 1)4 miles from Oxford and 2)4 miles from3Newtown, on
Wednesday, Jan. 31, 1912, at 10 O'clock a. m.
the farm of deceased, and containing 410 acres.
This farm being located in the Blue Grass section of Kentucky has a
limestone soil and is especially adapted to the production of tobacco, hemp,
corn and such small grains as grown in this climate. It has on it three ten
ant houses with outbuildings, two tobacco barns, large enough to house 30
acres or more of tobacco, is well fenced and well supplied with water from
springs and ponds.
All of the farm at present is in blue grass, timothy and clover with
the exception of about 100 acres, which is mostly in small grain. This.land
all lays well and the peculiar favorable qualities of its soil makes it an ideal
tract of land for both agricultural and stock purposes.
Prospective purchasers from a distance who desire to inspect the farm
before day of sale may call on Auctioneer B. B. Peak at Georgdtown, or for
further desired information may call or write the undersigned.
Terms will be made known on day of sale and will be made to suit the
purchaser.
j. ML HALL, Executor 5
f
of Chas. Hall, deceased'
B. B. PEAK, Auctioneer.
Suit on Unusual Ground.
Attorney Reuben Hutchcraft, who
accompanied Mr. Ford Brent to
Seattle, Wash., a few weeks ago, as
legal adviser in a suit brought by
Brent & Brother, of this city, againac
the Commission firm of Lillv and
Company, to secure a settlement for a
carload of blue grass seed, won the
suit after a hard fight. The sum in
volved in the litigation amounts to
several thousand dollars.
The ground for the suit was that the
Paris firm was wrong in calculating a
bushel of grass seed, they claiming
that the seed shuuld be paid for on a
basis of 14 pounds to the bushel while
Lilly and Company contended that
there was 21 pounds of seed to the
bushel.
Mr. Hutchcraft is the youngest at
torney at the Paris bar, and is to be
congratulatd upon his success.
Go to Buck's.
For a nice bath, hair cut or shave,
go to Buck's barber shop. Three first
class barbers. 13 tf
OF
and engage in the poultry business, T
1 sow and 5 pi gs ;
20 shoats, will weigh about 65 lbs. ;
21 shoats, will weigh about 100 pounds:
40 sheep, extra good ones, will lamb
March 1.
FARM IMPLEMENTS.
1-A very wagon, good as new ;
1 bay frame, 1 Deering binder ;
1 Dering mower, 1 bull rake;
2 check-rower corn planters. . 1
Hoosier drill ;
1 Bemus tobacco setter;
1 riding breaking plow, 1 disc har
row ;
1 douole disc harrow, 2 section har
row ;
1 double A harrow ;
4 two horse cultivators, 2 one horse
cultivators ;
4 breaking plows, 2 double shovel
plows ;
1 iron roller, 1 marker, 1 drag ;
4 sets wagon harness;
1 buggy and harness, good as new ;
1 hog vat ;
Double trees, single trees, hces,
pitchforks, and many other things too
numerous to mention.
Blue Grass
, PARIS, KY.
Laud
SALE
tit.
"V' -