.m mitmmtmfy
THE BOURBON NEWS, PARIS, BOURBON COUNTY, KY., APRIL 15. 191?
-v.
f
i
NEW WALL PAPER IDEAS!
Arc Constantly Being Shown at Our Parlors.
We are well informed on interior decorating then too, our immense assortment of unique papers enables us to carry out most any conceivable
design or coloring you might wish. There's a wealth of character and individuality about
BORLAN D'S
WALL PAPERS
That make them highly appreciated they are so different from the ordinary kind. Yesterday in wall papers has passed. To arouse the buying
appetite of the progressive Tiome owner of to-day requires a line abreast of the times. You will be surprised and delighted to see the wonderfully
beautiful designs and colorings in the new styles; the intermixture of the most attractive goods from America's fifteen most prominent factories.
If convanient for you to call, we will take positiue delight in showing you through the line.
BORLAND'S
WALL PAPER PARLORS
424 Main Street,
p Paris, Kentucky i
.
MILLERSBURG ITEMS.
Regular meeting of Amity Lodge
ZNo. 40 F. & A. M. tonignt.
Mrs. C. B. Bastin is ill with malarial
iever.
Mr. Wm. Peterson is threatened
withpneumonia.
Mr. W. K. Henderson, of Versailles,
-was the guest of friends here Sunday.
Mr. and Mrs. George Batterton
fcave returned from a visit in Cynthi-
vana.
- Mrs.T. R." Wilson, of Robinson Sta
tion, is guest of Mr. and NMrs. R. L.
' TVilson.3
' Misses Patterson were guests of
Sheir sister, Mrs. Nola Fields, in Paris
this week.
-Mr. W. V. Shaw witnessed the open:
ing game of base ball at Cincinnati
Saturday.
The Startford '. Quartette closed the
Lyceum Course at the M. F. C chapel
-Saturday evening.
The valuable family horse of C. W.
'Mathers 'was drowned Friday after
'xoon in Hinkston. Z
Mr. W.'W. Shannon, of Louisville,
-was the gueat of his uncle, Mr. Thos.
3JcClintock. last week.
The recital eiven by Miss McGas-
sdn's pupils in voice at 'the M. F. C.
cjsapel Friday evening was well at
tended. "Mr. M. P. Collier'was in Cincinnati
Sunday to see his wife, who is under
treatment at a nospital. She is improving.
Mrs. Saunders, of Poplar Plains, is
the guest of her daughter at M. b C.
Mr. S. E. Bruce and family are mov
ing today from the Stirman House to
the property of Mr. W. M. Miller.
Mrs. A. T. Vimont. accompanied by
Miss Eula Yates, the latter .of Blue
Licks, leftFriday for Chicago.
Miss Henderson"s German' class of
the M. F.'C'.willJgive fan: entertain
ment Friday evening at 7 30 o'clock at
theM. F. C. chapel. Public invited.
Mrs. C. M, Best is leaving no stoqe
unturned to make the M. M. I. home
coming, beginning the third of June, a
pronounced success. The closing of
the presentsession will be the twen
tieth anniversary of Col. and Mrs. Best
in Millersburg. The event promises
to b e the moat notable in the history
of Millersburg. it has been suggested
that the occasion be made ahome com
ing for those who have iormerly re
sided here, and plans are now under
way for a grand reunion.
There are a number of gates in town
that constantly stand open, especially
is this true on the South fend of Trigg
avenue and Vimont street. Since the
town has been so much beautified and
improved by the removal of many of
the fences it is not really necessary
that there should be any. Unless a
remedy is provided a petition will be
presented at thejnext meeting of the
city council asking that all gates b.e
hung from, the inside.
FOR SALE One red Jersey Duroc
sow with eight pigs, about threef weeks
old. The sow is in good condition and
the pigs are perfect. For further par
ticulars call on or address
J. H. COLLIER,
. ' Millersburg, Ky.
In a brilliant game here yesterday
afternoon, the base ball team of M. M.
I., defeated the Cynthiana Hustlers by
a scoreof 2 to 1.
In order to close out our stock of
vehicles, composed of buggies and sur
leys, we wil!,sell at cost any job in the
house. If you are in need of a buggy
or surrey this is certainly an opportu
nity to secure a bargain. Come and
look over our line.
MILLERSBURG COAL AND LUM
BER CO.
Births Outnumber Deaths.
The records of Carlisle show that
there were 101 more births than deaths!
in Nicholas county during the past
twelve months. The deaths numbered
153 andthejbirths 254. The report has
iuat Deen made by.County Clerk John,
F. Sugg.
Seed Corn.
We are sole agents for the sale in
Bourbon county of Caldwell's Bpone
County White Seed Corn. Phones 14.
28 5t CHAS S. BRENT & BRO.
Insure with W. O. Hinton.
Prompt paying noiT- union
companies. tf
' SPRING OPENING-New Iceberg
Refrigerator.
A. F. WHEELER & CO..
tf Opp. Court House, Paris.
Luke McLuke Says
It makes a lot of difference to a girl,
but a man doesn't care, whether the
lacev on her undergarments is hand
made or not.
It takes a woman who wears a pair
of silk stockings and a smile alljwinter
to worry for fear her husband will
take off his heavies too soon.
A man begins to quit being crazy
about a girl when she starts being
crazy about him.
It would help some if girls were as
anxious to be good cooks as they are
to be good dancers.
A girl will run around the house in
a peek-a-boo skirt and a gauze under
vest. But ahe wouldn't think of leav
ing her room unless she had some
thing on.
A eirl cets so tired of the simple
life that she often feels like crossing
her fingers when she prays to be led
away from temptation.
Worth says woman's attire this
summer will be more daring than I
ever. Well, us men can stand al
wnole lot without fainting. Go to it '
, and see if we care. '
If you go to a museum and pose for
an hour in front of a Daintmg showing
a bunch of nude nymphs bathing in a
brook, that's the fartistic tempera
ment. But if you exoress a rdesire to
see the same thing in real life, that's
total deDravity.
When a girl tells you that the wasp
waist is coming in again she means
that cornfed hips are coming out again
A domestic shape will do more than
an imported trousseau to make a wed
ding a happy one.
2 Wny is it that when a married
woman begins to broaden out her hus
band begins to shrivel up? Cincinnati
Enquirer.
How Barbed Wire Fences Spread
Disease Among Cattle.
Thejfollowing is taken from a current
issue of Farm and Fireside:
"A doctor holds a po3t-mortem on a
badly infected subject. His knite or
scalDel , slips, and he cuts a finger.
Blood poison and death ensue. A tu
berculosis cow is stung by an insect.
She goes tothe barbed wire fence and
scratches the itching spot, breaks the
skin and leaves infected blood on the
barbs, which dries, but the germs re
main dormant waiting for, perhaps, a
healthy4cow to come along; and she
does, and scratches, and automatically
inoculates her blood with the tubercu
losis germ.
"This isn't theory. Any surgeon or
bacteriologist will 0. K. all the above
as to germ-transference.
"A cow 'hooks' another, draws blocd
with the tip of her horn, which, when
smeared with dried infected blood, is
just as Jdeadly as the sharp barbed
wire.
"No keeper of valuable horses per
mits a 'foot of barbed wire on his
ranch."
f
! Small farms at Auction.
Fourteen small farms, containing
from 3J2 to V?& acres each, located in
Bethlehem Place, near the city limits,
will be sold at auction, on Wednesday,
April 23, at 2 p. m.
1
MW
-.
Better Shoe Values
Are Hard to Find.
m 1
,Of course it's easy enough to find Shoes at low prices, but not
so easy to find the same kind and quality at such prices aswe are
offering you now. For when you come here we'll give you better
leather, better workmanship, a little finer style, more comfort and
more value than, you have been accustomed to.
McNew Again a Candidate.
Judge W.N H.'McNew, the present
incumbent, has announced'as a candi
date for the Democratic nomination
for County Judge of Nicholas county.
Other candidates are Police Judge J.
E. Plummer and Sheriff James Mitchell.
Open Letter from Hoh. j, Will
Clay.
Mt. Sterling, Ky , April 14, 1913.
Hon. Rufus Hadden,
City.
My Dear Sir:
As opposing candidates for the
Democratic nomination for State Sen
ator, you and I both want as little
friction within the 'party as possible-,
and while I have absolutely no objec
tion to submiting ray claims to the
Democracy of the entire district, it
has occurred to. me that sinceit 13
Montgomery County's time to furnish
the nominee, under the rotation agree
ment long observed, that it would pro
mote party harmony and be in accord
with an overwhelming sentiment in the
.district and especially in Bourbon and
Clark counties, to submit our claims to
a primary in our home county at such
a time before the State Prjmary as
you may suggest, the officers to be di
vided equally between us by the Dem
ocratic County Committee, or the
County Board of Election Commis
sioners, or bv Mr. Clifton Prewitt. Sr..
of your church, and Mr. John T. Wood
ford,! of mine, or jm such other fair
manner as you may suggest, each to
be entitled to a challenger and inspect
or in every voting booth to insure ab
solute fairness and the cost of such pri
mary, which will be much less than
the legitimate cost of a canvass of the
entire district, f to be borne equally,
the loser in such primary to with
draw as a candidate before the State
Primary.
I pledge myself to do this if my fellow-Democrats
at home do not want
me to represent them in the Senate,
and I feel you entertain similar views.
Awaiting your early reply, I am,
Very respectfully yours,
J. WILL CLAY.
For White PeoDle Only.
Remember that tracts of land in
Bethlehem Place will be sold to white
people only. Come out on Wednesday,
April 23, at 2 p. m. , and buy acres at
town lot nrices.
For rheumatism you will find noth
ing better than Chamberlain's Lini
ment. Try it and see how quickly it
gives relief. For sale by all dealers.
BclhlelienT Place Addition to Paris.
Pick out a home site in Bethlehem
Place. Near the L. & N. yards and
the Interurban car line. Public sale on
Wednesday, April 23, at 2 p. m.
Spring Opening
New Icebreg Refrigerator.
A.F. WHEEL.ER & CO.,
tf Opp. Court House, Paris.
!
z '
k
Tk.T" T U.i ST U. Wh "TT ,ji
ISOW Jt LUG JL1IUC LP J3Uy X OUT ' 'frJ
Spring Footwear
"
We have just received the newest and largest assortment of
Spring Shoes and Oxfords ever offered to the people of Bourbon
County. This embraces all this season's newest designs in all ..,
leathers and fabrics, to be placed on sale this week. ;
1 '. ' $ v -"
Buy Now While the Lots Are Complete in Every Detail. ,
BAN COHEN -jR
U VH fl 'fSJrM V
J '?
"-H
:)
"&"
'f ": -j':' '
a. i. fc
Sw
Y' -"
v -li', ..'?'
1 - J
WJV:HHHHiNP .WHHHV WHP JMBHHHMHPP MHHHHHP VHHHUIIHHr P lP I lP Pr
0 w
FIRST YOU SAVE SOME MONEY THEN
you HIDE ST IN THE HOUSE THEN SOME
SMOOTH STRANGER COMES ALONG AND
YOU INVEST IN SOME SCHEME AND LOSE IT
Study this picture. This kind of thing is happening alL
the time. If the smooth stranger had a really good thing he"
We canyJt
&?
wouldn't be peddling it. He wouldn't HAVE to peddle it&
Investments that HAVE drummers NEED them.
advise you, but we can't- afford to advise you wrong.
Gonsultus ! . . . .... . j
Make OUR bank YOUR bank. - "'".
We pay 3 per cent, interest on Savings.
DEPOSIT BANK Of PARIS.
Capital, $i00,00ei6
d.J MIHALLv PitESIDENT, "" '
Surplus, $40,000.00.
.THPMASM
-VV
f-W
,?fi
cr