1) '-"
m m LdiK:::V'iLiiiiV1 11111111111111
-r , .BLVVHbV iZrii, 4&&lMar HillllllVviHl .Hr iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiKnillllHP hmVBI
IBilralfirc. -kLiflHBJfliSwv&Siiiii
DBHCB993wHKBHuK9BBBttHHHBHHHHHH
& tuMKBtfty oB ivtm vTfyBmHBF -3nr rTwBBBBBBBiBBBBBBBHMflhirfa "BBBHKHLrHllWIBBBBBBBBTBBBBBBBBBrBiMBBBBBBMBBr HHIHi
r- HPf5i VBhSw9JS9K!95tfcitiiiiiViitiiitiiiiiiViESMM i Bl I
BBBBBbPi VnUthf X8IBBBBBW"IaBJBBBBBBWmBBMV vyHflHQBB& VuBBBBBBjSBBBBbIHR jCJBLBMMfcwBMBggMlpllyBB ,2 aBSBBBBK
B3Kv?2tiKuBhM iiiiiiVBiBrwDiEic!jfh.. flffHflCSBHUBBS&'HfiKunEs p?MKvflHisflHiBM0MBiBBlB9BVBSBiiiiBK
GisjiHiBBBBBABAflBBBBJp
HERCULES
Read How Fortunes Are Made
Quick By Pulling Stumps
Let me send you my new, fine, free book at once. I want to show you proof of how
you can turn each acre of stump land into a double profit the first year, in extra crops
and added value of land by pulling stumps with the Hercules All Steel Triple Power
Stump Puller and how you can make big Money in your spare time by pulling
stumps for your neighbors or by renting your machine at a nice fat profit. My book
shows actual photographs and prints, actual letters from many owners, telling of the
remarkable feats of the Hercules how it pulls any size stump, green tree or hedge
in less than five minutes how it easily pulls an acre a day. Read how one man
increased his land value from $25.00 an acre to $125.00.
Read why the Hercules is the best investment you can make now. The
TRIPLE POWER STUMP PULLER
is the puller that has the single, double and triple power features, giving you three machines in one.
There isn't a stump, green tree or hedge grown that the Hercules won't pull out without straining or
breaking any castings. It's the low-down constructed puller that has self-anchoring and stump
anchoring features the one with double safety ratchets, that insure the absolute safety of men and
team. I want to send you a Hercules on
30 DAYS FREE TRIAL
so you can see how powerful it is and how easy it works- I want you to know for yourself that
the all-steel construction means 60 less weight and 400 greater strength than cast-iron or
"semi-steel." Besides that, 1 want to save you big money on the cost. I'm making a
SPECIAL PRICE PROPOSITION
to the first buyer in 5000 different parts of the country. If I get one Hercules in each locality
more will surely follow because of Hercules quality and efficiency. So I can easily afford to
sacrifice my profit on the first machine in each locality. Take advantage of this big profit and big
saving opportunity now. Besides my 30 days free trial offer and money-saving price I give you a
3 YEAR GUARANTEE
that means something. The all-steel construction, the triple power feature that saves your team
and gives a tremendous increase of power, the double safety ratchets and the careful turning and
grinding of every part all these things make it safe for us to guarantee the replacement of any
casting of a Hercules that breaks any time within three vears, whether it is the fault of the
machine or your fault.
THIS FREE BOOK TELLS ALL
Just simply send your name and address on the coupon or on a postal so I can send you the convincing
facts about the superiority and efficiency and value of the Hercules Stump Puller. Only 5000 of these
machines will be sold at this remarkable introductory price, so get your name in now. My new book is
a beauty. See the real pictures of big stumps it has pulled out like you would pull weeds. Read
the many interesting letters from farmers, lumbermen and land promoters. Stumps, stumps, stumps.
pulled our quicK, mating tortunes tor owners or Hercules otump
Pullers. I want you to know the facts. Just
MAIL COUPON OR POSTAL NOW
I'll send the book and price by return mail. I'll tell you the best
crops to raise on virgin land where stumps were before. I simply want
to get my free book to you at once, so that you can read the remarkable
facts about the Hercules All Steel Triple Power Stump Puller and
how it does such splendid work making big profits for owners every
where. Mail me the coupon or postal right now, before you forget,
or take down the name and address and write me as soon as you get
a postal card. Address me personally,
B. A. FULLER, President
Hercules Manufacturing Company
184S-22d St., Centerville, Iowa
L -"- - frtSQ
Tlriple Btower
tump IFiller
IU.T.II'fc L
if t. iuk.-fc V ..
fkra)aW9.U.Can3tW.tU
RUSH COUPON for Book and
New Low PRICE
MR. B. A. FULLER, President, Hercules Manufacturing Co.
1848 -22d St, Centerville, Iowa.
Dear Mr. FuDer: Ma3 me your free book and special price offer on the
Hercules All Steel Triple Power Stump PuDer.
Na
State
Route No..
' r
..r y HHfi'A . X
-&....iai
jft
JSfcJL&rftti, y 'ito&jfrfoi ,
Hi-5;
j