-
,?
THE BOURBON NEWS, PARIS, KENTUCKY, JANUARY 2, 1974
.-
. I . "
sa
, f f.l' M . J 'I1, ii i
ssc8ppyffiss3BwffiiFiiwffi
-
TC H ELL & -00 L A k E MOR E ? S
.-I
I Ml
- 4
Wk H L B 1 Bf B B Bh'I l BBB
l BbI BT BflBH BB fliB l BhH l? l
B k. flHH Mk HHIHHB
JK JB B bAiAiAiAiAiAiJ
B H H B BH B
B KVKVKVKVb kvkvkvkvi kvkvkvkv avkvh kvkvkvkvkv
. f H bH V4 bbB BBM
B' bbbbbV bS H bH i H bVb
B BBBB BB B Hi bVbh l bb
4 bbt H H AV bV bV H B B
j1 " HbP Hi II
H H iB bbbbbW bbbI HH bbS
;-H H B .BL B H bH bb B h
B -
bbAI bH flH -HHi
I
i J
v
v
I
I
STARTS SATURDAY, JANUARY 4 1914
The mild winter weather the past few months has been against the clothing business," and in order to reduce our stock of Clothing Mats, Shoes and
Gents' Furnishings sacrifice prices will be made on all merchandise in our store. This is a rare opportunity for you to buy high-class clothes at prices which
aret greatsaving to you, aDd which enables us to reduce our slock and not carry this merchandise over. Come now and buy while you cax save money. . Every Suit
nd Overcoat in our house included in this sale. Study the prices below, then buy from us and save jthe difference.
r
Suits and Overcoats
12.50 Suits, now x $ 9.50
.15.00 Suits, now.r. 1 1 .50
20.00 Suits, now '.;....... 1 4.75 '
.x 22.50 Suits, now.. . . .:V ,1 6.75
25.00 Suits, now...', .. 18.75
27.50 Suits, now..'. :..:... 21.75
30.00 Suits, now , ... .23.75
- 35.00 Suits, now, 27.75
40.00 Suits, now. . . 32.75
Men's odd Trousers in Wool, Kersey and
Corduroys at Reduced Prices
Boys' Suits and Overcoats
Reduced in Price
10.00 Suits and Overcoats, now $7.45
8.00 Suits and Overcoats, now 6.00
7.00 Suits and Overcoats, now 5.75
6.00 Suits and Overcoats, now 4.75
'5.00 Suits and Overcoats, now 3.75
65 Boys' Suits at Half Price
Men's Shirts
$2.50 Shirts, now.
2.00 Shirts, now.
1.50 Shirts; now.
1.00 Shirts, nowl
y.
$1.90
1.40
1.20
SO
Men's and Boys' hofes
10.00 Witch Elk Shoes . : $9.00
9.00 Witch Elk Shoes 8.00
8.00 Witch Elk Shoes m V.OO
7.00 Witch Elk Shoes ...." 6.00
3.00 Shoes-.: .:...'A... 4.95
,5.00 Shoes -. 395s
4.00 Shoes 3.00
3.00 Shoes r-. .... ... 2.25
2.50 Shoes , i 1 .90
3
Rian Coats and Men's Mackinaw's
Reduced
Mens Hals
$5.0.0 Hats, nowv .. '....... .$4.00
4.00 Hats, now, t . . .' 3.00
3.00 Hats, nocv ? 2.25
5Q0 pair Men's fancy Hose, all sizes
regular 25c and 35c values, now
3 pair for ,
25c "
Men's and Boys' Underwear at Reduced
Prices All-Wool Garments and Coop
er's Egyptian Balbriggan, both in
Union Suits and Two-piece Garments
Every dollar spent with us means a saving to you, and the merchandise you buy here is backed up with a responsible firm's guarantee. If it is not right we wil
make it right. Ail goods Sold during this sale must be for cash. Come and see what a few dollars, spent here, means to you.
Mitchell
&
DLAKIM0RE
Clothiers and Furnisher
s
&5feS13K
K OF 1LLERSBURG
Ir. and M13. Aaron McConnell
v Meit Thursday for avisit in Maysville.
A . Dr. Cr. W. Judy was the giinst 01
Uf his .brothers, Messrs. G. W. and T. D.
igfiJuay, Tuesday.
-Mr. and Mrs. A. C. Struve and bee in the'M. F. G. Chapel
little son have returned to their home
at Chester, Montana, after a visit to
hr parents, Squire and Mrs. A. C.
Ball.
Mr. Roy Endicott left Wednesday
for Cincinnati to meet his wife, who
is returning 'from an extended visit
in the West. They will return this
evening.
The W. C. T. U. held a spelling
Tuesday
evening, beginning at 7:30. Quite a W. A. Butler, the retiring Master,
large crowd was present, most of has served two terms in his office,
them taking part in the exercises. , the first being in 1907, and was again
The captains were Mr. .A. J. Shop- elected in 1912,. serving through the
taugh and Mrs. Mattie Purnell. Mrs. year of 1913. The year closes with
Purnell's side went down in defeat, two members having been, taken in
leaving three on-the other side stand- two others on the road, one' having
ing, they being Miss Mary Agnes Pur- taken his first and the other his sec
nell? GK P. Fisher. J. Hord Barnes.
Amity Ldge No. 40 F. .& A. M.
closes another brilliant year. -Mr.
ond degree. There is also, a petition
to be acted upon in January. The
year 1914 also promises to be a bril
liant one, as there is considerable"
m , JlL
CLEARANCE SALE OF
Holiday Shoes and Slippers
We Are Offering to the Public ,
GREAT SHOE BARGAINS
' V1
ONE OF FIRST QUESTIONS
BEFORE CONGRESS
work awaiting the new Master. Ir. (were Mr. and Mrs. Ashby Leer and
J. B. Cray, the successor of, Mr. W. little daughter, Josephine, Mr. and
j. sutler as iviaster, occupied me Mrs. 1. j. iratner.
same chair twenty-five years ago.
Ml O. R. Rnnlrin notprl ns ftrn-nrl TVTar ' ? . - Js
shal on both occasions when Mr. one of first omcctimo 'if
Cray was installed. He is thoroughly
conversant with Masonry , and w
look for a bright, prosperous"year.
Miss Jennie Evans, aged about Rural
70, died Tuesday night at 10 o'clock, one of the first Questions Wnrn-
at the home of her niece, "Mrs. Ashby gress when it reassembles on Janu
Leer, of catarrhal pneumonia. Miss ary 12. The commission which inves
Bvans has been a sufferer from or- tigated rural credit operations abroad
ganic heart trouble for a long time " announced that a bill was being
and for the past four months has prepared embracing the more import
been in a serious condition. Pneu- ant recommendations of the report
monia developed last Saturday, and now before President -Wilson. The
it was realized that her condition announcement was" made Tuesdayat
was hopeless and that the end was Washinslon.
:
vu euiis
legislation will be
near. She was a nativje of Fleming
Bills inroduced in each house qZ
county, and was one of a large faifr- Congress will form the bsis of the
uy. one is survivea Dy one Drotn- Administration's efforts to perfect
qr, Mr. A-baer Evans, of Flemings-1 new laws supplementary to the geh
burg. 1 She has resided with her eral banking legislation, to relieve
niece, Mrs. Ashby Ler, since the ' financial conditions ror farmers and
death of her sister, Mrs. T. P. Hop-make it easier for them to obtain
pr, Sr., of Mayslick, about two years working capital.
ago. The remains were taken to 1 The commission will make- its re
Flemingsburg on tlie 8 a. m. train . port public as soon as it has received
jand were interred at 10:30. -Among.the approval of the Ppesideat, soon
tiiuae uiiu uLieuueu lug lunerai aiter ms return rro.m tne soutn.'r't
-3t"
III BEST AND IS? FASHIONABLE FOOTWEAR FOR MEN, WOMEN AND CHILDREN
On account of the extraordinary warm weather, and 'because 0! our enormous purchases ,of Footwear, which is a'r
riving every day and crowding us for room, we are compelled' to offer to the public
FOOTWEAR AT GREATLY REDUCED PRICES
N.I
ladie$, you never had such an opportunity to prac
tice economy. New Shoes in ail leathers and stylesf
.absolutely perfect in every detail. They come in
patent Leather and Gun Metal, 9 QQ
$4.00 and $4.50 values, at 9iVl7
Ladies' Ciotn Tops in Gun Metal and Patent, in
cluding the much-desired "Baby O Gl
Doll Shoe," $3.50 and $4 quality. . Hc9
Ladies' Gun Metal and Patent in Button and Lace,
low and high heels, $3.00 Cd CC
values, at r..T. 9 I wPr
' A big assortment of Ladies' Shoes in button and
lace, of regular $2.00 and $2.50 Ok 4Q
values, at "1IW
Men, do you want the best in shoes? Our line o
Shoes cannot be duplicated anywhere under $5.00
and $6.00. A large assortment of the famous
Walk-Over in all styles and x ttVl
leather at ;...IB '
Men's dress or work Shoes
Tan, $4.00' and $5.00
quality, at 1
1(1
Men's best Shoe's, made
regular $4.00 values, .
at : :
in
A very large assortment of Men's Shoes
Metal, Button and Lace,
$3.00 values at
in Gun!'Metai and
$3.49
Lace and Button,
$299
in Gun'
$1.99
A very -big selection of Boys' and Girls' School Shoes in all leathers and styles: at prices which will
save you fifty per cent, on the dollar. ' """
Men's and Women's Slippers RestfuI'Pleasing, Full- of Comfort. Auvery,, desirablegift f or, all at
THE LOWES PRICES. ' " " - , - -
Pill HHH
1 shit
I Mhm
f '( . iHF. ilal .S NM KW ,1
1 1' jrmmm
SHIHk
m;vasmsam i
ummrn mKM)mm:,i
O BE OLD AND;
ENN1LESS IS A
TRAQEDY
jRE YOU PUTTINC
MONEY IN THE
NK FOR THE
ECEMBER
OF YOUR
FE?
f-.
o-
jr
,
Iere is nothiner more ritffnl than th ciirhf- nf- c$xh
AGE entirely dependent on the assistance and charity? k
viiw. x o, liuy gu 'aiuijy, ucuv cuter uav, weeK.Tcei weeK.
letting money slip through their fingers that should be
lin iri fV. r UnJr 4- l. i.1 r -" 111 -, . ,
u ui uiic uantv lu Atsep Lnem Gomiortaoie ana maep(
A twhen their EARNING POWER is GONE. "Why doirWOU
Rubbers and High Top Shoes of all kinds and description at wholesale prices. Satisfaction guaranteed' start a bank account NOW?
BY THE
RELIABLE
H t
HOUSE " r I
Make OUR bank YOUR bank ' r--
"iJt
i
5"V
. '
1
l
K '
We-pay 3 per cent interest on Savings "
DEPOSIT BANK OF
!DAN OOH E3 JST ; !
UmVAmjm.
M. H ALL, Prewocnt?
CK. THOH.
X" -
:?
a i
H-J. V
M , 1,T-
r - -v
fjk
-ggpgpPPPPjpP VHSHHH9 IH flF;
L
-.. :r
.&mr - - - - . , ..rear " -aft'4. 'J - ftiK,'' StT JSPWr-. w1 T!tocitf 1?- ,-r- ,w . . jt WT 7 , HOim -VC J&ttlrf' -&i .0tf3STer
- - i , 'f , .-5fc7v- - ' -T& : ??A " '& Tr-'..? !-fc ry
f - - . - i - r -!- s "t cr- -. 1'HUL "as. i. f '" -.!- -k . . i. i sv t ' ixr " Ftfomt- 5 .r,75:iEiw ep ":. a.jr