m
;
PAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
TUESDAY, FEBRUARY , 117.
REAL ESTATE DEALS.
I
I N I I
tt '
"
MILLERSBURG
DEATHS.
!
,1
sides his wife, lie is survived by three' x"c.ou BU1U , , , "' ' Ifar b
L daughters, Airs. Ella Smart, Mrs. Mol-!to"; 19.' ares of land "earf 'loi
5. Ho PnftoAsn,, nnH Mrs NTufH Rf ov.-. I Vllle, in SpeilCer COUllt.V, tO L. H.
Three important real estate deals
were consummated; last week through
the agency of the Paris Realty Co.
Mr. R. C. Linville- sold to Mr. David
Miss Marearet B. Clarke returned xvATrnM uromoie, or tine biiawnan vicinity, nis
Thursday, after a protracted visit to , Mr w M Walton, farmer, aged ' farmf of 98 acres located near Taylors
Mends in Louisville. I sixty-five, died at his home on tii v,IJe .m Spencer county, for a price
Mr. and Mrs. S. C. Bascom an 1 Greenwich pike, at two o'clock ver not given out Mr. Crombie will tako
little daughter. Sue. visited friends at trH,v nftomnnn nf nnpnnimiin. Rn. 'possession ot uie properi in March
Ownigsville. Wednesday.
Mrs. B. S. Barton and little son
James Earle. .ire visitinc her narent
Mr. and Mrs. J.rmes Overley, at FIem-,artt and two sons, Messrs. Charles and lnfk0 ? bon- ot wington, at a pn
Sngsburg. i Thomas WaUon. TJie funeral arrange-, , pn cf . ,. r,
Tr k a. "Rurrouirlis and sister. ,oto v,o,i noi vQO nnmniinii nc tiir through, the Realty company.
Miss Nannie burroughs, attended thCjXEWS went to press last night
funeral of a jciative at Mt. Sterling,
Wednesday. j NELSON.
Mrs. Bailes Debelle left Frida-' ir. Frank Nelson, aged sixty-nine.
lor her flicmio at Ewing after a several ,je(i at nS home on Massie avenue, in
days' visit to her daughter, Mrs. Ma tnjs cjtVf Saturday midnight, after a so,
nel Courney. short illness. His death was attnum-
Elder Ale Saunders moved Mon-ed to organic heart trouble, as he
3ay to the Mitchell house at Fan-. 1:a(1 beeu m iut a sliort time. He n
survived by his wife and three sons.
BIRTHS.
In Evansville, Ind., to tlie wife of
Eld. Wm. E. Sweeney, formerly or
Paris, a daughter; first child.
Jle has been boarding for several
mnnths with Mr. and Mrs. S. E. Bruce.
the Realty Company. M
W. H. Anderson, of Paris, Superintend
ent of this division of the Louisville
& Nashville, purchased tor his niece,
Miss Josie Alexander, formerly of
Paris, now attending college in Chi-
the two-story brick business
iiouse on Mam street, occupieu uy
The Sweet Shop. The price paid was
not made public. Yhe property was
"owned by Mr. and Mrs. W'm. Bailey,
Horace Nelson, of Paris, James Nel-
Mr. M. J. Fanning, of the Anti-Sa- gon of Batavia, Ohio, and Lloyd Nel
loon Iveague, delivered a lecture at tiu- S01U 0f Winchester; two daughters,
Methodist church on State Wide prohi-J Iiss lelissa Nelson and Mrs. Josij
fcition Thursday evening. A good au , Frv of paris.
dience was present notwithstanding Funeral services will be held at the
Jt&e inclement weather. This is Mr fa,mily residence on Massie Avenue af
Fanning's third appearance in our lon 0-clock this (Tuesday) morning
midst. His address was good. conducted by Rev. Dr. O. R. Mangum,
Miss Dorothy Peed arrived Satu- pa&tor of the Taris Baptist church.
day night from Birmingham, Ala. Mi& The interment will follow in the Paris
Peed occupied the diair in one of the Ccjmetery.
graded schools of that city, and was!
compelled to resign her position tern- FLETCHER,
porarily on account ot ill health. She J Mrs. Sup Fletcher, wife of Mr
underwent an operation last fall for y. Fletcher, of Lexington, died
swmendicitis. and as soon as she was iOUr o'clock Sunday morning at
MATRIMONIAL.
IIENSON GILLISPIE.
County Clerk Pearce Paton issued a
marriage license Saturday to Mr. Ne1
son Gillispie and Mrs. Mollie Henson,
both of the North Middletown vicin
ity. The couple were tmarried in Oio
court house by County Judge C. A.
McMillan.
FROM THE WILD AND
THE WOOLLY WEST!
of Lexington, and lias been long knou n
as the Sirnrer oronerT. The Sweet
Slinn unrlnr tho jmsnirps of Mr. nrwl t In a letter to
Mrs. 'Clyde Keller, will remain in tlU'lNKWS staff, Mr. James B. Fee, for-
linnse. tliev bavins secured a lease on merry ot nns, now manager ot a Dig
a member of THE
it.
Iti.: tonnn
1 ill It), 1UI IO,UUU.
At the same time and
place Au--
pjtioneer Kenney sold for Master Com-
at missioner uscar i . Minion a nousc
the and lot in North Middletown. belong-
able resU-iu-d her duties without tak-.ivanhoe Apartments, Hampton Court. S to uie larwe neirt,, uo nwuj o.
ing any rest. The strain has proven1 j,. Lexington, after a short illness. I CaPv ' for ,? it e lir. , f
too much for Jier and she will not Mrs. Fletcher before her marriage' Mr. T. Strother Scott, of Wmcheste..
take up school work again until next J was Miss Sue Patterson, daughter of! agent tor L. E. Swetnam, ot Bourbon
fall. iMr. and Mrs. Noah Patterson, of Har J county, sold the latter s farm of lltt
Quite a number of ladies repre i nsoix countv. She was a frequent vir.-j acres near North Middletown to Jas.
senting the different churches of the,jtor in Paris, where s;he was always jMunday, or Winchester tor?l40 au
townmet at taie home of Mrs. W. M.hvelcomed in social circles for her acre. This is one of tiie best improy
Miller. Mondcy afemoon, and per-lc,.r.rming personality and gracioin I ed farms m the county Mr Munda
fected a temporary organization forimanners. !lH rcnt the m an(1 roma111 In Wl!l"
tlie establishment of a civic league, j ivs. Fletcher is survived by he' Chester,
the purpose of which is the improve-'mother, Mrs. Agnes C. Patterson; one'
nient of the I own. Mrs. W. M. Millc- s.ster, Mrs. D. L. Cobb, of Richmond The BfUCC MtlleT farm
-was elected i-resment pro tern. Ainm one brotner. iir. Migcins i-aitui
aneeting was held at the city school son. of Harrison county.
at 2:30 o'clock on Monday. Quite :i J The funeral will take place
number of our ladies were present, nor- tie Grove Cemetery, m ryntniana, ;u -rhnrriat Pr-'h 7 Spp
Oakford Hinton and Miss Minaker. nf jj, nie funeral party leaving the fam
Paris, were present, and organized the jjy thojme in Lexington in automobiles
ody as a permanent order. 'at nine o'clock.
The stock and tobacco barn of Mr.
J. R. Long was destroyed by fire about ' SNYDER.
7 p., m. Thursday, and with its con- Ajr. John C. Snyder, aged fort
lents. was au entire loss. The barn one. a well-known uaper hanger and
contained Hie entire crop of tobacco, decorator, who has unade his Jiome in
lanche near Merriam. Knnsas, says:
Auctioneer M. F. Kenney sold at th At tne rate i(ne winu nas ueen
court house door in Paris yesterdav blowing out here for the past two
for the Paris Realty Co., a house and days, Paris' new skyscraper, the First
fifty acres of ground, located on the National Bank building, would tumbl?
Paris and Clintonville pike, belonging , down like a house of cards. The winl
to Mrs. Wm. Neal, to John Cain, ot.nas kuul uo a ssieauy velocity oi uo
miles an hour and still going. Tha
temperature -Jias randeg from 15 to 20
degrees below zero. That's not cold
(for Kansas). We have our own oil
well and gas well and also have steam
Jieat in the ranche mansion, so we
manage to keep comfortable.
"While in Kansas City last week J
met the two young Link boys, .Tom
and Robert, lately of Paris, and too
them out on the Kansas ranche with
me for a day's visit. They certainly
did enjoy themselves, and are coming
back, to go on a wol2 raid rabbit drivo
that is to take place in the next week
or so. The Link boj's are doing fine
in Kansas City. They are in the auto
supply buitness. Robert Link is to
lo transferred soon to Louisville, Ky.,
Coming
Attractions
PARIS GRAND AND ALAMO
Tuesday
Norma Talmagc
in
ii
Fifty - Fifty"
Triangle Fine Arts.
Chester Conklin
and Keystone Favorites
Kin
"A Tugboat Roraeo"
Keystone Comedy.
WEDNESDAY.
Edna Goodrich in
"The House of Lies"
Moroco Feature. Charlie Chapman in
"The Pawnshop." Another scream.
THURSDAY.
Louis Glaum and Howard Hickman.
m
"Somewhere in France"
Thomas H. Ince production. Fred
Mace with Keystone favorites in "HLs
Last Scent." Keystone comedy.
Hours-Alamo, 2 to 5:30; Paris Grand,
7 to 10:30, Admsssion 5 and 1 Oc.
!of ! 22 QCXCS nCQT PsriS, as "manager or a branch of the Times
in Hi. ,wSH lC ax' iirtion !bfmare Auto Supply Co. He is cer
" ..V Wl" be sola ft? aucTion,t.linlymnklImgoort.
. Thursday,
descriptive advertise
ment on page 2 of The
Kentuckian-Cilizen.
Mr. Fp" enclosed a number of kodak
Mews of inlorestiner scenes on the big
ranche, of which he is general manager.
PERJURY FEAR STOPS
ANNULMENT OF MARRIAGE.
FORMER BOURBON COUPLE
CELEBRATE GOLDEN WEDDING
e999?9S4
valuable stallion, jack and jennet, and Paris for the past fifteen years, when
all his farming utensils. The loss ib iie Was in the employ of Mr. S E
estimated at about five thousand doi- Borland, and others in his line, died
fcirs, with only $500 insurance on the at his home in Thornton Division af
barn. The' had stripped tobacco m neon vesterday, after a long illness oT
the stripping room during the day uy tuberculosis,
a comfortable fire. After they wen mi Snvder was a native of Lexing
through, in. the evening Mr. Long pu. ton, where Jie served his apprentice
tibe fire out hiaiself, and in order to ship
make sure iie sent a colored man to ears ago and
tl! ham. after he had cone to tl Un wont into businoss for himselt a
In the case oL Thomas Ilison and
Blanche Taylor, both of Woodford
county, love's young dream caiine near
being as completely shattered as -i
Charlie Chaplin comedy pie. After
many fears and vicissitudes love final
ly found a way and the couple were
He came to Paris about fifteen untied in marriage by Justice Ilearn, Thqmas
worked at his trade in Lexington.
Itison, who is a young farmer re
house, to see that the fire was out few vears ago, but. his health failing, siding near the bayette-Woodford line,
No cause can be assigned for the fire, he became identified with several and his bride-to-be, Miss Taylor, both
and it is believed by some to be the traveling carnival organizations, in being from the same neighborhood,
work of an incendiary. Friday even- hopes that the change of air and sur- came to Lexington, Thursday, and
ing about the same hour, the home of roundings would restore iliim to health made the usual application to tlie
Charlie Turner, colored, near the rail- Several weeks ago he lost his voice County Clerk for a (marriage license,
road, with its contents, was destroyed entirely, due to the ravages of the dis- The Clerk of the County Court, sus-
by fire, it having originated from thf ease which was preying upon him. pecting something wrong, refused thci:'
overheating of a hot air stove, which ir. Snyder is survived by his wif license because he did not believe the
bursted. Owing to the severe weather who was Miss Ida Willett, of this citj ; girl was of the legal 'marrying age.
and the scarcity of water in the neigh- i,js mother. Mrs. Ruth S. Snyder, of Leaving Lexington they came on to
borhood tlie building could not bo Lexington; four brothers, Messrs. Ern- Paris where application was made to
cnvAfi A snl.srrmt ji was taken 01 net Hnmr. cinnrir6 and Charles Sny- Countv Clerk Paton, who, upon the
Saturday for the ren.-f of the stricken der, all of Lexington, and two sisters
l Mr. and Mrs. Watt M. Gay. former
iiiourbon county people, celebrated .thi)
the golden wedding anniversary at
Winchester recently. Mr. Gay is now
eighty-one years oT age and his wife
seventy-eight. They were married in
Hourbon comu1j fifty years ago. Only
two persons are now living who at
tended the nedding. They are Mrs.
Goff, of North Middletown,
this county, and Mrs. Thomas Bradley,
of Winchester. Mr. and Mrs. Gay are
both remarkably well preserved.
Eider J. W. Harding, of Winchester,
who performed the ceremony, is the
only man now lhing in Winchester
who was a resident of the city at
that time.
The Worst Handicap
in the world is WORRY it ties a man hand and foot--takes
off thej edge of his talents and cuts down his
ability.
WORRY as to what will happen to the family if any
thing should happen to you, will do more than anything
else to reduce j our earning power.
S LIFE INSURANCE solve the problem-the day you get
5 your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
i The Northwestern Mutual Life Insurance Co.
S R. F. CLENDENIN, Associate General Agent
m
Suite 201-202 First Nafl BanK Bldg. PARIS, KY.
family.
(Otilier Millersbur:
on Page 2)
ATisc Harriet Snvder and Mrs. W. C.
f Frederickson, of Lexington,
i The funeral will take place at th-
Methodist church, in this city, at two
(o'clock to-morrow (Wednesday) after-
'noon, with services conducted by Re
Whether there shall be six week-5 w. O. Sadler, the pastor. The inter
luore of bad weather was det-mined ment will tollow in the Paris Cenie-
THE GROUND HOG WISE?
girl swearing to the required affidavit
as to ther age, issued the license.
In the meantime, Mr. and Mrs. Mi'
fred Taylor, who live on the Lewis
Johnson place near Midway, came Lo
Lexington to appeal to Chief of Police
Reagan for help in finding the girl.
who, they asserted, Jiad run awav
from home, and not being of age, they
Friday by the "Ground Hog" seeing tery. The pall-hearers will be George would not give their consent to her
his shadow. If th? old-time superst:
Tion be true, then we are in for six
weeks more of all kinds of weather.
The "Ground Hog," according to
"many who ere confident that his cus
tom has the effect of prescribing the
veather for six weeks more, cl uerged '
from his winter home Friday some
time durintr the day. and saw hi
shadow
entire day in the open, while othcis
contend that the time for his appear
ance on the stage is between twelve
and one o'clock. In either event his
Hogship undoubtedly saw his shadow
and went in for anoliier long stay
Mnotliar nf flio fllrkwinp- liav rprtninl 1 111
VVCfclllA V. WiW tvVMMQ ..j -- .r
gaye some strength
hog's" claim as a
prophet.
r T...,. rn ."ifnr- rm I' VV 1
lett. Harry Snyder, Charles Snyder
and George Snyder.
FEEDING EWES IN WINTER.
Large lamb losses ro due to im
pioper care of ewes previous to lamL-
Some declare lie spends th- rg. The feeding practice oiioweu a
rne rennsj ivama ouilb uiisu .- u
follows:
Ewes aro bred during September and
October, insuring February and March
lambs. The latter part ot isovemoer
marnace. unon "testimony it was
learned that the marriage license had
ibeen obtained in Paris upon affidavit
ot the girl that she was of age. This
i would have implicated her on a charge
of perjury if any attempt had been
imade to have tihe tmarriage contract
broken, so that marriage of the couple
was not interfered with and they
were married and may live happil:
ever afterward!
RANGE SALE!
IN ALL DEPASTIMfrNTS
A VMJk
OIL FROM FRUIT STONES.
Germany is preparing to take steps
'... .,-. tnlrt.- -ff nootiirn nnfl nlnnorl I
'1110 i'w - "."" jj.v ..... ""A .tmvnrrl rnlievinir hpr shnrtaEre nf nils
i r.r i '" ---. j a
winter quarters. During the
to the "ground .month they receive us f"' kernels of fruit-stones,
reliable weather alfalfa hay as they w il consume w ith,
two and one-lialf to thiee pounds o whl-1l . frPpiv tii
:i .nfc .iniiv to pnfh nni- 0l nicii grow Lreeiv tii
'KENTUCKY SHEEP AFFECTED
BY STRANGE MALADY
corn silage or roots daily to each ani
mal, in addition to hay. About Jan. 1
ewes receive a limited grain ration
varying from one-forth to one-half
pound per day, depending on their con-
Postmortems made by the veterinary "tlition.
department, Kentucky Experiment Stu , Ewes receiving a grain ration betoic
tion, at Lexington, have proven thai lambing always produce more milk lor
the malady which has carried off many , lambs. The grain mixture used at
hundreds of Kentuckv sheep witaiin tlie State College farm consists 01 fie
last ten days is nodular disease, ac- parts of shelled corn, three parts 01
cording to the announcement. Farm oats, two parts of wheat bran and one
crs in large numbers who have report-( part of oatmeal.
ed losses feared that a mysterious, After lambs are born the ewe wi.l
nialadv was abroad. The blizzard, with (not consu)ne as much roughage feed
consequent restricted exercise, and , More grain is then necessary to give a
dry feed, is held to be merely a sec-jmiiK now sumcienu 101 tne uublu
and fruits by extracting an oil from the ,
such as the
the cherry, both
there. The pits .
are poiled in a calcium chloride solu-j
tion, which separates the kernel from
its Sfiiell. The oil is expressed from
the kernels. The chief difficulty lies
in the fact that the kernels of such
fruits, especially the peach, contain
minute quantities of hydrocyanic acid
sometimes called oil of bitter almondi.
This is extremely poisonous, but spe
cial methods have resulted in its
presence being reduced to a mere
negligible trace, according to the re
ports.
." '. mi - I -I4-- rVirti!l
ondary cause. The disease is said to of tlie lamo. ine gram uumuic ouuu...
be preventable, but not curable, its .oe increased, mereiure, uue-uoujiuuuu
xiroc arp rrpntr-sf ill tllO la.ulul!lir or imore Oail per e, ueijcuu.ufa v.
r ...i -;c., ,-c inu- nnri thf.iioT nnnriitinTi nnd also unon tJie num- enjoys
eUUIl, Wiicu uoiouiiuv, o i., ....v. ..-1,,. w...-- -
KENTUCKY BIRTHPLACE
OF MANY STATESMEN.
mortality is running in tihis section as
high as fifteen per cent. With sheep
at the highest prices in history the
loss already has been great Nodular
disease made its appearance in Ken
tucky only a few years ago.
ROLL OF HONOR AT
THE SHAWHAN
SCHOOL
ber of lambs she is raising.
vovt in nrnnpr feedinc exercise is
Few persons either in or out of Ken
tucky, probably know that that State
the distinction of having fur
nished to the country fourteen Speak
ers of the House of Representatives
considered the most important lacior i "m , - ve uuvemuih ul umuieui
in keeping ewes in good condition for States, fourteen cabinet officers, three
lambing Exercise lots should be weU vice-Presidents and to the Supreme
rirainod to nrevent sore feet It is well .Court three Justices in addition Lo
t oiiftW .PS to ranee on pasture dur- those now sitting. Tdie figures were
AS! Winter
SHOE
And Rubbers
MUST GO!
Despite the great advance
in the price of Shoes and
Rubbers, we have greatly reduced all short and bro
ken lines in Men's, Ladies' and Children's Footwear.
PREPARE NOW!
An opportunty offered you to supply yourself for
present and future needs.Come here tomorrow and take advantage of this BAR
GAIN CLEARANCE SALE!
f JiMfi-ib
'(
Ladies' Dark Russia Calf Boots
S6.00 values
Ladies' Dull Kid High Cut Boots
S4 50 values ......-
Ladies' Patent Kid Cloth Top Boots
5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values
Ladies' Gun Metal. button, S2. 50 val.
Ladies' Felt Boudoirs, $1.00 values
Ladies's Felt Juliets, fur trimmed
1.50 values
$3.95
3.49
2.99
2.49
1.69
.59
.99
Men's Russia and Plat. Calf English Walk
Over Samples, 6.00 values $4,00
Men's Russia and Platinum Calf Walk-Over
and Beacon, 4.50 values $3.49
Men's Gun Metal English Medium Toe Welts.
4.00 values $2.99
Men's Gun Metal Button and Lace
S3.00values 1.99
Men's Tan and Black Romeos
1.50 values x .99
Men's Black Felt Slippers
75-cent values 49
Boys', Misses' and Children's Shoes at Bargain Prices.
ing the winter, since exercise give
strength and enables them to produce
lambs with less effort and of a strong
er, more vigorous type.
THINGS TO WORRY ABOUT.
The roll of honor for the fifth month
for the Shawhan School, as reported
bv Mrs. Ana FishbacK, tne teacner, 1
as follows: Grade IV Homer J
son, Edna
Hazel Crombie
mpr and
... 'wrs"i--.. n .. J A - lntfiil
EftTSE 5."do a ISiSrta; Wins clerical forces of
I m ...111 nnln lo tlirOtt ll "ll Ifl Q V 1
Wll-l 1 Utile '" "".' " ."- .w..v., w
" I. .. T.4 mnniti n.t TI'rkVn110TVC!
E. Wilson, Hallie Howard, !" ,"" 4 n " i Jnr.oin'B hirtlidac
. Grade A 1waays a -;-!-"""--LnV., Wrtlidav. As tiu-
Marearet Longbottom. uraa " "tt" e..-.i,". i, i..'
i tiist-namea coiuus uu omm, wb no.
furnished in an address recently by
Congressman David H. Kinchole, of
the Second Kentucky district, to the
members of the Kentucky Society of
Washington, D. C.
FEDERAL REPORT ON
PAPER PROBE HELD UP.
of 90 per cent
The Federal Trade Commission's ra
port on its print paper investigation.,
although virtually completed, probably'
the post- will be held up for some days, it was'
office and banks will get a double hoi- learned, until further inquiry is made
idav: the second-named, Lincoln's
birthday, comes on. uie umuwius juuh
concerning tlie effects of a Canadian
government order fixing maximum
news print prices in Canada. A meet
ing announced for Chicago between
manufacturers and publishers also
Australian engineers have invented 'day, February 12, and the birthday of
itliree-raii switches for use by rail-j "George Wash" comes on Thursday,
.;",.. .i uy rails nr laid in T?Ahniarv 22. when everybody save
e(xlL track to accommodate rolling the newspaper people can take a day may bring developments that will have
stock of different gauges. ioff and help celebrate. la bearing on the report
FROM THE
MacDonald-Kiley Bankrupt Sale
Mien's Migh Grade M. & K $1 O.OO and $12.00 Shoes
Varsity Shoes AA to E
ON SALE HERE AT ONE-HALF PRICE
DAN
C0HEN
Paris' Greatest Shoe Store.
335 Main Street, Paris, Ky.
t
-, M