s
! -
t y--
4
t
S
i
:i
:i,
';
f
f,1
10
w
v.
Hr'
;
MILLERSBURG
-Miss Lillie Letton is among sick.
Tvr t n. Aiian nfi ivife pior
Shanks remain very much the same,
Mrs. Bailes DeBelle. who has been
with her daughter, Mrs. Mabel Court-
ney, since last Friday, who is among
the sick, returned to her home at Ew-
ing, luesaay.
"'tT r " f r r r f fna
tut i nS!" Hon Smthp thr.
St corned? drama full of wit anl
. if .m h wwh n,o nr,o nf
Don't forget "Prof. Pepp at the
iiimnr it win ho wnrth tiip nnce ot
" -
admission, 25c and ooc.
Messrs. Wallace Bowles and G. M
Jones went to Cincinnati, Monday, to
enlist in the Navy. They were accept-
ed and were assigned to hospital boat
work at Newport, R. I. .
trTdPfPfprigthe M1 MlSmontS indicative of loyalty as a big one. ti active daughter of Mr. and Mrs. Vic- destroy all unsanitary conditions exist-
home -rounds Tu-eday' a'fternon by ? There is another common error in tor Ross, of near Cynthiana, and the ing in our country. It would be a
' score of 11 to 2. The M. M. I. were the display of the flag by private citi- groom is a prosperous young farmer, good thing if town government would
" outclassed. A return game will be zens. Once -placed in position, it is the son of Mr. and Mrs. D. R. Johnson, adopt this same hobby. We would
played at Georgetown between the frequently permitted to hang or float On their return they will reside tem arouse our health officers. They, poor
, teams at an early date. from its g DOth day and night, porarily with the groom's parents. men, have struggled against such great
No clue to the identity pf the par- Nqw although g heart of Francis McDANIEL CARRINGTON. odds for so long that they have almost
ties who placed the dead body of an cheered b occasionai . At a thimble party given in Mil- given up the fight Abolish rubbish
2 ImSvM week has vet glimpses of the nation's standard on a lersburg by Miss Ashby Leer, in honor piles and all other such traps of dis-
iTen discovered The authorities are certain night, by the glare of the rock- of her guest, Miss Alma Hopper, of ease and you will find that the sick
btill working on the case. Various ets a,nd the bursting of bombs that was Maysville, a pleasant surprise was list in our town will greatly diminish.
theories have been advanced, but none jn battle, when the flag is .never low- spruug upon the assembled guests.,
of any practical value in tracing down ere(j Ordinarily the flag is raised at Just before lunch was served, Miss AMERICAN ASSOCIATION OF
the guilty parties. sunrise and lowered at sunset. If the Josephine Leer, the attractive young. tATE HIGHWAY OFFICIALS
Miss Aleta Wilson will give a dra- private citizens does not raise his daughter of the hostess, passed cards ,
v matic interpretation of 'The Snepnera flag piecisely with the sim ne ought to each guest, bearing the announce-' The American Association of State
?nlie ?iUSwoe n? R-iTnVlock or at least to lower it before dark. The ment of the engagement of Miss Kiz- Highway Officials has tendered its ser
p eveninlo' Monday April 23 The sight of flapping banners in the night zle McDaniel, of Millersburg, to Mr. vices to the Secretary of War. The
;i win ho tf-vMi under the direc- does not inspire, but, on the contrary, Charles Carrington, of Ravenna. The Executive Committee of the Associa
uin. at .-v-.. -.
tion of Miss Ethel King, assisted by
Miss Caralyn Mclntyre. ;
Dr. Harry Mathers has removed
his dental offices from their former lo-
cation over Cahal's barber shop, in
Paris, to rooms on the third floor of,
the Agricultural Bank Building, be t
tween Fourth and U.Oaawaj, wie-
timers and new ones as well. - iuS their jobs, despite the establish- McDaniel, of Cynthiana, Mr. Carring- At the sama meeting, the Executive
CUfThe Citizens of the suburb of Mil- rnent of the "merit system" by presi- ton is a worthy anil energetic young Committee decided to hold the 1917
lersburg. just north of town, oiled the oential decree. Postmaster General business man in the employ of the meeting of the Association at Rich
xoad Tuesday and Wednesday, and Burleson has announced that incum- Louisville & Nashville, at Ravenna. monJ, Virginia, December 4 to 7." In
Tience are free from ,dust. Those who uenU will net be disturbed so long as jnss McDaniel is very papular in vitations for this meeting were receiv
ti re ' enjoying the fruits of this are. tJiey perform their duties satisfa- Millersburg society, and the news of ed from 61ie following cities: Chicago,
Judge T. P. Wadell, V L. Barton. K torilj her engagement wiI1 be a pieasant 111.; Grand Rapids, Mich.; Toledo, O.;
D. Burroughs, R. U . ilon anu w. u. TWg may disappoint Fome reformer. SU; prise to her many friends there and Buffalo. N. Y.; New York City, N. Y.;
( Fr Caldwell in Butler who wanted to- see a radical sweep, elo.swhere. .New Haven, Conn.; Ashbury Park, N.
ddition l ' ' with no postmaster retaining his office- J; Washington. D. C; Riclimond, Va.;
3 The spirit of the times has struck unless he has passed a drastic test YOUNG MEN ENLISTING' I Norfolk, Va.; Railegh. N. C; Pine
Millersburg. Flags are seen floating It nuy be expected, however, thatj )N THE u S- NAVY, hurst. Nt,C.; and Jacksonville, Fla.
about many of our patriotic liomes and there will be an immediate improve- j t
business houses. ine m. m. i. m
etect an iron flag stan. iuu leei U1"
et ten feet in the ground, inau lv
nS will" be' anflae raising on the
imiind several prominent speakers
111 be present, and it will be made a
patriotic day in Millersburg. Every-
one is looking forward to this event.
"
DEATHS.
GLENN.
Mrs. Susan Glenn, aged eight-fle,
a former resident of Paris, died re-
cenUy at her home in Cincinnati, after
a long Hiness, aue to cue """"C3
of;ftge.
Mrs. Glenn was the widow 01 .ur.
John Glenn, who Tor years conducted
a carriage shop in he building at Uu
corner of Fourth and High streets,
nn-w oecuDied by the Dickerson &
Douglas Garage. Mr. and Mrs. GJenn
Tesided for several years in a cottago
adjoining the residence of Dr. Wash
Pithian, on Pleasant street. Mr.
Glenn died about ten years ago.
The body ot Mrs. Glenn was inter
red in SL Joseph's Catholic Cemetery.
-in Cincinnati, besides the body of her
husband, after funeral services held
at SL Edward's Catholic churcn, m
Cincinnati.
;many gardens are started.
tj,o hsc hPPn much acitation in
rpj and urbon Tufty af well a"
niZ ol Se slitT for the
? f pL land siace this
planting of l ido8e
7r in rdens beaje ol the prob
able sHortage ,nnJ" ' ehPa7e
pie of Paris ana tne p"
been responding loyalty to the sugges
on, as far as er haJl
have permitted and i .is PaDi:
UUbL UICIC "" " "4V' w
done this year than for many years
past.
-
The farmers of the county are to ba
appeafed to to plant more of their land
in food stuffs this season so that there
will be no starvation or food riots in
this nation as there have been m
.other warring countries.
"What we can't understand is why
that enormous excess of Austrian
prisoners doesn't capture the entire
Russian army.
" ' "
GET INTO THE GAME.
Carl Vrooman, Assistant
r Arir.nltnre. cives the
Secretary
following
timely advice:
"xcithnnt. iroinz beyond their
door-
:. -.i r Aprirem wo'men and
yarub uiiiixwiiij v. . --
niT-on ran render service to tne
COUUreU WU -"
Tiition right now as real as tmn. ren- one-int k" wi b 0 tUe my, uuu wuhub lu uu mo -
a eA bv the dier on the field ot Paris on the Paris grounds. He was'most to realize such an ambition
t& tni A million gardens planted in drafted by the Chicago White Sox, but.such a type makes the successful naval
irrffiP suburbs and country would was sent to the Lincoln, Neb., team officer. Such a man has within his
n.ne ""' of millions Qf pounds of the Western League for more sea- grasp the chance to become the com-
,TTf,3Ji t our allies Plant now Get soning. He was blacklisted in prof es- j mander-in-chief of one of the world's
?vh! Lp and do your bit to win slonal ball because he refused to pitch greatest fleets,
into tne game, j .q league and retUrned j America's future is linked with sea
ware manv vacant lots in Paris to his home in Louisville. He after-1 p0wer. Our merchant marine must
w -h id and should be cultivated ward played on the Frankfort team. In become a reality, not a vague hope.
wnicn. oouiu to add their snare the soason Gf 1916 Monroe found his Our navy must be powerful enough
this year an Qnal f0Q1 suppiy gait and was the feature of the entire ' to keep the seas open, and our coasts
vlf wardening is one of themost league. He was bought by the Mem-jsafe, at all times. The men at An
vacant w. reducing the cost phis team of the Southern League and napolis to-day will be the moving fig
effective meinons aoil Yv th N'pw Ynrk Ameri-' urns, in a tew vears. n rarrvinsr our
THE FLAG.
f. (-New Tork Times.)
The display of the national colors in
this city is inspiring. Especially in
the quiet residence neighborhoods itri
flag of the nation is shown so gener-
allv as to leave no doubt of the abun-
dant patriotism of the householders.
But it is doubtful if the draDinir of a.
large flag like a superfluous curtain
on tue front of a building is the proper
w tQ djSpiay our national symbol.
,. ;nforon0 ic tun tbp nwnpr nr
i,s,, i, ,,to,-nn,i o
The inference is that the owner or
lessee of the building has obtained a
flag too large for his purpose, anu,
hpinir unnhle. to accommodate a Dole
... . . . . i i t -
oeintr unaoie to accommouaie a noie
large enough to hold it, does the best
ne can to demonstrate his patriotic
ardor. Every flag, however, should
nave itg poe The' two shoui,i De in.
,.,. .,...' tllG flae. is on view out
. ,. e A OT., flofr . no efrM1ri.
- ,! cmni flno- ic n a otrnnfri-e
irritates sophisticated patriots.
POSTMASTERS ON TRIAL.
and
Nearly all the first, second
Hiirrl class nostmastfei-S are Still hold-
n)ent noticeable and Uiat more pos
masters will attend to their jobs from
now cn than ever before in the his-
tory ol tne department
A .postmaster will now naturally feel
that he has to "make good" just as Iip
would under a private corporation. II
he was appointed for merely political
leasonp he'll probably do his best to
forget politics for a while. If he has
been letting capable subordinates a?
nearly an nis wont ior iwiu-uu one years' sea service, is eligible for
many postmasters have been doing one of these vacancies, and the ex
that very thing" hell feel a natural i,mjnations are entirely competitive,
compulsion to master the job and keep the highest ioo men receiving appoini
those same subordinates from crowd 11)ents
incr him out of it Any postmaster who rr.ir, nvon0 vrmcr rvmn i tua wnCT.
ig unwiling to take his position sen-
cusly? or unable to perform its duties
satisfactorily, ought to be weeded out
without compunction, when lie
ence had a chance under the
i egime.
ha?
new
MIRAGES EXPLAINED.
The published statement of the ex
piorer Donald B. McMillan that thn
arctic land mass which Admiral
Peary leported and named Crocker
Land was but a mirage, has stirred
new interest in this strange phenom
enon. which can deceive an experi-
ence.l observer into the beliei that he
sees plains and mountains nere uier mended by their comraanuing officer,
i& nothing but a few clouds. The'an(J an officer zealous of maintaininc;
mirage is due to the appearance of ih h fc trodtions of the naval SGr.
small objects seen through layers oC!vic6j win give preference to the ablest
yir at different temperatures, which ' d hi This nlaces t.hp. hleh-
bend the " of light and distort th. est honors of the naval service within
& much as the image of a peuC!1 the 'grasp of any young man who -ha,
half Emerged in water is distorted. ..mWe fitness to win
A typical mirage is often seen in the The regiment of midshipmeil are ai
desert, of the Southwest, where it be- ways the personal guard yof the Pres.
cQmes qme cool . gun . inauguration The A(jad.
brings a sudden change in the morn.'cmy course being for four years, every
ig, so that temperature x layers are midshipman participates in one inau-
& smg busheg ap Ufe &g
pear as great trees, with their doubles a commissioned officer, in many more,
below them, as though mirrored in. Midshipmen make three cruises
otill TOator It was a Similar nhenom
cHii wntpr it. was a similar Dhenom '
, . . . - .- . - . ,,Qtltp in
eUOH M11U11 ilia6"llCU. a iwuu " .--
look like a continent.
F0RMER PARIS PLAYER
MAKING GOOD AGAIN.
I ine i-aris ineuus vi uie " i",uc'
'who was a member of the Paris team
in the late lamented Blue Grass
League several years ago, and who is
now being given a try-out by the New
, York Americans, is making good in the
practice games. Monroe recently
( pitched a 1 to 0 exhibition game
I w i- ; r I AM 4 . G U "Orl Tnnprto
agamst tne aosion ia.Liuiiu.i icaui,
lowing them but a few scattered hits,
He is looked upon as one of the most
promising young recruits of the pres-
ent season.
- Monroe's first taste of professional
Dan was m vj., "c" v
I .vinirfnn Q irn incjt
1ft10 ili rr r rtffillDi fl
MATRIMONIAL.
V
JEFFERSON GIBBINg.
marriage- license was granted
A
Tuesday afternoon by County Clerk
Pearce Paton to Miss Mattie Lee Jef-
ferson and Mr. Oscar Gibbins, both of
this city.
ROSS JOHNSON.
Miss Loucena Ross and Mr. Frank
Johnson, both of Cvnthiana. surnrised
"&& iuia uum aim iur. nu.
Johnson, both of Cynthiana, surprised
their friends Saturday by coming to
Paris and being united in marriage a',
uTie onn noinir iitiuom in morriorro or
" " uto .w. """lim .
the home of the officiating minister,
Rev. Dr. O. R. Mangum, on Sixth
street. After the ceremony they left
for a short bridal trip to Eastern
.points.
The
i ne onue is uie vivacious anu at-
wedding will occur in June. tion met with Colonel Winslow, at the
Miss McDaniel is the charming War Department, and worked out a
daughter of Mr. and Mrs. John Mc- plan by which the Association can
Daniel, of Millersburg, formerly of servo the War Department by furnish
Cynthiana, and has for several years ing engineers, making available road
been a teacher in the Millersburg
Graded School. She is a sister of Mr.
Tnlm 1? ATnTViniol lv m,rl TVT?o0 1To,
xiie need for additional officers
in
tne united States Navy is being more
keenly felt, with the commissioning of
every new dreadnaught. One of tho
lats acts 0f Congress which ceased to
exist 011 March 4, 1917, was to provide
that 100 midshipmen at the Naval
Aacademy, Annapolis, Maryland, were
to be (irawn from the enlisted per-
sonnel of the Navy. Every enliste.l
lt.an un(ier twenty years of ace. with
like the average young man in civilian
Hfef has not had a high school educa.
tion, and tliis fact is inducing high
school bays to enlist in the Navy, as
I it is practically certain that any young
j nan with a ground work of two years
1 01 more high school training, who re
la lly desires to enter Annapolis, can
do so.
j Naval authorities consider mid
shipmen with this preliminary training
afloat of particular value, as their
knowledge of naval affairs give such
oung men a much better grasp of the
possibilities of their future career,
than is held by the candidates appoint
'ed directly from civil life by Con
the enlisted personnel muat be recom-
gressmen. The men appointed from
'iltn-inir tVio?- Mivol AnnAdrmr norooi
each cruise held during the three
summer months. The itineiary of these
cruises is laid out Germany, Norway,
'England, Gibaltar, etc. In 1915 it
was considered inadvisable to send the
Itiainmg squad in European waters on
U,.t of t.h war.
and they were
I therefore sent to San Francisco,
w w v, u M . w-. w v .. F
. - - . . . -
through the Manama uanai, to view
the panama-Pacific Exposition.
The standard of living, of discip
line of manh0od and of scholastic
ability, are maintained at a high leve'.
rpne pressmg need of officers has not
! lowered these standards, as Was re-
centiy shown when the usual percent-
i'age or tne miusnipmen were "Diigeu
(forced to resign) for deficiency in
.studies.
The young man who has an apti
tude for the sea, who wishes to enter
the naval service under the best con-
I ; x ...T. Tn 4-1 a a -w. 1 1 4- . 4- wnnnll
miuons, wuu uus lug ammuuu tu tci.ii.
Li. j. -1 : ...;il ,1 l,;c lit-
NO bACE FOR RUBBISH.
j
There is iio-place in a ppetty littla
.village such aa ours for rubbish piles
or "dump" piles as they are sometimes
called. They mar the looks of a town
more than one" would imagine until one
visits a strange town and finds these
piles of rubbish. They are far more
noticeable to us in another town than
in our own here, knowing where they
are and accustomed to passing them
every day, we soon cease to notice
them. Strangers notice them, however,
and that it what we don't want. It is
mom. ouauSCiS uuue mem, uu
and that it what we don't want.
true we wish strangers to rem.
cur town, but on account of i
remember
rMir" Town nnr rr nennmr nr uo o-.
- m. w
treme neatness, not on account of its
filth and neglect. "Dump" piles not
only mar the looks of a town but they
render it unhealthy. If the national
government can be said to have a
iiuuuy us ureseut nuuuy is lu
machinery, and co-operating in- the
construction of roads that will be of
afttom'o vnlno ns miliKorv rnnrls
cdiiit ami- m rcro OAVpn
H. F. Hillenmeyer, nursery and crop
authority, states that neither fruit nor
clover had been damaged by the cold
of the last few weeks. Bad weather
that caused clover to be sown late and
has held back truit buds may be cred-
ited with having saved both. The
snow was also a factor in protecting
the clover. While not deep it provided
a covering that may have stood be -
en's
Spring
Boots, Oxfords and Pumps!
In white, grey, mahogany brown, black kid and other fashionable shades, as well as
the more conservative styles. Owing to our system of merchandising in advance and in big
quantities, we are now in position to offer to our customers the highest quality and the
most stvlish Spring Footwear AT PRICES LESC THAN THE PRESENT WHOLESALE
MARKET.
Just a Few of the Many Styles and Their Prices:
-Ladies' White Kid Most Fash- e
ionable Boots at q.3 Up
Ladies' White Cam. Sea Island co QQ
Polish Boots . qmyy
Ladies' Rich Brown or Russ. Tan a CktZ
English or French Heel Boots..". . SwO
Ladies' Kid Lace Boots and
Pumps which add grace to your A
foot , 0.49
Ladies' Pat. Dull Kid co QQ co AQ
Boots and Pumps at. . - p.-SJ""
Ladies' Pat. and Gun Metal Shoes qq
and Slippers at. 1-5J5J
Boys7, Misses' and Children's Shoes and Slippers At
ONE-HALF THE PRICE YOU PAY ELSEWHERE
Paris' Greatest Shoe
tween Kentucky and calamity, inai-
much, -'as the mercury dropped Yery
low at tiries.; 'kr. Hillenmeyer take
aB'optimistic-'yiew of wheat proipecta,
believing that the damage done by the
severe freeze of February 6 Is not as
disastrous as some have estimated
Let everyone hope that he is correct
in his prognostication
AETNA
Automobile Insurance
. Company
Fire, Theft, Collision,
Liability and Prop
erty Damage.
ETNA AUTO SERVICE
Presenting an Aetna Auto
Identification Card to any agent
of the Aetna in any part of the
country places the agent's ser
vices at your disposaj in the
event of your having an acci
dent. The largest company in the
United States writing auto in
surance. A. J. FEE, Agent,
Paris, Kj.
Conservation of
Eye Sight
is the Practice of
Optometry
By intelligent methods of eye
examination, for the purpose of
furnishing the right kind of
Glasses when needed.
We Practice
Optometry.
Call or Phone Us.
FRYE & FRANKLIN
Doctors of Optometry
Dow Bld., opp. Windsor Hotel
tpil
Largest Selection Of
Footwear !
All the New
Novelties,
The Latest
Creations of
Women's and
DAN COHEN
Store
Vti
s We Wiflh To Announce That
Our
l
Bakery
Department
Will Be Open
Saturday, April 21
We will be able to
furnish you with
the very best of
everything in our
BakeryD partment
We vvlli be pleased
to have you call and
see a sure-enough
sanitary bakery.
Every day is visit
ors' day.
WILMOTH
Grocery Go.
Phone 376
HflRGOLEN'S
SPEG1ALS THIS WEEK
Home-Killed
Meats
Beef, Pork, Veal, Lamb.
Fruits and Vegetables
Fish Dressed to Order
MflRGOLEN'S
Children's
Men's Russian Tan English -
Shoes and Oxfords, W.-O... 54.50 tip
Men's Plat. Calf English and Me- .
dium Toe Shoes and Oxfords. . . . $H-.UU
Men's Gun .Metal and Tan Shoes --.
and Oxfords, Walk-Over 3.50
Men.s Gun Metal, Button and 0 ttQ
and Lace, good quality 2.99
Men's Tan Lace Oxfords - -v
at 2.49
Men's Gun Metal High Shoes and -Oxfords
1.Q9
Where Beauty and Economy Reign
, . cans.
our national inspirations on .the seas
an 10 ir.e i5-- . .
';V
? - "-' - a; ' - x
.-l , i--
Kr
K'&
Xk.
-J -Wa j&As
-. .-v
V
Jfcf
"
!?
r
&
N V
"X",
W
t Vtvlnr. As Mr vrooman say a, 5 , -- - -- " - 7.