PAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
TUESDAY, MAY,22, 1017.
1
hi
i
t i
i
l
;:
,
ir t
H ,
UH
i
i.r
j
'., ?
nff
ri
.'I '
Hi
J A
i
YiU
t
I i
MILLERSBURG
;
"brfiv nresent had a most Dleasant af- Winchester, with Mrs. M. C. Grimes;
turnoon. Most of the cadets were ait. ana airs, iacy uiarK, or iexmg-
The alumnae banquet was given at
gi anted the privilege of escorting an ton, with Mr. and Mrs. W. G. Leer; i p. m. in the colloge dining room The
M. C. girl to the college. Sir. and Mrs. Lawrence Thorne, of ; menu was elaborate, after which a
The commencement exercises of ??ris' w u,Jr ?otV .Mrs- Sarah number ot appropriate toasts were re
.The M. M. I. will open Sundav, May Thome; Miss Maude Stokeley.otCyn-sponded to. The following is a .par
27, with baccaulaueate sermon at the ""ana. with hepaunt, Mrs. G. L Hill; tlal list of visitors: Mrs Eugene
Methodist church, by Elder E. L. Misses Lillian Wallmgford, of Mays-Heckney, of London, Miss Ruth Nor-
a.n no!ir f tv,n Gr-ct ni.T-Jcftnn vme. ivi Auaiusoii ami vuuhullo .s. iUlSS iriefen Asuury, iur. kj. jeu
okurch at Louis'. Hie; Monday. May 2S, ?,L' f5' o Mayslick; Mary Willis Mar
is a, m.. competi.ive drill on college fball. of Fletmingsburg, Miss Alice
campus, r a. m. Monday, Flag raising, foreman, of Washington, Mr. Harry
several nobble speakers will be pre- J-?e. o Eroojsvi He, with the Misses
7fc nfmnn- wlirmi will lip AttnrnPV. juu, .tuaii jwuk, auu..t, ui mu u
V.....W, ,.... ..Q ....V... ..... w - ...-..
General Tandy Ellis, of Frankfort, Ex-
vet, witli Miss Edna Rankin; Miss
Cadet Harry Miller." City Attorney of '"? Crates, of Carlisle with Mrs ; D.
iexlnston. and O. E. Hurst, of Millers- '' Jones; Mrs. HH. Phillips, otWra
burg. Monday 2:30 p. n. ball game on ?-, "" "l """
74. M. I. campus between M. M. I. and "Ston, with Mrs. A. S. Best, Mr. i.
Sastern Kentucky Normal, of Rich- v:etnnm. of Arkansas, and son, o,
T.rtn. Mnnrinv s-15 n. m. onerefta in Lexington, with Mr. and Mrs. Roy En-
JA. M. I. auditorium. jfTuesd
3D. commencent exercises.
.address by Prcf. Ganfioid. P
m uenter LOiiege. uaiivme. : ;; -.-.-.,--, ----- ....
nmgs, or Georgetown, miss iuva wen
derson, of Harrodsburg, Mr. and Mrs
ttagdy, Mr. Plays and sister, Mis3
Susanna and Julia, of Bloomfield, Mr.
Mitchell and sister, Miss Sue, of Har
rodsburg, and Mr. and Mrs. Saunders,
at the Taylor House: Mrs. W. V.
Shaw, Mr. F. M. Collier and family,
with Mrs. Mattie Purnell and daugh
ters; Mrs. M. R. Collier, with Mrs. C.
R Smith; Misses Louise Monroe and
Queen Robertson, of Cynthiana, and
av 10 a (Hicou; -iss ucume oucei, ih i-scihum, jr. moiirue juver. ui emui viiiu, wilh
" Literary ; xv itli Mrs. J. D. Redd; Mr. and Mrs. (the Misses McDaniell.
resident i owaru, oi i-.e..iiistuii. i i lie lonowing ii a paium ubi il uiu
JAfiQQPc ATp.Tntvrpr Air. William and at p nnrl :i list of the out-of-town
' " . ,'yiss Bessie Payne, of Cynthiana, with, n
The commencement fercC1feS,0liMr. and Mrs. J. T. Judy. H
the M. C. was continued Saturday !..
eninsr. when the young ladies of
trt 1 : .....r.:n r,. ("T f1 rxnnnnA TVwlof o t Q T
.muss imiib uiubs in i-ajjicssiuu. - ... v.. ujiciicu : i" " ' ( i ..,.,- rif viliisvillp- Miss FMintt nl
e.t i,r tiKi vhiVb fionnrtmont. nut nn ' rnnrert in strineed instruments at Jlays' ()t svme, J11SS 1.11011, 01
W. beautiful oP5atU.eUoa -The, ,,,eM.C
1WKL Olip.Jcr ill 1UU1 jiai LJ. Jis.i- jiiv.o jiiui i- in uuimu. iiv i.v . v.. ,
young ladies were well drilled.' 'ine body is ready for commencement
embers of the Alumnae: Mrs. John
llhorne and Mrs. C. F Onev. of Le-
' ;..i-A ATJr.n f m n tto lJfrr ri li'lnniiiKVff.
The annual commencement of the j1i,,t"LJ"ri:1,aa :ttI". A " , "".
Ul With "Ulg; iVllsi'S iduliiu, ousaii iiuj. .juiia
Ol
See
Consuin
Notice !
ttli 'IIIIIII'I"I''I'2'''I,,4,'S4M,!
t
4-4
I":
?
It is with reluctance that we are compelled to
notify consumers of ice that the following prices
will prevail from this date until further notice.
This advance has fceccme necessarv on ac-
count of the greatly increased prices in labor and
i everything that is rtsed in the manufacture of ice
$ especially coal.
X The prices will be as follows:
J 50 pounds 25 cents
j 25 pounds 15 cents
J 18 pounds 10 cents
j 6 pounds t 5 cents
I Paris Ice Manufacturing C.
i. (Incorporatod.)
. harrodsburg; Misses Louise Best,
J Miss Elizabeth Gauit, Misses Ruth
Norris. Mubel Asbury, Lillian Walling-
tfor, of Maysville; Mrs. Anna George
2'I"s4"s"4'I"J',rlinton, Mrs. Aylette Buckner, Mrs.
1 jSopcr. Mrs. I. C. Haley, of Paris:
i Mrs. Bessie James KwiiDrougn, iiai
tie Vanderen. Mrs. A. Van Wait, Mrs
Arthur Harney, Miss McClure, of
Cynthiana; Mrs. C. B. Hainlaine, Miss
I Mary Dee Mason, of Mt. Sterling; Mrs.
Jno.G. Shearer, of Covington; Misses
I Helen Asbury, of Mt. Olivet; Mrs. J.
!l. Dreskell, of Worthville; Misses
Mary Crates, Eilzabeth Coles, Mrs. C.
C. Coles. Miss Enda Rankin, of Car
lisle; Mrs. H. H. Phillips, of Winches
ter; Mrs. Clara Rhodes Earley. of
Kwing; Misses Emma Jacoby, Mrs. M.
R. Jacoby, and Mrs. Rice, of Hutchi ,
son. The banquet was served by Mrs. J
J H. Grimes, and was indeed elabor
ate. The musicians at the banquet
were A. M. Siebracht and Leroy
Simth, of Lexington.
parts well taken and the scenic ef- There are quite a number of guests im
tGctfl were Deautiiui. Manv or tne town and otners vet to coma hp.fnrA
young ladies represented flowers, the exercises close. The bad feature ! J
Ihey were arranged by Miss Corinne of the situation this year is that the I
"Wilson, and the stage was never dress- commencements of the M. C. and M. T
ed more beautifully. The house was M. I., are not pulled off at the same
The student body of the Graded fiiled to its utmost capacity and all time,
ftdiooi will put on an operetta at the oi the extra space was filled with The auditorium Friday evening was
Opera House, Wednesday, at 8 p. m. chairs. filled to its utmost capacity, the pec-
Wckets on sale at Wadell's Drug Sunday at 10:45 a. m. a large and pie showing their appreciation of the
Store. The purpose is to defray the ex- cultured audience gathered at the school by turning out in large num
penses of the school. The cause is a Methodist Church to be present at the bers. The program was long, but good.
5od one. Let everybody respond. Baccaulaureate exercises. Long be- Saturday was the biennial alumnea
At the recital to be given in the fore the time for the exercises to be- day of the college. Past graduates of
fcall room of the Phoenix Hotel, in gin all of the available space was the institution were here from many
3Uexington, this evening, at 8:13 filled, and many were turned away. At, places, and the town was full of la
o'clock by the piano pupils of Miss the appointed- time the eleven young dies for the day. The literary address
JUizabeth T. Smith, Miss Carolyn Mc- ladies of the class of 1917 filed in and was delivered in the college audito
fctyre, of Millersburg, will play the took their places. The musical pro- rium Saturday at 10:30 a. m., by Mrs.
"Hungarian Fantasie" by Liszt, accom- gram was good, and was followed by Sherard, of Covington, her subject,
yani" bv the full orchestra. an able address by by Dr. Banks, pas- "Some Notable Kentucky Wqmen."
The Senior Class of M. M. I. gave tor of the Methodist Church, at Win- ji Was well handled and she prefaced
tkeir annual lawn fete of M. M. I. Fri- Chester. Mr. Banks is indeed a scholar her remarks by saying that she could
by from 4 to 7 p. m. The weather and delivered a scholarly address. At go back to our early ancestors and
Ttas ideal, the grounds beautifully dec- 7:30 p. m. Sunday, Dr. Banks was bring down an unbroken progressive
rated in patriotic colors with flags greeted by another large audience, at change from the time that Kentucky
$1(1 bunting everywhere. A number which time he delivered another fore- was settled to tie present hour. At
ol invited guests at large was present ible address to the Y. W. C. A. at the the close of the exercises the various
road the time was pleasantly spent, college. His subject was equally c'ass rolls were called by years. Mrs.
Coffee and sandwiches were served on good and his taly equally logical. The America Butler being the only mem
the grounds, ice creaan and cake in musical program was equally good, her responding to the class roll of
the drill hall. Victrolas dispensed The following is a continued list of 1S57, this being Mrs. Butler's sixtieth
good music in the drill hall and front commencement guests: Mr. and Mrs. anniversary as an alumnae. She was
"veranda. The reception was fully up Hilary, of Lexington, with Mr. and tendered' quite an ovation and was the
t anv of its predecessors. Every- J. II. Thompson; Miss Nora BrooKs, ; recipient of many presents by her sis
ter alumnaes.
if! 1 1 1 lfrM"M"I"M'''l"I''I "1 1 "I' '!"I"M'i"l 1 1 1 1 1 1 1 1 1 1 1 11 i-M it4l 1 1 III II I II H
" ft
i AT
School Bond Issue
j
While the Teachers' and Janitor's salaries have
nothing whatever to do with the question to be sub3
mitted June 2nd, yet the School Board welcomes such
I criticism. We want the people back of us in our fight
for better schools, and are confident of their support
when they are correctly informed.
V
J"
!
AM..Jk.A..ktiK-fi&
BIRTHS.
V V V V V
The statement with reference to
Janitor's Salary is misleading in
that it does not state that he
pays for aii extra heap out of the
$1,500 and nets just about
$750 per year.
V
In the winter his hours are from 2 o'clock a. m. to 6 o'clock p. m. in mod
erately cold weather, and he must attend to the furnace all night in extremely
cold weather.
The present Janitors contract expires scon, and applicants from compe
tent persons will be gladly received. The Board wants to give the patrons the
best possible service for the least money consistent with such service.
Is there any other expense which seems unnecessary? If so, let us have it,
give us a chance to explain, and if we cannot explain perhaps we can be bene
fitted by jrour suggestion.
We want S4 to fee said of Paris tha'i
best public school m the
j
she Sias the
State- Heio us to do
OAUD
W wj
GIT"
UCAT
ION
rt4frcMt44,,SMKty4fr,Sfr3,I"5
833&08qgSgCfr3a;gP
&
m
&4&?
t1 'I1 1' iM,3ifr'M''I''I''I'$''i"IMI'I,''I'fr,I''I
Others Like It
You Will
Let the big paint
buyers help you de
cide. Hundreds of
big manufacturers
use
Sherwin-Williams
PAINTS & VARNISHES
because they know the
quality has been proved
that these products
meet every condition.
The "Cover the Earth1'
label stands for quality,
durability and covering
power. It is your pro
tection, in buying paint.
A handsome son was horn in
Georgetown last week to Mr. and Mrs.
Henrv C. Herndon. The mother
formerly Miss Hannah
daughter of Mr. and Mrs. A
i o
a
o
19
t- p- . -r&
rxl 5-fl3tft .LL ,rJI. ' Alt.
-
Get Your Sam-
ifl?
-lrJl
5oes
Q
was t 9
Ferguson, J
L. Fergu- O
son, the
Paris.
latter a former resident of
ACUTE INDIGESTION
CAUSES CHILDS' DEATH.
Oi.ir enormous stocks-our clowe
contact witri tlie vvrorlc.r greatest
fa.stiion shoe centers our wonderful Sj,
system of mercliaiiclising must
assure you ol tlie jvy latest
in
f ,&' -Ml
jv. .v.: My- 9 1 fewRT
't " y. f its sUJ
4 - '-fXa
4' :z
W
C, A. DAUGHERTY
Ben Turner, colored, aged three
years, was found dead in bed early
Sunday morning by his parents. James
Turner and wife, at Shippsville, near
Millersburg.
Coroner Rudolph Davis was summon
ed to Millersburg at seven o'clock
Sunday morning to investigate the cir
cumstances surrounding the child's
death. Coroner Davis and Dr. J. D.
Calhoun, of Millersburg, conducted a
rigid investigation, finding the child's
death had been caused by a sudden
attack of acute indigestion. The child
had been in apparently good health
Saturday night.
NEW EDITOR AND STAFF
TAKE OVER COLLEGE PAPER
High Grade Men's, Women's and Children's
FOOTWEAR!
We are very proud of the fact that now, when one should
make &v&ry dollar go the furthest, the people appreciate
more than ever the money-saving possibilities offered here.
JOIN THE CROWDS
To the Big Bargain Shoe Store this week compare quality
srsdl orSces-and you wi3S ibe surprised at the bigsavsrags here-
The Kentucky Kernel, the official or-
gan of the University of Kentucky,
published at the University by the stu- $
dents, put its last edition of the year g
to press Friday with the 1917-'1S staff $
in charge. The staff which will
handle the publication for the ensuing
school year will be headed by Mr.
Wayne Cottingham, of Paris, as Editor ' &
in-Chief. Mr. Thornton Connell, of g
Paris, will be assistant editor. Miss ' ti
entire ti;me to his agricultural inter-. J
itor this year, wil be managing ed- j 9
itor. Mr. Charles Planck, who was a 9
resident of Paris for quite a while, will a
be the sporting editor, while Miss Mar-; g
garet Lair, whose name is a familiar ; 9
one in Paris and Bourbon county, will j j
have charge of the society department, m
.
Ladies' Gray and White Kid Ka
tinka Pumps
Ladies' White Kid or Rich Brown
Russ. Tan Boots
Ladies' White Canv. Sea Island
Boots and Pumps
Ladies' Canvas Strap Pumps
Ladies' Kid Lace Boots and Pumps
which add grace to your foot. . .
Ladies' Pat. Dull Kid
Boots and Pumps at. ..i?""
Ladies' fat. and Gun Metal Shoes
and Slippers at.
$3,49
4.9S
9
,49
1.49
3.
1 2 a 4 3
Men's Russian Tan English ,
Shoes and Oxfords, W.-0...$4.bQ &P
Men's Plat. Calf Eng. and Medium
Toe Shoes and Oxfords, W.-O
Men's Gun Metal and Tan Shoes
and Oxfords, Walk-Over
Men.s Gun Metal, Button and
and Lace, good quality
Men's Tan Lace Oxfords
at. .. .. .....k..........
Men's Gun Metal High Shoes and'
Oxfords
$4.eo
3.50
2.99
2.49
1.99
Boys', IVlisses' as?d Children's Shoes and Slippers At
ONE-HALF THE PRICE YOU PAY ELSEWHERE
,
MATRIMONIAL.
CHENEY WELBERG.
(9
e
m
Mr. and Mrs. E. S. Cheney, of-
announcing the marriage of their
daughter, Miss Elizabeth Cheney, of
Paris, to Mr. Helmer Welberg, at De-!
troit, Mich., where Miss Cheney has
been visiting for several months.
H in fty
mm m III
Paris' Greatest Shoe Store
Where Beauty and Economy Reign
t
t
X
:
1?
m
0
9
O
m
m
m
s
2
m
m
m
m
m
tt
9
O
5
s
Vv. .- ' -