"INMirK ttramr
-MTMjau-MrjwL0 rx. X jut? r kj9 rxuuUt'
I
,ii
rM
)
ill
at
41
to
!
i
m
r
I
'.' I
fefil
Ml
MILLEKSBUKG
Mrs. Clara Shanks left Monday for
Garlsbad Springs.
DEATHS.
MATRIMONIAL.
MYERS.
The funeral of Silas Wall Myers,
-Muss Pearle Stokeley, of Cynthl-1 aged fifty-five, who died or Heart ais-
tt is the guest of her aunt, Mrs. G. ease at three o clock Wednesday
-Tu Hill. I morning, at his home on the Clinton-
Tlio ladies of the Baptist church ville pike. :.oar Paris, was held at two
-Rill have a sale of eatable's at thr ' o'clock yesterday afternoon, with ser
Exchange Bank, Saturdav. .vices at the grave, conducted by Rev.
' Miss Elizabeth Miller was at home W. E. Ellis, of the Christian church.
Saturday and Sunday from Transylva- Mr. Myers was a former resident of
Eia University, at Lexington. Nicholas county, but moved to Bour-
y and Mrs. J. H. Collier and Mrs. ton some years ago. He is survived
IranWe Ool1 ins were guests Tuesday by his widow; two sisters, Mrs. A. D.
of Mr and Mrs. F. M. Collier, at Paris Ginn, of Carlisle, Mrs. Wm. C. Mc-
Mrs J M. Alverson, of George- Cracken, of Paris, and one brother.
Ioavd arrived Wednesday at the bed- Mr. Wm. Myers, of Paris.
side'of her father. Mr. J. G. Allen, The pall-bearers were: Avery
xt-'e condition is no better. Smart, Wm. Smart, Jesse Bannister,
-Quite a number of the membeis Ora Bannister, Albert McDuffey and
vf Amity Lodge will attend the dedica- John Smith.
iory exercises of the new ivia&ouii;j
Temple of Daugherty Lodge of Car-,
lisle. '
,
PROGRAM OF NORTH
MIDDLETOWN CHAUTAUQUA
The following is the program of the
Chautaqua which will be held at North
Middletown this summer, under tho
license was issued ,ausmces . or tne North Middletown
commercial uiuo, ana conducted by
A marriage
Tuesday morning from the office of
Pnnntv nirrlr Ppnrre Pntnn in TVTo !
Pessie Smith, and Mr. Reese Stith,
both of this county. Miss Smith is u
daughter of Mr. Nathan Smith, of thp
county.
Coming
Attractions
PARIS GRAND AND ALAMO
FUNERAL DESIGNS.
Let me have your order for funeral
Tue Eastern Kentucky Normal and designs if you want something fresh
V M I ball teams crossea oats iuun- ana nice, -an siouk sincuy u-su uuu
.Vm the grounds of the former, the Frst-class. Phone in you order.
Sre being 15 to 6 in favor of Eastern (4-2t) JO. S. VARDEN.
Kentucky Normal. M. M. I. will play
i.t m cinrihifr Hsrh School next GOOD SALE OF BOURBON
y.onday at Mt Sterling; Cynthiana
Figh School, Monday, 14th, at Cyntni-ana.
ANNOUNCEMENT.
THE NEWS is pleased to make the
happy announcement this morning of
the engagement of two of the mobt
popular young people in Paris, Dr.
Charles Garrard Daugherty and Miss
Besse Buckner Holladay, whose marrl
age will take place early in June.
The prospective bride and bride
groom do not admit that their en
gagement is "the culmination of a ro
mance which began, so-and-so," but its
just a plain case of love from the be
ginning, which was some time ago.
Dr. iDaugherty is -one of the best
known and most popular physicians in
Central Kentucky, having been for
many years associated with the late
rr. Frank Fithian. He is a son of Mrs.
C. A. Daugherty, and a brother of
James and Garrard Daugherty, and
Miss Anna Daugherty, of Paris, and
Mrs. Jesse Hazelrigg, of Winchester.
The bride-elect is a daughter of the
late Mr. and Mrs. John B. Holladay,
ior many years highly-esteemed resi
dents of Paris. She is a sister of Mr.
Bruce Holladay and Miss Mayme Hol
laday. of Paris, with whom slip lm
for Mrs. Ruby been associated in business since the
founding of their grocery and now
famous candy making establishment in
Paris. She is a young woman of most
chanming personality, one whose
friends are numbered by the score.
THE NEWS extends congratulations
in advance of the event which will
unite these two popular Paris people.
COLLEGE PROPERTY
representatives of the Community
Welfare League, of Indianapolis, Ind.:
Dr. Edward EccJeston, representing
Luther Burbank, will tell in a graphic
way of the wonderful achievements of'
the plant wizard. Dr. Eccieston's,
lectures are illustrated with morel
tnan one hundred beautifully colored l
lantern slides. ,
Lenzo's Royal Italian Band, direct
frcm ew York. One of the really
big attractions on the program.
Nanah Rense, reader and imperson
ator, a fine Kentucky girl, who accoin
panys the Lenzo Band. She has
achieved fame on the Chautauqua
platform.
John Kilham, "Good Friend of the
Indians," who will lecture on unfa
miliar phases of Indian life with imper
sonations of famous Indian chieftains
Charles Daugherty and Company, in
musical program, including his famous
whistling solos, and instrumental selections.
The Hazel Kraft Company, in vocal
solos and duets; costume songs; dra-
n.atic readings; impersonations; piano
monologues, etc.
There was a good attendance at the
sale of the old Bourbon College prop-
Tlie students of the Grariel School erty, in the College Hill Addition to
vill have a flag raising this afternoon Paris, held Tuesday afternoon on the
,n the school grounds. A neat flag premises, by Mr. C. E. Norman, of
his been purchased, with an a,ppropn- Lexington, as agent tor Airs, mioy
.. .,i i. n:r.-irl with pprf- imcmrirpr nlmiiiistrntriv nf t.hfi 1nl.fi
ftte Stall. lb Will U laiocu . .vw. .....,,... 0w.,
7mu Every natriotic citizen and Mr. Clifton Arnsparger.
Tnverof liberty should be present, and While the bidding was not spirited,
nnrvwrace Uiese young people in their real estate men prononunced the sale
TnvStv ind patriotism. Let every- a very good one, with satisfactory re-
Sodv eo and fill both yard and building, suits. The property was subdivided
ni 5 m . about three years ago by Mr. Arnspar-
Don't forget Sunday morning is ger an(1 some f the j0ts sold, and
-Go-to Sunday School Day." Let every- tne sale held Tuesday was for the
tody strain a point to be present at purpose 0f settling his estate,
some one of the Sunday schools. The Tne eighteen lots brought a total of
churches are all working in harmony $000, including the college building,
and an effort will be made to bring hi was purchased by Prof. J. M.
out the largest number ever present Scott, for $3,000. The sale was cried
at Sunday school at any one time m y Auctioneer George D. Speakes, of
yiilerslmrg Transportation will be lhe real estate firm of Harris .Sr
riven those who have no way to get speakes, of Paris,
fhprp also the "shut-ins" in town. Several prizes were given away, the
"- - , ninmhar .-t I IP t.; rn . . T.. 4-Un'. - -- ' - -ww.. Vi.
Give your name io a '"Cl" "" "1Iiers ueiB Ub louowa. rui -.yie immediate members of the familv
committees, or the pastor ot jour c.iosest guCSS as to the amount the Col- witnessed the cerepnonv.
church. The goal is 1.200 let s reacn (Q building would bring, Mrs. F. E. After the cerem0nv 'Mr. and Mrs
it or excel it if possible. (Faulconer, of Paris, $10 m gold; for j -wood left for Birmingham, Ala., whero
,, , a ol-c guessinS nearest to what the cheapest j they will visit for a time, going from
Another one of the old landmarh.. ,ot woul(1 bringf Mrs Bishop Hibler, I theve to Orville. Ala., where Mr Wood
..r uriiifcUiirrr is to be taken aowi ot par?s. S5 in cold: for cuessinc near- t. mnnoo-o f !, TTrn tjh " o..-,.
Vl ll...v..o-.o -- ATidcpv; " . .,',...,... ',..,",. r" T-, t "f """b -"c l iltUiab OfOC.i
""he hi)me occupieu -"- est to cue niguusi. pnuuu iui, .ur. tr. j.
Mclntyro. which was recently sold to Accord, of Paris, $5 in gold. In the
Jier brother, Mr. W. D. Mclntyre, aivl drawing for .prizes, the awards were
the building on the lot, to Mr. W. E. u,a(ie as follows: One hundred pounds
Collier, is now being moved to a lot of 0r flour to Mr. R. P. Dow, of Paris;
Mr Col'ier in .Tudyville. This is one twenty-five pounds of sugar each to
of "tne old landmarks of Millersburg. -iss Carrie Rose and Mrs. Culbertson,
which was for many long years occu- both of Paris
nied by Mr and Mrs. John Patton.
Sr Patton died in 1874. This land- CHRISTIAN TRAINING
mark is to be replaced by a handsome F0R MILITARY CAMPS
, " ..n. rpcidence. with thei
moaern uii-w-uu .- -
BUCHANAN WOOD.
Rev. J. Taylor Sharrard, of Paris,
officiated Monday evening at the wed
ding of Miss Ella Haley Buchanan,
daughter of Mr. and Mrs. Frank Buch
anan, to Mr. Robert Nutter Wood, or
Alabama. The happy event took plac
at the home of the bride's parents
;near Hutchison, at eight o'clock. Only
NORRIS TOOIIEY.
The marriage of Miss Nora Nor-
ris, of Chicago, to Mr. James Toohey,
of near PAris, was solemnized in Chi
cago, Wednesday. Mr. and Mrs.
Toohey will return to Paris to-morrow
to make their future abiding place at
the home of the groom, -on the Humo
pnd Bedford pike, near this city.
Bible Institute of Chi- Prnnll 1, . ft,-J ' 7T . ,1 ,
... rropil. Ol near tills Cltv. nnrl hna lionn
one ol its protessors, in. u .rQnnnf ;c,;, . ,: ; zr"
. ; . i.i uuiiL.HL inn in ii ins iiiiiiiij ". ri n
construction will oegiu m 0. Sellers, to the International Y. M.ihaa a lar lpftlft ftf fHfi ; "i
fin cfirnnn in thn - v-.j U,1U ta
mirers here, and is a young woman of
many accomplishments.
Mr. Toohey is one of the younger
generation of Bourbon county farmers,
a son of Mr. and Mrs. John Toohev.
and has made his home at the old
frlest improvements, to be -occupied L by The Moody
Ifr W. D. Mclntyre and famii. Ae cag0f has ient
T-flr rtf
., AVf raw wneks. 'C. A. for evangelistic service in the
English Camps. He ave some time
The following is the program of jast year the Canadian Camps.
tife Commencement exercises of the t Tjie institute is desirous of living
liUerslmrg College: up to its pseudonym of "The West
tviv Mav 18. 8 p. m., Concert by point of christian Service," by being
cry,ra.A instrument Class.
su.iiL,T-" - in-on
Mav y. j.v."
Farm.
PROF. GRAHAM EDGAR LEAVES
VIRGINIA FOR CALIFORNIA
News was received in Paris, Wed
nesday that Prof. Graham Edgar, for
merly of Paris, associate professor of
the University of Virginia, has resign
ed his iposition, to accept a position
of professor of analytical chemistry
at the Throcip Institute of Technology,
at Pasadena, California.
Prof. Edgar is a graduate of tho
Lniversity of Virginia, and is said to
bo one of the most learned of the
younger faculty members of the Vir
ginia College. He is a brother of
Mrs. J. T. Vansant, of Paris, and a son
of the late Col. Edgar, formerly of
Fans. He married Miss Isabella Mar
shall, of Lexington, some time ago.
FRIDAY
Bluebird Photo Plays pre
sent the sensational photo
drama, "THE EVIL
WOIV2E& BO"
Featuring Rupert Julian,
Hobart Henley and Elsie
Jane Wilson.
MRS. VERNON CASTLE
in
"THE RED DAWN"
7th episode of "PATPJA."
SATURDAY
Clara Kimball Young
in a special release
"ftlARRIAGE
A LA CARTE"
From the play, "Marrying
Money." Alamo afternoon,
Opera House at night.
Anita Stewart and Chas.
Richman in
"THE MORE kX
CELLEN'i WAY"
Blue Ribbon Feature. Also
a Big V. Comedy. "Pests
Promise' Alamo at night.
Mours-Alamo, 2 to 5:30; Paris Grand,
7 to 1 0:30, Admission 5 and 1 Oc.
HIGH GRADE HOUSE & SIGN PAINTING
Interior Decorating
Hard Wood Finishing
WALL
AUTO BURNS.
While making a professional call
near Bedford, on the L .& N. in this
county, Dr. Bruce Anderson's machine
caught fire in a shed in some unac
countable manner and was ruined by
the flames. The fire damaged the
shed. The machine was insured in the
Thomas, Woodford & Bryan agency for
$400.
PER
a. m.
prepared ior any uemaiiu un ,i .tu-iplace on the Hume an( Be(lford jk
aeni uouy 101 wumuia m uiu umieu rnnr Pnrfs TT fnn line nn x - , '
- ........ .., tww, mho mi t If V IIOI L
r... ,lor
" A 4,MrncC hi' ATrS. C-r,nc nn-mna 5r t li n nvninrnlioHo flolrl i
Alumnae Reunion auunm,. , -- M.a wu.,,a . --h-. .. ""lacquaintance among the voung people
John Shearer, of Covington, Ky.. Sub- or through tlie channel of the Redjol the count d ) welf.1Ikeg f
get "Some Notable Women of Ken c u V
!"Cinl.y. May 19, 1 p. m.. Alumnae f th last t. were called Into l?d Vm l, of p abygo
iuncheon. . - Christian jyork in the army and others to housekeeping in Paris y G
1 Saturday. May 19. 9 a. m. to o p. are expecting service as chaplains in The followi announcement card,
in Art Bvhibit the navy. The training is entnely rree have been , d ru-
Saturday. May iv. i- l""4l'-:; jui mLiau .nu. aim vci - - Mrs Elizabeth Norris
Tha Lost "Lsdv's Slipper, .iuui.so. fcLaie, iiauoa or utinuiumuuuu wnuu
', nretta 95c references are satisfactory. Cata-
'er,inv viv 0 10:45 a. m.. Bacca logues are sent free on application.
Sunda Aia - . Bankg
SUDpa1tor First Methodist Church,;
WLnCeMnvy'on 7-30 n m.. Mission-' Camp Daniel
i. r- TlnnlvS.
ry oQrmuu u -
Monday. M?v 21,
Concert
announces
the marriage of her daughter, Nora,
to Mr. James Toohey, on Wednesday.
May 2, 1917, Chicago, 111. At home af
ter June 2, Paris, Ky."
CAMP DANIEL BOONE.
Boone, at Marble
Creek, on the Kentucky River, conduct- j
APPOINTED GENERAL AGENT
Mr. Frank Cox, of Elizabeth, this
SEVENTH DISTRICT
PROHIBITION CONVENTION
The Seventh District W. C. T. U.
Convention will be held at Little Rock,
n tli is county, on May 10 and 11. An
interesting program has been prepared
and a large representation of dele
gates is expected to attend. The meet
ings will be held in the Little Rock
Christian church.
PAINTS WINDOW GLASS
EAGLE and DUTCH BOY WHITE LEAD
SHERWIN-WILLIAMS MIXED PAINTS
BERRY BROTHERS and PRATT & LAMBERT
CELEBRATED VARNISHES
"The Best," Our Motto
C. A. Daugherty
Fifth and Main Streets Paris, Kentucky
mmtmtMfffittfffttMtttttttttMtttMM)
iaiaiaaaaaiiaiaafitiii
I fe y 0 W if il i j&&W'j&V I
I GOES THE mGHgCpM
ICOST OF LMNG'p I
-- .- . , , t . i iuiin v w.-w..
- a firing -.-i i- 4-iisi Ui-kr' irTLr i 'nmm iron nr :
b p m., - u u in, .;j,77"7r;'coiinty, who has been in the employ of
the Managing Board ot the State the Frankfort & Cincinnati railroad as
Tuesday. May 22. 10:00 a. m.. w- ouas Men's Uiiristian Associauon, a,sistant agent at B1Izabetht for some
nation Exercises and A'Wress . . wiu ue opeueu uu. eai ou uunu xo. time, ha's been appointed general agent
cJws of 1A17 bv Rev. W. B. Wis. The camp wiU remain in operation of the R & c Georgetown to -8UC
SStor First Christian Church, Pan,, until August lo ceed Mr Alfred Underwood
rT n .' Only a limited number dan be ac- Mr. Underwood died verv suddenlv
Ml the orrisps exceot those o. commodated at one time, and appli- sevcral da a j Georgetown. Mn
cur"oy will be at th- College. The rants for admission are requested to Wade Lovelace will continue as assist
Wlr is cnrdiillv invited to attend all send in their names as early as .po,- t t and M Bfn
the roiiinenr-ment exercises. si We. The expenses for a week s stay denVood. widow of the former agent.
Tho following vonne women com- have been fixed at $6 for eacli a.tend- wu be clerk
roTe tl e C'ss of 1917: out. Those desiring to attend the camp Tfl appointee is a son of Mr.
rATiUllianBagby. Gladys Bowen. houid notify the Secretary of the local and ' Elizabeth.
. ai on :rimes. .icunc - ---
CINCINNATI PAPERS
TO RAISE PRICES.
In view of the fact that material
Miller and Virginia SUrnUin. owe, Mr Henry S. Cay wood, of North used in producing a newspaper ha
Jrd Miss Aleta Vion, Expression. .Middletown, buyer for Swift & Co increased from one to 500 per cenl
fOthcr Millersburg on Page 3.) (has purchased 12 head of silo fel v ithin the past several months, tlr
cattle from Mr. English Anderson, of Cincinnati Post and the
cent.
the
Cincinnati
Cuts the
vOSf
An immense outlet, giving us a purchasing power un
equaled by any other organization, makes this store the
BSGGEST BARGAIN SHOE HOUSE. New bargains daily
received, Sf you want the iatest novelties and exclusive
High Grade Men's, Women's and Children's
Spring Footwear!
Visit our store, compare Quality, styles and prices, and
you will take advantage of the WONDERFUL SHOE VALUE
at Bess than they can be bought wholesale.
s
i
i
i
CRFSCRIPTIONS OUR SPECIALTY. Sideview, Montgomery county, at Times-Star, which have for manv years
FRtb . U.50 per hundred The cattle aver- been Cincinnatrs leading daily one -
roods delivered free to all parts of cged 1300 pounds to the head. They cent nGWSpaperSi have announced to
, Siimtv Prescriptions filled vere shaped from Mt. Sterling, Wed- tleIr subscribers that the price wiU be
SW-JS.SS.'-''
Don't forget deliverea
of the county.
4-2t)
VARBN & SON.
increased to two cents per single conv
'and ten cents a week, instead of six
cents as heretofore.
'
RELIGIOUS. , "GO-TO-SUNDAY-SCHOOL"
NEXT SUNDAY, MAY 6.
Next Sunday, May 6. has been des-
Preaching at the Christian Church inated as "Go-To-Sunday-School Day,"
Sunday morning by the pastor, Rev all over Kentucky, when it is hoped
..,. Mcfton STRUCK
UNMU" BY PASSING TRAIN.
. N?rtuJ?a,ra-ssf r$uM?
leaving i wb0 hai apoarentlyw. r Ellis, subject, "The Joys of the that the attendance at all the Sunday
struct b drijpk unrter the over- Christian Ministry." At the evening Schools will be larger than ever be-?-e8rJ
bridge at the Peacock pike cross- service the choir will give a sacred fere. It doesn't make a particle of dif
lieaa nn - ' concert under direction of Mr. A. Lr. ference what Sunday school you at-
wk near i killed outright, Boatright This will be the fifth an- tend, just so you go. You will b2
T.ne neh , ious mjuries about niverasary of Rev. Ellis' pastorate, given a warm welcome at any one of
i h d and body He was picked up beginning his sixth year Sunday. All them. So get on your Sunday school
mid snt to tne oi- mem oers are urgeu to ue present. crouies auiiuay murmiig, anu go to
the head an
bv the trainmen
where
His
Zl.r'Z icnitnl. in Lexineton
& H oSS. l
ilame'is aUachcd U th, train crew.
TO BUILD CHURCH.
. -.!. or snlicting funds
.Zcu'ioTnird a in a
r.:n 4hA colored suburb of Wis, io
Kl I uni vw
Sunday school.
s- .
! T MORE OFFICERS.
STOCK, CROP, ETC. Mr. Owen Gibson, of the Paris post-1
office force, and Hon. Reuben R.
Hutchcraft, Jr., Representative from
i Bourbon county, passed a successful,
Air. j. Jtiiimer .tjoaruman ot tne ijir-1 examination at l-iexington. Wednesday
9
9
9
Ladies' White Kid or Rich Brown A
Russ. Tan Boots H-.tPO
Ladies' Gray and White Kid Ka- - Q
tinka Pumps Sry
Ladies' White Canv. Sea Island Q
Boots and Pumps Z.H-il
Ladies' Kid Lace Boots and
Pumps which add grace to your -
foot 3.49
Ladies' Pat. Dull Kid co ao co AO
Boots and Pumps at. . - p4m&3 p JLuHrJ
Ladies' Pat. and Gun Metal Shoes ,- QC.
and Slippers at. 1 ""
Men's Plat. Calf Eng. and Medium m
Toe Shoes and Oxfords, W.-0....$4.00
Men's Russian Tan English -
Shoes and Oxfords, W.-O. ..$4.50 lip
Men's Gun Metal and Tan Shoes
and Oxfords, Walk-Over 3.50
Men.s Gun Metal, Button and
and Lace, good quality 2.99
Men's Tan Lace Oxfords
2.49
Men's Gun Metal High Shoes and
Oxfords 1.99
oys Swisses" and Children's Shoes and Slippers At
THE PRICE Yy PAY ELSEWHERE
tie Rock vicinity, sold to Mr. Ray Bur
ns, of Little Rock, a bunch of 100-lb,
alle, tne pastor, Rev. Harry ' shoats at fourteen cenls per pound.
". , , " viwiir the assistance ol tne Mr. James Li. Robbms purchasi
lanflarb and hopes they will
L'od canse. The churcli
aK
be tne home ot the
Baptist faith.
Colored Free
of Mr. B. F. Hopkins, of Little Rock,
a 900-pound bull at a fancy price.
night, for admission to the Officers Re
serve Corps.
H. C. Johnson, of Paris, enlisted in
purchased . the army service, and was assigned to
the field artillery .branch of the ser
vice. Others from tne county who
DAN COHEN
Mr. Lindsay Stewart, of Cane have enlisted in the Officers' Reserve
Ridge, sold to Mr. Catesby Woodford, Corps are Mr. William Collins and Mr.
Jr., seventy-five barrels of corn at ?7 Robert Jones, of North Middletown,
per barrel. land Mr. Jas. W. McClure, of Paris.
Paris' Greatest Shoe Store
Where-Beauty and Economy Reign