TUESDAY, JANURAY 30, 1917-
Coming
Attractions
PARIS 6MND AND ALW
MATRIMONIAL.
II
f
A.
I
I
I
Tuesdau
Sir Herbert Tree
IN
"Old Folks
At Home"
Triangle Fine Arls.
Wednesday
fVJAY
MURRAY
IN
JJcs. Bdmorat, 5n
"Siaystacks arkd
Steeples,35 Mack Sen
nett Keystone comedy.
IE BIG SISTER"
Famous Players.
Charlie Chaplin
IN
. ,t- . . i n
"Behind tiie screen
)?
ANNOUNCEMENT.
Announcement has just been made
public of the biarrhige of Mrs. Ze
relda Feebach and Mr. Henry Tucker,
both of Paris, which took place at tin.
home of the bride in this city, on Dec
.10, Eid. W. E. Ellis, of the Paris
Christian church officiating.
Hours-Alamo, 2 to 5:30; Paris Grand,
7Co1 C:3Q, Admission 5 and 1 Oc.
JAMESON REM PLER.
Miss Penelope-G. Jameson, daughter
of Dr. and Mrs. Jno. W. Jameson, and
Mr. Alexander Rumpler, a prominent
wholesale dealer of Indianapolis, lnd.,
were married at 5: HO o'clock Saturday
afternoon at the Jameson home on
Pleasant street. The ceremony was
i performed by Rev. W. E. Ellis, pastor
j of the Paris Christian church. Only
i the immediate family 'of the brido I
witnessed the ceremony. Mr. and Mrs. i
Rufaipler left lor their future home in
Indianapolis after the ceremony.
El MM 11 M Sa lfll
MILLERSBURG
of the various pieces of property,
with those who owned, controlled or
resided in them since his arrival here,
but we feel that in the opening ot such
a ihistory such a preface is necessary
as the above. .
At the time the author arrieved here,
on March 7, 1SS9, to make it his per
manent home, the town ran on Main
street then, as it does now, froyn the
bridge over Hinkston Creek on the
south, to tdie K. W. C. property, which
it now the M. M. I., on the north. The
west side of Main street, beginning
frnni Mm north in front, nf the honm
Miss Katherme Renick, rf Lcxing- of Mr Charles Brown to First street,
ton, was the truest of Mrs. W. M. Mil- was paVed, however, the sidewalks
ltr, from Thursday until Saturday. ,vprp. nafi omi in nianv niaCes where
Brvon and I li tliey were lai(1 in rugh rock, the holes
Hazelrig?. of Tilton. arrived Fridav "llvu '" "' "co- "clc "
a guests of their sister, Mrs. R. L.,.e;therna .snM?th ,st"c r hn
Wilson sidewalk m the town at that time,
however, there were a number of fair
Mr. Priest Kemper, of Covington.
is the guest of friends here.
Mr. nnd Mrs. R. C. Bonar and lit
iJe son, Rnlph, were in Cincinnati. Fri
day and Saturday.
Mrs. Bailes DeBelle, of Ewing. ar
ved Sunday as the guest of her
daughter, Mrs. Mabel Courtney.
-Mesdames M. E.
ANNOUNCEMENT. j
Friends and relatives in this city j
have received engraved invitations an-i
nouncing tiie approaching marriage ot
Miss Katie Grahaim TliQinpson, daugh
ter of Mr. and Mrs. Roger Q. Thomp
son, formerly of this city, now residing
in Columbia, South Carolina, and Mr.
Robert William Cain, also of Colum
bia. The wedding will take place in
the First Presbyterian church, in Co
lumbia, on Tuesday evening, February
6, at 8:30 o'clock.
The prospective bride is a former
resident of Paris, a sister of Mr. Roger
Q. Thompson, Jr., and a niece of Mrs.
John T. Ilinton, at wihose home she
has been a frequent visitor during the
summer months. She is an unusu
ally attractive and handsc.me young
woiman, whose charm of manner and
personality have J.iade her a favorite
in Central Kentucky society circles
and in her new home in the South
The invitation is worded as follows:
"Mr. and Mrs. Roger Quarles Thomp
son requdst the honour of your pres
ence at the marriage of their daughter,
Katie Graham, to Mr. Robert William
or-
FUR
IN1TURE AND RUGS!
!0 Per Cent. Off Every Dollar, For Cash
leginning To-day, and Lasting Thirty Days.
A
"Even-girl." the beautiful two-act ly sood brick walks and many rough j
" " . T . ai puL . on uy, A,1,V ,u" """;;. nni t v wn ! c'ain' on Tuesday evening, the sixth of
King's class in expression nt the M the property of Mr. 1. b. Saage, on f , J. ater eiirliL o'clock
C. Auditorium Friday evening, was .the north, had not been laid, and at- "p
well rendered. The youim ladies were ter heavy rains the ground here, - LVh,. Cin . ' Columbia.
Reeled by a large audience, which in ont of the K. W. C. property.;-0"1" wuo""cl-
gave them encouragement and enthusi was very muddy. On the east side ot
sasm. "Evervgirl" was well trainc Main street there were but few side
Jnd did her part in a way. far beyond walks, and broken m places. It va
-Jiat of the average amateur. The fact almost impossible to walk a square on
r:bat Miss King was to put on a play that side of the street without leaving
vis enouch to draw a latce audienct the sidewalk. The town did not con
regardless of weather. She is one wo- tain a single smooth crossing and,
man who does all things well and the many cobble stone crossings, over Kev. Dr. U. R. Mangum will delivc
audience knew that disappointment which it was impossible to walk on a ' an address at the meeting of the
ould not be one of the features ot dark night. j Missionary Society of the Baptist
The nrosrrani Wp rnwr Mmt Mi-s ,. , , ui.. wlu,tu' 1U L,1U "uiun puwuih, iuij ai
.... . ". - At tnat time we nau no struui. uuis ternoon at -?,0
f ;-...-. v ...... ..... ...wvc.... u.. Dut it was not long alter mis unui me
RARE OPPORTUNITY to purchase Furniture, Rugs, Cook. Stoves and
Ranges at bargains never before heard of, considering the hij?h advance
in raw materials, workmanship and dye stuff vhich is used in all our Rugs.
Our stock is very rjeavy at this season of the year, having purchased in Decem
ber, before this advance, which gives the public the benefit and enables us to sell
you merchandise at a saving of 20 percent. COME EARLY at the beginning of
this sale and you will get a nice selection.
The E. M. Wheeler Furniture Store is known to back up his advertisements
with better furniture and better value for less money than you can purchase else
where, considering quality: We will quote you a few prices, as we will not have
space to quote everything in the house.
Dining Chairs, Leather Seat, Q. 0.
were 'S3.00, now $2.50
Dining Chairs, were $2.50, now $2.00 Q- 0. Double Plank Top 8-Feet
reaestai, was S4U.uu, now w.vu
Again in the near future.
RELIGIOUS. j
- 4 i
Luncheon
Dining Chairs, were S1.50, now $1.25
Dining Chairs, were S1.25, now $1.00
Rockers, were 2.50, now $2.00
Rockers, were $2.00, now SI.50
Rockers, were $1.50, now $1.00
Rockers, were $4.00. now $3,00
Rockers, were $3.50, now $2.50
Dining Tables, square top. S feet, j
were $10.50, now $8.25
Dining Tables, square top, 6 feet,
were $8.25, now $6.25
Q. 0. Double-Plank 45-inch Top 6-Feet
Pedestal, was $28. 00, now $22.00
Q. 0. Double-Plank 4S-inch Top S-Feet
Pedestal, was $35.00, now $27.00
Q. 0. Double Plank 45-inch Top 8-Feet
Pedestal, was $28.00, now $20.00
Plain Double-Plank 45-inch Top 6-Feet
Pedestal, was ?22.00, now $18.00
Plain 45-inch Plank Top 6-Feet
Pedestal, was $27.00, now $19.00
nanarcmisacB
o'clock.
will be served. All invited.
Mr. and Mrs. James McCann and
town Board of Trustees ordered
Mr. A. T. Hillock loaded a car twenty coal-oil lamps to be erected son Mn CharIes McCann. -of Martins-
th his household goods Monday. unon nosts- Vie .,i ,i 1iam,ville, Ohio, united with the Christian
The same will leave here to-day for his street were Deuut-lfu! tlien- as1 nov' church, Sunday morning. Other ro
new home. Mr. Hillock and familr an(1 in the summer time after the in- cent afWitiong to the church were,
irill probablv leave Wednesday. Mi auguration of the coal-oil lamps, eacn j Mrs victor wniitridgc and son. Mr.
Smith and
M
WHEE
LER
EIGHTH AND MAIN STREETS
CLE
Hillock has held the position as sexto:. ot tnem a .Ts,quae apart, theMverciHeve Whitridge, Mr. J. H.
o' the Millersburg Cemetery for sev- scarcely visible from one Wock to an--lMrs George w Clay,
oral years and has given satisfaction ouier a"u "" " i"b " i
it is with regret that we give htm and in tae distance. Tngg avenue, which
bis good family up. Thev leave Mil- lri now one of the , m0.sl PrcMnmenti
iersburg with showers o"f blessing.-. .Parts ot' our town having been bunt
and all kinds of good wishes on the P in rece,lt years- was al! "l Pasturc
part of their many froends for their land- Tne street Tas ,lai 0Ut; '
.future success. WHiile Mr. and Mrs for the most Dart closed up, and was
Hillock did vo conic into our midst as a Part o Vimont street. Ihe cross
strangers, botii having been reared street were used mainl' as alle's for
near us. thev prar;itallv begin their those fortunate enough to own corner
na.rried lite in Millersburc. having homes, to get in with ,their coal, wl ilo
Seen mpmo-.l but a short time prior uJman' of ihei", nnS 1)oneS1 mnL1le-cominp-
hore Since residing here two middle of a block had to take their,
mtle d?up--:itor.s hav- been born to coal in through the front yard, on ac
rhem. ard friends have clung closer to count of the back streets being closed,
them, while thev have made manv ne.v As we unfold these tacts it is witi:
ones. Mr. Hillock has looked after the niuch P"le on the part ot the
dead of manv of our dear fripnds, and author to note the wonderful chancer.,
ft is with sadness that we now givr- this little town which have been
him up. Mr. S. E. Bruce and famil.' niade since MS?Jl- A4S,89' d??'n t.,Ja"':
will .move to the cemetrv .nropertv, "an', 191. While the older inhabi
Mr. Bruce having recentlv received tants of Millersburg are lamiliar with
liis appointment as successor to Mr. all, and more, too. of wihat the writer ,
Hillock. We welcome this estimable ay sa' as .th-s history progresses,
family to the place and fe2l assured ct we trust it will awaken a new m ,
that the Cemetery Company could not terest in Millersburg. s history, and
have made a betler selection. M. maT lead to something that will prove:
Bruce and familv have resided in our profitable to many ot us as well as,
midst for several vears, and we are entertaining. In 1889 the town was j
nil thnrmifrlilv ntmr.liPrl tn thPtn UllQer tne control oj. a oouiu ui j.iu-
Dverybody will give them all the as
slstance possible to make their po&i
tion a pleasant one.
(The following is the first of a
tees, consisting of five members, whose
chief duty was to audit and pay out
standing bills of the town. The spirit
of improvement had not then begun
Tilmv Imet -once a month in various
series of interesting articles on the P'aces ana spent dui mue ume
past history of Millersburg, prepared transacting their routine of busines3
by our Millersburg correspondent, A town Marshal, Police Judge, and
Mr. R. M. Caldwell. These article.-; Treasurer constituted the other towL
will appear from time to time, and officials. Local option was m vogue,
cannot fail to be of great interest to at the time, and the town was full ot j
mir readers, csneciailv former rosi- bootleggers. A number ot years later.
dents of Millersburg, who are now in license was again voted in. Just be
o;her places.) ED. THE NEWS. lore the County Unit bill went into
utctory op m nrnQmircr eflecL il was agalu voted ouU ancl l "
. HISTOR OF MILLERSBURG. tQwn hag hQQn dry sincc
The little ciy of Millersburg is one jn ig89 there were no laws prohib
o' the oldest towns in Central Ken- itmg stock from running at large in
tucky, it having been chartered in Uip llie sU-eet, nor was there a dog tax,
early part of the nineteenth century. ,.ogs roame(i where they pleased, and
and derived its name from its founder in tie summer time cows lounged la
one John Miller, who lies buried nt 7iy lli:(ier the shade trees chewing
the old cemetery just north of town iiejr cud. TJie town was full of
Many. of his ancestors are prominent. 'dogs, many of them half starved, and
and so extensive are they that they ere' a nuisance to everybody. Every
can be tound all over the world. At U0ly rajsed chickens and many fed
one time the town and community was them n tie sidewalks. The grass
largely made up of the Miller family. an(1 weeds on tiie back streets weie
They are now scattered, and but few largeiy kept down by the stock that
of 'the old family remain here, who run at iarge. Notwithstanding all of
will be mentioned from time to time the town possessed a great deal of
as this imperfect history, unfolds it- jiride, and even in those seilaiingly far
self. back times we were far in advance
Millersburg has always been a pro- of many piaces in Central Kentucky
pressive, aristocratic, educational cen- of our size t was tue largely to
ter, and from the time of its organiza tne educational interests which has
tion to tihe present, visitors have loved been a part oC Millersburg tor three
to come to it, because they were al- fmarters of a century.
ways sure ul iccciviu guuu uiu-iaaii'
ioned Kentucky hospitality, and a roy
In the spring of the year our homes
For many
and business houses were then as now,
lav, (some of whom have passed away 3u did not have your -quo to ot visitor.
l S Tot the writer ia these a.roi- ch ckens from Tennessee and ther
cles to give a detailea history of Mil- Southern States. .
.lersburg from its beginning, but only , (To Be Continued.)
i
In All Departments!
All Winter Shoes and
Rubbers Must Go!
Despite the great .advance in the price of Shoes and Rubbers, we
have greatly reduced all short and broken lines in Men's, Ladies' and
Children's Footwear.
PREPARE NOW!
An opportunty offered you to supply yourself for present and future needs. Come here tomorrow
and take advantage of this BARGAIN CLEARANCE SALE!
)
ihOVER -
SALE
Ladies' Dark Russia Calf Boots
6.00 values
Ladies' Dull Kid High Cut Boots
$4.50 values
Ladies' Patent Kid Cloth Top Boots
5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values
Ladies' Gun Metal, button, 82.50 values 1 -69
Ladies' Felt Boudoirs, SI. 00 values 59
Ladies's Felt Juliets, fur trimmed '
1.50 values .
$3.95
3.49
2.99
2.49
Men's Russia vnd Platinum Calf English Walk
Over Samples, S6.00 values $400
Men's Russia and Platinum Calf Walk-Over
eand Jbseacon, b4.o0 values
Men's Gun Metal English Medium Toe Welts
$4.00 values
Men's Gun Metal Button and Lace
S3. 00 values
Men's Tan and Black Romeos
$1.50 values
Men's Black Felt Slippers
75-cent values
3.49
2.99
'i .99
.99
49
Boys', Misses' and Children's Shoes al Bargain Prices.
EROM THE
MacDoimld-Kiley Bankrupt Sale
Men's M5gh Grade M. & K. $ 1 O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to D
ON SALE
RE AT ONE-HALF PRICE
3D
m&-
isr
Paris' Greatest Shoe Store.
OOHE 1ST
335 Main Street, Paris, Ky.
I
S Jiintf
V