FAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
TUESDAY, FEBRUARY 27, 117
I
1
(
1 I
MILLERSBURG
Mr.
again.
J. G. Allen is able to be out
!'
DEATHS. LOCAL COLOR STORIES
STAGG.
Mrs. Kate Stagg, widow of the late
Mr. Abram C. Stagg, o Bourbon
county, died at her home in Mercer
county, wihere she had moved after ;
the death of her husband about one j
year ago. She is survived by one '
granddaughter, Mrs. R. B. Parks, of .
Lexington.
BY LOCAL RACONTEURS
Just as "Full many a gem of purest
ray serene the dark unfathomel
caves of oceai) bear," so there is
many a gem in the way of a good
(story lurking around Paris, that has
never found its way into the prints
I Paris has several Chauncey Depews,
who qould, on even grounds, discount
that noted after-dinner story teller.
Mr. R. M. Caldwell and Mrs. J. B
Cray continue to improve.
Mr. T. F. Rigdon returned Friday
rm a business liip to Cincinnati.
Mr. and Mrs. F. E. Peterson were
quests of her parents, Mr. and Mr?.
Jtfce, at Shawhan, Sunday.
Cadet Harry Richie, of M. M. I..
TtlLfi a. eilRfit. nf f.nipt P.lnv. nt Pdri.-;
from Saturday until Monday. ' ' j who died Thursday at the home of her
, , , orotner. Air. Isaac Keller, near Kiser
ivir. w. r. oaunuers
TlhurQflrj v nffor rt tlrro.i noT.-c
i. PTnHP Mr, nnrc nn,i nllP at eleven o'clock Saturday
riven will remain several weeks longer !with services conducted by Rev. Dr
.. .,. . ., , u. it. Alangum, -or the Pans Baptis
-mi. iautr okiuui unu luiuiij, ui churcn Tjie
TT.iussviiiti, .ur. aiiu .Mrs. uruan
Dwmoni, oi lanihie, were 8ura o- nniiAoarc w mm., tv-i newspaper men, one attorney, one law
fcr ann nir5 .1 i : rnpmpr iHTiir- " .i -.w. v, .i, m-.ju. -
4ay and Sunday.
TT?.T.T.T7!T?
-The funeral of Miss Mattie Keller. T iS, leu? .f matrial here for
iuwu.1 wiui otuuua, aiiu must Ol JL
goes to waste for want ot a chronicler.
rs returned jto wa's he'Id at the Keljer residenCfc Occasionally a coterie of these kin
?J!:,at eleven o'clock Saturday mornins tlred & together, and then
some goou stones are uncorked.
A few nights ago there was an
o cenm l"I ? rf 1 1 - i 4i4-a 4- .. ,.
burial followed In the " - . V ."'. "'"LCi, "'
me rans noteis. composeu ot two
at Kiserton i
yer who had never been called Judge,
Rev. A. S. Venable. Jr.. who has
lfcben at home for a few days sincj
the close of the Laymen's Conven
tion, at Lexington, left Saturday to
rosume fliis duties at Presbyterian
Utrllege, in Virginia
Mrs. Tandy Hughes, of Lexing-
v,ti, opened a dancing clas
M. M. I., Monday afternoon. Quite
a number of the cadets and teachers
..are taking advantage of her instruc
tion. The course will consist oi ten
lessons, closing some time the early
part of May with a matinee dance.
Kiser burying ground
The pall-bearers were,
'lnrf TCispr Tvpnnnv Tvispr Stnnnr K"rl
ler. Miller Kiser, Ernest Kiser and a."? a un(ler s Just a Plai
Ed Keller citizen, but a good story-teller, and
, " (here's what ensued, when one of th .
FICKLIN. J newspaper men told this one:
Major Horatio Ficklin, aged sixtv I "Several years ago in Paris, when
.I've, cne of the best-known men in some of you felIows were livinS some
Maysville, died at his liome in that wnere eIse' ther'- were here two Iiv"
it tho fty yiiday night, after a short ill- ery siaDie .proprietors, wnose places 03
nes? ol pneumonia. Maj. Ficldin was """":oa "cxc BUU,,lcu """sue ui
tin ot the originators of the Uniform each cther on a certain busy street in
Rank of the Knights of Pythias, an!tne town; Tnc' "Acre rivals ln a bus
r.;-ganiration whicn he lived to see I iness wa' and a?so for the heart aml
grow into one of the greatest frater-han'1 of a fair belIe of Paris- T3le-r
nnl orders in the State. He was a di-jha(1 been usin the newspapers, the
rector in Wie Staie National Bank of ol(1 Paris TruG Kentuckian being then
Rev. R. S. Saunders, of Thomas
-rille, Ga'., visited friends here from Masville, a large property owner and !tlle fading paper here, pretty freely
Saturday until Monday, and preachcl
at the Presbyterian church Sunday
-.morning and evening. Rev. Saunders
was pastor of the Presbyterian
tfihurch here for five years, and his
jitany friends were glad to see him.
33e preached to two large audiences
m Sunday.
was for a number of years Wharf- in uieir campaign, une oi mem naa
nuibter at Maysville. He was a cousin 'a11 advertisement in The Kentuckian
( f former Lieutenant Governor Wm and also had a 13S strip of cardboard
!I Cox. He is survived by two sic-1 Printed with lihe words, 'Our Horser
tor.. Ma . Finkl n rliprt in tlm rnnmieeu ino wiup 10 iia.u mem ou.
where
ago.
he was born sixty-five year.i
The Young Men's Dancing Club
will give a dance at the Opera House
iliis evening, becinninir at 9 p. m. A f
;ocaphone tria will furnish the music
The following is a partial list of vis
itors who have already arrived: Miss
lary Ross. Paris, with Miss Margaret
Jlen: Misses Eiizabe'ih Peed, of Mays
Tille, and Louise McAllister, of Lex-
tGELS.
Tie funeral of Mrs. Mary Davis
Ingels, aged eighty-eight, who died
at the home of her daughter. Mrs. F.
J Cheek, in Danville, Thursday even
ing, after a lon illness., was held in
Paris, Saturday afternoon at 2:?.)
which he placed in a conspicious place
in the window of his office. This bit
J of sarcaasm naturally caused some
amusement at the expense of the .pro
prietor of the rival stable, but in a
short time ihe had neatly turned the
trick by inserting an advertisement
in the paper, and placing a sign in
his window, which read: 'That's true
what that fellow says, because the
The prisoner was an old offender, ye. m
Judge Chas. Daugherty Webb, who jj
was filling the office at the time, felt j!j
that he might want some excuse in ij
the record. After hearing the testi
mony and my argument in behalf of
my client, Judge Webb said, 1- tell
you i am sorry, but I'll have to mako
it tihirty days in jail. What have you
to say to that?' The fellow, who was
one of the best-natured men in Paris,
and at all times, drunk or sober,
witty, looked at Judge Webb, and as
Chief -of Police James Mernaugh led
him down the aisle, he turned aroun 1
and said, 'Nothing much, but I think
you are d d liberal with my spars
time.' "
coming
AUractions
PARIS GRAND iD ALAMO
Additional Personals.
o'clock. The body was brought to wintl blows Ins tinn old nags along"
afternoon, and was ! e lawyer who Qiad never been a
taken to the Ji.une of her niece. Mrs. "Judge orougnt out tins one as ms
V4n n,-i l- Atro A C P.nct Miccoe
Aazie Young Jackson and Elizabeth .s' . mav
I Tr.nl-cftn trvf Plwinctrt-illri itli Affc
t -'i,ijii. v w i i"b' -, ci ...i.j . 4..n...! i .t.,. e l
Carrie Pots: Misses Farris. Fielding K- J- eely, on Duncan avenue. ' l",,uuulWH L u,u ll,ui:-
-And Ratcliff. of Sharpsburg. with where services were conducted b ' "Some weeks ago the wire ol a cer-
Mrs. James Ralls; Miss Elizabeth Rev. J. Q. A. McDowell, pastor ot tho tain member o- the Bourbon caunt
Walker, of Lexington, with Miss Lou Danville Presbyterian church. The 1)ar issued a ukase to her cook, who
ibe Myall. , burial followed on the family lot 'i au acquired the habit of absenting
On Saturday afternoon. Cade the Paris Cemetery. The pall-bear- 'herself at very important times, an:'
Hamilton, assisted by some of his fe!- ers were her nephews, Messrs. Owen the result was die director of the cul-
kw cadets, gave a matinee dance at I Davis, Rudolph- Davis, Walter inary department quit and left the
tne M. M. I. Drill Hall. It was one of Davis, Wallace W. Mitchell. Charles service. Efforts u replace the kitchen
the most pleasant social affairs of the b . ntdiiell and George M.Davis jlady left the lady of the house
fieason. The building was decor- Mrs , ,s WJS a ,ye f p , th on her c.,vn resourceSr s0 ah,
efdurinf Xrlt The a sier of Mrs. George W. Davis, of rolled up her sleeves and for al.ut a
7ausic was furnished bv a Lexington ans- &ne naa ueen a resiaent ot piuvku iu.v iukui umuu ilu
orchestra, Tihefollowing is a partial Paris for over seventy-five years, ha.
such meals as he had not had since
P.st of out-of-town guests present ar ii.g. with her husband, the late Mr. the days wnen Uiey had no sucn thing fa x&
Uie reception and dance: Misses James D. Ingels, resided in the old as a cook. My friend's delight was so
Wary Kenney Webber, Catherine Wil- Ingels home on South Main street, great that he immediately provided
son, Elizabeth Crutcher. Cordie Stev- mv occupjea Dv Mr. and Mrs. Martin this wife with a beautiful new fur
prison; Mesdames fKate T Wilson. ,, , ghe was a daughter of th. cioaK that she had coveted for some
han Rotor ol : Paris; Miss Pollis late George ravis- one the Di- tirae' Quite liaturall' the inclden-,
trVJt5ullins, Lena Mae Jones, Mr. Alvin Reer residents of Paris, who for many, became known among their social ar
' Ilou. of Winchester; James Baun- years was in business in this city, qualntances, and a spirit of envious
yfark, Lewis Hamilton. Misses Mabel Cf the family of six children, Mr emulation soon developed in certain
Sinclair, Christine Ward, f George- George W. Davis is the sole survivor, quarters. It was in this mood tha
town; Mr. Joe Harris, of Carlisle ' Mrs. Ingels was a lifelong jnember'or.e of the ladies recited the story t
Misses Margaret Cook. Charlie EJ cf the Paris Presbyterian church, her husband: 'What do I get, dear, i:
vore. of Lancaster; Misses Katheriw- , , be member when very I do the cookin? for a week?' 'Well.' !
Tucker, Lola Campbell. Mr. Bryan ov. . i - , , i i. i i -i . .i i r
UcMurtrv of 1 rxhi"fon- Miss Myra oun5- Sne retained her membership lier husband said,' at the end of ;
Jacobv of Clhit'JnvTlle;' Mr. Nathan $ere until her son-in-law, Rev. Fran week, dear I rather think you'd be
Young,' Hisel Asbury, of Carlisle. ? Cheek, moved to Louisville, and ready for one of those long black i
Cecil Brown aul Owen Hendron, of tl en to Danvil'e. where she accom- crepe veils.
Lancaster: Mr. Harmon Turner and panied him and his family. Mrs. ' Tnen the "rounder." wo was just
itiss Juliet Turner, of Paris; Mis.s Ir.eels'was one nf the most hicrhlv-re-'n. nlain snoken citizen, snoke un
spected and estoemed women of Paris, thusly: 'Well, I will have to tell about
and had a host cf friends and ac- a pood friend of mine who came to
quaintances in Paris and in the county Paris recently from a neighboring t
wrtto heard of her death with genuine city on a business errand. He had i
sorrow. She had been in failing numerous purchases to make for his
health for several years and for the wife before returning home. After j
past few weeks had been confined to(he had disposed of his crop of to
her room. Her death was due to the bacco at the Bourbon Tobacco Ware-1
infirmities cf ae. j house he began his shopping expedi
i tion and along toward the shank or
tQie evening he happened to recall an
Mr. Lawrence Price has returned
fiom a combined business and pleas
ure trip to Chicago.
Mr. and Mrs. Charles W. Heck
have as guests Dr. and Mrs. Stanton
Heck, of Salem, Ohio.
Miss Katherine Taylor, who has
been quite ill at the (home of her par
ents. Mr. and Mrs. Edward Taylor,'
en Main street, is improving.
Messrs. Jo. Varden and John
Stuart are organizing a Friday night
Dancing Club. The first of a series
of these dances will be given on Fr:
day night at Varden's Hall.
Among those from Paris who at
tended the Laymen's Missionary Con
vention in Lexington were Mrs. Amos
Turney, Mrs. R. J. Neely, Misses May
and Lucy Colville, Judge C. A. Mc
Millan, Dr. F. L. Pasley, Mr. Peale
Collier and Mr. Wm. G. McClintock.
Miss Hazei Houston, ot near
Paris, and Miss Desha Smith, of Lex
ington, are guests of Mrs. George
Adair, in Pensacola. Oklahoma. The
were guests of friends and relatives in
Oklahoma City last week. From there
they will go to oUier cities in the
West to visit friends. Upon their re
turn they will visit in Muskogee.
Oklahoma, before returning to Ken
tucky. Among those from a distance who
attended the funeral of Mrs. Mary
Davis Ingels, in this city Saturday
were Rev. and Mrs. Frank J. Cheek
Miss Elizabeth Cheek, Mr. Samuel
Cheek. Mrs. Redd, President Allen
and Miss Fannie Ingels, all -of Dan
ie; Mr. and Mrs. Boone Ingels and
daughter, of Carlisle; Mrs. Ben C.
lnjrels and daughters, Misses Belle
and Kate Ingels. of Lexington; Mr.
and Mrs. James Erringer. of Chicago.
The following party left yesterdav
for Kansas City, Mo., to attend th-
meeting of the National Association
of School Superintendents: Prof. M
A. Cassiday, of Lexington, Superin
tendent of Schools ; Prof. R. S. Eu
bank, of Lexington, editor of the
Souther School Journal; Miss Jessie
O. Yancey, of Maysville, Superintend
ent of County Scihools of Mason
county; Miss Mabel Robbins, of Paris,
Superintendent of Bourbon County
Schools; Prof. T. A. Hendricks, of
Superintendent of Public
Schools.
(Other Personals on Pages 3 and 5)
A GREAT BILL
FOR TUESDAY
Charlie Richman and
Dorothy KeJJy in
"THE SECRET
KINGDOM"
By Louis Joseph Vance.
Douglas Fairbanks in
"American
Aristocracy"
Extra Good.
A beautiful five-piece sou
venir free to lady patrons
WEDNESDAY.
Blanch Sweet in
"THE STORM
11
A Famouns Playeis' production
ital interest to old and young.
Billie West in
Conceded by all
Charlie Chaplin.
'His Married Life."
to be funnier than
THURSDAY.
Charles Ray and Margery Wilson in
"Honorable Algy"
Also a Luke coniFdy and Pathe's
Pictorial News.
Hours-Alamo, 2 to 5:30; Paris Grand,
7 to 1 0:30, Admission 5 andlOc.
!
The Worst Handicap
in the world is WORRY it ties a man hand and foot
takes off the edge of his talents- and cuts down his
ability.
WORRY as to what will happen to the family if any
thing should happen to you, will do more than anything
else to reduce your earning power.
LIFE INSURANCE solve the problem -the day you get
your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
i Ihe Northwestern Mutual Life Insurance Co,
R. F. CLENDENIN, Associate General Agent
Suite 201-202 First Nat'l BanK BIdg. PARIS, KY.
Our Big Bargain Giving
Jnliet Varden, Miss Luia Tilly, of
Lexington; Mrs. H. B. Mantel, Miss
Margaret Mantel and Elizabeth Hays.
Blizabethtown ; Helen Yantis. o:'
Lexington; Kelly Stone, of Winches
ter; Miss Fanny Piatt. Mrs. Thomas
Piatt, of Lexington.
The twenty-forUi annual Junior
Reception of the M. M. I., was held
Friday evening from 8 to 11 in the
main building. About 400 invitations
Trere sent out, most of them respond
1 to. There were twenty cadets
-vith Col. Best at their head, in the
receiving line in the library. On en- j
MPMP WPM PIIQV
' WWi. 1 ,, T - 'J.- ,--1 i-.l-l 1.1 J
otuer arucie nis wue uau iuiu mm lu
( 1 J ...!.:!. !. 1 1 M-1 J
About the busiest people on the j Purcuahe ax:a w.mcu ue "d" . ,
IJOL down on .am meiuoraiiuum uuua
terinr the front door the T-ue-ts T were fa at this season of the year aro J0L uu "V T . , ,, r
L,Zil.Vc , ?: f'the hemn breakers, and npnrlv rrir!With all ofis bockets full of small
the orchestra, with O. C. Rankin as day several wagonloads of hemp can j Packages and almost an armful of
harpist, stationed in the rear of the be seen on the streets, en route to,otlliers' he stePPe(1 mto Tne Fair-
front hall. The color scheme was, the warehouses 0ue of tne clerks canie UP and P
red and white. The entire lower! The t.ohafU,0 rr.mi nr nisn vorv hv '"te!y asked him what he desired to
! the county to fuMiish material for
purchase. He informed the clerk that
fhis wife had told him to get some
4ltn -m V a. li1?nv irn c ?ftrtM
. nuui jl uic Jiiaiii uuuums naa ucv,ui 'nnd
ated in military stle and in harmony '
..... ,-.. , j Liie fiiuniv tn 1 sn maror a nr a i
Htll ttie COIOmai limes OI wasiung-- , . . . . ' 'unn,1t: tn rmr mi ihrx Ipp-r nf Pliinlrpns.
ton. In the dining-room cut flowew numoer ol goo-i sales, stripping or :""';; ;;" I,; jiorrined when thf
-were very much in evidence on all the the weed is practically over, and the , and as perfect! aiornfled when tm
tables. This rcom in its artistic dec- smoke of burning beds will soon ba clerk beean to show nim a c,l01cef Rl
crations of flowers, flags, hatchets. ' seen if the weather will permit. A sortment of garters. But he got em.
cherries and cherry trees was farWeat deal of lall Blow-in has been anyway."
more artistic in its arrangement than Annf whinh win oCQ n ,,ei, ,i?.r ' It was the second newspaper man s
any ever given at the M. M. I. In ' h ' vf. fwn nMTlt,lls
Wending the decorations Mrs Best
wove into Uiem washing on Lincoln - inorea;ed ive- William Purnell was in the County
and Wils-on. It was a decidedly unique tliat there will be an increased ve- . ffi brought be-
, . i i :..-,,., ,. i, ntrp nf hntli tnhnorn nnA lipmn fnr tho'JlldgeS OlllCe a Ca.SC was urougllL DC
l: " . TZ , i :;w 3i; X rZ;: fore him where a man was charged
in at a giance u wi iwcuu
3 31! liS
) 4 .
iOVER -4i in. ; 4
OADIN
Is
Cotinues Unabated,
bringing- you the great
est avalanche of shoe
bargains at a most op
portune moment.
REAP NOW
YOUR HARVEST
of our unlimited re
sources; our many years of merchandising knowledge;
our prestige in the world's greatest shoe markets.
THIS WEEK
more wonderful bargains, greater values, greater
economies that will simply force you to buy now for
future as well as present needs.
ALE
X. v
1
chance, and he came through with
,-nri,VnH-nne!this: "Many years ago when Judg
The coming season, Jth about an average
refreshment consisted of vanilla crop of corn and other crops. Wheat WILU catl"s "" ""- - -
cream, cherry ice. individual cakes iis not looking very well, especiallv through the usual process .and wa;
rith a miniature flag in the center that which wa3 planted late, and it'siven to the jury. After being out
-hich was afterwards used as a souv-L fllp nn,n?mi nr Rnmp formprR thnf 'some time they solemnly filed m,
ir, while candle I cherries In stems R hM bMn hurt severe I Judge Purnell asked them: 'Gentle-
jmen of Wie jury, are you agreed upon
your verdict?' The foreman replied,
Miniature hatchets and
WAvn nfiGCftH
the eagle flag of the day were very i freezes and thaws
Notwitlistanding
-mnnVi in OVlHonPP
ke inclement weather, a good tiroej
-was enjoyea oy an presenu iuia. i
JESJC vas at ner oeat anu uau a uiv- M . mpTllf XTT A T
4 We are.' 'Do you find the prisoner
guilty or not guilty?' asked Judge Pur-
ii ittv A Wi, Ar" Tin u-liot"
- ilieil. ve uu. xuu. uv J-v "uui.
.Tiirtee Purnell snoke up. 'We find the
ich a glad hand, which made tliernjf " prisoner guilty or not guilty," answer
jeei "welcome, anu very uiucn at iioih-. ,----------- .
led the foreman.
A
SMITH FARM SOLD.
'But, gentlemen,' said
ADAMS MAYBRIBR. the Jud&e' you canil0t retUrn a ver'
Mr. George M. Maybrier. and Miss dict like thf V 'Wel1' l kno''
Lucinda Adams, both of Jie Center- responaeu. uV loieuxau. iuu &e ti,i.v
The real estate firm of Harris
P iville vicinity, wer- married Saturday lot us IOUIi" """ KUllLi a"u aiA UL ua
tVr f k i,t, i, r.cniin ... have found him not guilty and we
'Speakes. of Paris sold last week the Rey w Q Sadle on HouatDi agreed to let it go at that.' He got an-
farm ot Mr. Frank G. Smitii, located other trial and was sent up for sixty
o the Ruddles Mills pike, about two ' " days."
wiles from Paris, to. Mr. Sidney G. J WEBBER CARR "Well," said tihe attorney, who had
Slban, of Magoffin county. The farm all along been an attentive listener,
coatains sixteen and one-half acres of ( A marriage license was issued ;"ni have to chip in this one, and close
vail-improved land. The purchase , Saturday from the office of County the session. I had a case in the Po
ric was $4,000. Mr. Sloan will move , Clerk Pearce Paton, to Mr. Robert 'iice Court several years ago, where
itl farm.about the first of the Webber and Miss Nannie .Carr, botiih was defending a man chareed with
montti. ' . of Bourbon county. 'drunkeness and disorderly conduct!
Ladies Dark Russia Calf Boots
6.00 values
Ladies Dull Kid High Gut Boots
$4.50 values
Ladies' Patent Kid Cloth Top Boots
$5.00 values
Ladies' Patent and Gun Metal Shoes
S3.50 values
Ladies' Gun Metal,button,$2.50 val.
Ladies' Felt Boudoirs, SI. 00 values
Ladiesfs Pelt Juliets, fur trimmed
$1.50 values . ,
$3.69
2.49
1.99
1.69
.49
.79
Men's Russia and Platinum Calf Walk-Over
and Beacon, $4.50 values $3.49
Men's Russia and Plat. Calf English Walk
Over Samples, $6.00 values $4,00
Men's Gun Metal English Medium Toe Welts,
$4.00 values $2.99
Men's Gun Metal Button and Lace
$3.00 values .99
Men's Tan and Black Romeos
$1.50 values 99
Men's Black Felt Slippers
75-cent values 49
Ladies' Dawn Grey Kid, Also Mahogany Tan, Most Fashionable Boots at Almost
ONE-HALF THE PRICE YOU PAY ELSEWHERE
Boys', Misses and Children's Shoes at Great Bargain Prices.
FROM THE
MacDonald-Kiley Bankrupt Sale
Men's High Grade M. & K. $1 O.OO and $12.00 Shoes
Varsity Shoes AA to D
ON SALE MERE AT ONE-MALE PRICE
DAN C0HEN
335 Main $treet, Paris, Ky
Paris' Greatest Shoe Store.
9
m
&
9
m
?
v'V