-.; '-
tBON NEWS, PARIS, KY.
FRIDAY, MARCH M, 1M7.
&
!i,
m
Kf
Uw
-' 1;
1
-(.
h;
fci
-
- MILLERSBURG DEATHS.
ei
. rMrs. J. E. Popl is the guest of rei
ttree In Virginia.
RTCTinTATTC
'
RELIGIOUS.
SNAPP. ' There will be no services at the
The funeral of Mrs. Pearl Bell Christian church next Sunday night, as
MATRIMONIAL.
MORRlS ALBRIGHT.
PROGRAM Of BIBLE
SCHOOL MEETING.
The quarterly conference ot the
Bourbon County Christian Bible
School Association will meet at the
Christian Church in Paris, on Mon-
Miss Edna Morris, of this city, and day' APril 2. The following interest-
frmMSi' MtMdP-SS? tf JS2 Snapp' aged thirtyeIent who died at t will be the regular monthly song Mr. Harry II Albright, of Cincinnati, Wprogr
Pj extenaea vis to mends in four 0,clock Wednesday afternoon, at service, for which a special program were married at the residence of the lo-oo
me nome or ner nusoand, Mr. Carl -"uo ueeu arrangea.
program has been arranged f
officiating minister, Rev. Robert B.
2L$Jr TsmPC HlTOrlov rf TnaTwfncre- . .
trg, is the guest of his daughter Snapp' .n Parrisn avenue, was held at The regular monthy business ses- McDaniel, in Cincinnati, last Saturday. A. Wolf.
Mrs. E. S. Barton. ine Iamuy resiaence, at two o'clock sion of the Paris Epworth League will Tbey aid not tell any of their friends
rg,
10:00 Devotional.
10:20 The Opening Exercises-
-W.
10:40 The Superintendent
In the
Mason has returned yesieraa aiternoon, witn services con- be held Thursday evening, April 5, at of UielT intentions, but going over to School J. W. Jones. ,
Va. and will auctea D ltev- ur- w- u- Sadler, pas- 7 o'clock at the Methodist church. All Covington, procured a marriage -u:uu Class Work W. O. Hinton.
here in the future. ton ot tI1G lans Methodst church, members are urged to be present license and returned to Cincinnati. -ii.u securing and Holding Pu-
Mr. Allen
kome from Farmersville
make his home
Mr. Rft,s Mwhrfpr n fnm,i. T.he &? were Roy Smart, Os- The Presbyterian congregation wnere ihey were ied
kave moved to Lexington from th's Tf warf' Dr' rr' ?nas- B- will hold services at the court house! FOOR-SAYRE.
property of Mr. W. E. Collier, on Trigg lexander, James Gnnnell and Joseph next; Sunday morning and evening At Mr- 1failk L Sayre aud Miss Lillie
avenue. ( James. The burial followed in the the morning service the sacrament of Fo0T' boUl l,f fiington, accompanied
,.j uicwij. i1 Tnr,la Qimnar will Tio orlmn;n
TTr 111 SNS1"t j-hst TinAHi Zj l1n 4-
e out again Mr. Russell Powell is' Snapp had been in declining tered.
atill improving. Mr. J. B. Allen and "emu lor 50me ume' uer tteatn being
Mrs. J. B. Cray are able to be about aue t0 tuberculosis, which she con-
by tne groom's sister, Miss Vinrie
Sites came to Paris Thursday afternoon
and secured a marriace license from
Win.
tracted a year ago. She bore her suf-
-Thr, nrotntoH mMti i,a on ferinS with fortitude and patience and
ging on at the Presbvtertan church CRlmly awaited the end which she
.lor the past two weeks, is growing in knew to be inevitable,
interest A special sermon was dear-' Besides hei husband, she is survived
red Wednesday afternoon to the by two chM.lren, Olive Snapp and Ju
ladies. Rev. Wilson is a powerful lian Snapp, her father; Mr. John E.
speaker ana large audiences are in. at-, Mastin, and her step-mother, who re-
sides m Lexington, and one brother,
Mastin, who resides in
A friendly contest for increasing nZZ ."i t B t, iu
the membership of the Methodist Sun ZTLrJti f6"?, Pat They
rinv s-hnni ie hoinff nnnfifflf1 k ,. were maried later at the residence of
j w..v.vf uv-i"b wuuuuitu ujf LUC
men's and women's classes. The ladies
were in the lead at the last account
by af majority of 14.
the officiating minister, Rev. W. O.
Sadler, pastor of the Paris Methodist
church.
A license was also issued the same
-jtendance at each meeting.
, eo?
.
' HUTCHISON.
Mr. F. A.
Knasas.
f'' Mr. John Wiggins was a visitor in
' ftxingion, Tuesday.
The children of Mr. and Mrs.
Smart are quite ill with the measles.
Mrs. I rbert Karick and son,
ITItrest, are visiting friends at Win
tester.
Mrs. Thomas Smith was a visitor
la Lexington, Tuesday, the guest of
friends. -
Mrs. Thomas Berkley and daugh-i
ter, Lillian, attended the Alma Gluck
BUCKNER.
Sunday being the first Sunday in fmv hv f.inr. p,fn tn Qoi r, T,.v.
'Trvf !ibei:eld,ajld Mi3S Mia Browning, both of
.u uwuiau iiiuiuu, ul me uiuse Bourbon county
ul mi; luurumg aervice. iiie sacra
ment of the Lord's Supper will be ad
ministered by the pastoi, Rev. W. a
Sadler.
4'409QO $4
O
At a meetine of nrocram commit
Mr. Walker Buckner, Jr., son of tee of ths nitv TTnion nf Ymim? Pon.
Mrs. Watkor Buckner, Sr., died at the ple.8 societies, Wednesday afternoon,
home of his father, on the Cane Ridge a program was arranged for -Easter
pike, near Pans, at nine o'clock Wed-,Sunrise services. The service will be
nesday morning after a short illness, ieid at the Methodist church. See pro
Mr. Burner was a well-known young gram in next week.8 BOURBON
Luimt-r. rit was a muu oi unusual size, NEWS.
weighing qyer three hundred pounds.
He had hern in apparently good health
up to Monday morning, when as he
BIRTHS.
& J 4
In Detroit, Michigan, Tuesday, to
the wife of Mr. James Harvey Faul
coner, a son weigth 8 pounds. The
mother was formerly Miss Nettie
Dykes, of Paris.
RAILROAD EMPLOY SUFFERS
FRACTURED BACK IN FALL.
Walter Deering, a local Louisville &
pils C. O. Cossaboom.
11:50 Closing Prayer.
NOON HOUR.
1:00 Departmental Conferences.
1:30 Song Service and Devotions
A. L. Boatright.
1:45 The Offering in the School
John Christopherson.
2:05 How to Induce the Pupil to
Stu'lv J. T. Sharrard.
2:30 The Teacher and the Religious
Life of the Pupil R. H. Ellett.
3:90 The Up-to-date Sunday School
in the Adult DeDartment Glenn
Murdock.
3:30 Closing Round Table.
4:00 Closing Prayer.
Mr. Glenn Murdock, the State Adult
Superintendent of the Kentucky
Christian Bible chuol Association,
T?11 iriaif fttri Allnminn 1 I
Bourbon County in the interest of the J
Adult Department of the Bible School: A
uiLue nuns, ouuuay morning; iii3Con- j
dida, Sunday afternoon; Bethlehem,
bunaay evening. Quarterly Confer
ence at Paris, Monday.
Delicious
Juicy Meats!
VEAL
PORK
CHOPS
STEAKS
Tte Best Roast Beef
and Breakfast Bacon in
the World.
WILMOTH
Grocery Co
Phone 376
Barring licker ads in prohibition
States should be an actual relief, as
they merely add to an already distress
ful situation.
performance at Lexington this week.
Mrs. George Jacoby and daughter ! unconscious condition, gradually grow
11153 Myra Jacoby, were guests offing "weaker until death relieved him.
!aris friends this week. I
'"?5
The monthly buisness and social
social meeting of the "Woman's Mis-
ci mi Cnniofv itrill Viq liolrl of fVin TVTiifl
was getting out of bed preparatory to odistchurcJ afternoon at
dressing for breakfast, he was stricken ,. .. . MM ou. Bruer ...
witn aporicxy, tlie stoke affecting his;conduct the devottonal program. .Nashville employe, fell Wednesday on
entire let side He did not rally from jthe ladieg Qf church are inyitea his back across a pile of timbers, and
the stro.vP. and remained in a semi- . Dreseut , it is believed he sustained a fractur
ed back. He was removed to the
-Rev. W. O. Sadler, pastor, will Good Samaritan Housnital, in Lexlnc-
Besides his father, Mr. Buckner is nreach at the Methodist Church. Sun-1 ton. where ha is rpnnrtpri n mcHti,
Mr. M. K. Jacoby, who has been ! survived 'jv one Drotner, Mr. woooa- day at 10:45 a. m. and 7 p. m. At the well,
seriously ill with pneumonia, is ablo f"-'l Buo'-nor. of near Paris, and one morining service the Sacrament of the ! Peering was assisting a crew of
to be out again, much to the delight sister, Mrs. Sue Buckner Hinkle, of Lord's Supper will be administered, bridge carpenters in removing some
of her numerous friends. Kansas City. Mo. His mother, who Sunday School at 9:30 a. m. Epworth heavy timbers when his foot slipped
"?r J'l' Brown' ?'ho !ia een was Miss Nannie Clay, daughter of. League devotional services at 6:15 p on a pebble which threw him on his
at the God Samaritan Hospital Lex- Mr Fran K clayr of near Paris prG m Subject The Quiet Ways of Gods back.
yJnXIS' to tlie ave several years Providence." (Consecration Meeting.,.
mm TYnlnK XTioo Vrnnnna TJoX1j- TU MUST BE W I ! I I M Ci Trt trifiUT
o- lutuuti, luioo iuiiv,w iiauv,in.a. luc ......w . w . .I.i , . . . .
The funeral will be held at the fam- general public is extended a cordial in T0 BECOME NATURALIZED j ?na Wfiere error exists prescrib
ilv home at two o'clock this afternoon, vitation to attend all these services. , . .. . j 1PR glasses that will bend the
The time is almost at hand for the th services conducted by Rev. Geo. T , ,. """"u""V5 i"iJn"u"?"1n ras ot "Rt SO they Will foCUS
. . ., .. ... . TT TTrriQ rfnr nf 5t Pnfor' Tnicnn. lu uuwliuu itu uio mayer uayo Duum ue leiuseu VJ iippilCaUlS
Rgicanon ex
Clean-up" campaign
so successfully carried
this and other
tncky in years
ai well as y
lend a hand
amd outdoors, clean during the "Clean
ttp and Paint-up" campaign, and to
se that it is kept clean thereafter.
borne, much improved in health.
"FAINT UP AND CLEAN UP."
Optometry
Pronounced Op-tom-e-try,with
the accent on the second syllable,
i the SCIENCE of measuring
tne retractive media of the eye,
tho annual "Piint-im in.i H. Harris, rector of St. Peter's Episco-1 .. t " , " I . . i,i i,n ,Zimnl macu w appuuuih upon the retina ot the eve Stim
tne annual amt-up ana . I un ullr!n1 ,:ii fn. 'meeting to be held at the Christiabhxho are unwilling to fight for the ,. a , V '
jnpaign, which has been Pjl fUT.c The burial will follow in church5during the week of r the Ut .-ted stes we-e given by Judge bating Ire rods and cones, re-
forward
the Paris Cemetery. The pall-bearer.
in
nfiac nf Pontril Trot, 111 UC UltSSlS. . UlCLLC U UtlilCl . Odlll ...
wura WL """o't A" .,. t ,-.., . ..., monthly meetinc on Thursdav and tlio.j
na5t. "Evervbodv old p-Jtay, James oucKner, rnos. isucKner, - - ,-., oruer
' - . i , v . n in. mum irv on nnnu i
nnnir will hp n;kPfl in ! Brice Steele, Ben wooQiord, Jr., wm. . ". A " , J ,7, , t ,
oung, -vsill De aSKea to whp.n thp. TCnstpr nffprinpn will ho tnkpn
j -i i- 'I' wnrnmi nnn Hnhv nv ,.
io Keep property, maoorsp- and the new members will be received, wmilrt
I m a vr rT .. w .
, HJV-4 TT..U., m.,.. . . .". PfA , A,,U ..J..' J. 1
Mission Circle will hold their regular ,tei! t "ltJ, uiiiieu states uisinct uii.ib .ui visjuii lu normal.
. . . 'i.nnrr.. n.r. r. i-nniq I'lipqrinv iin tuia v'a nvn rrvor i. ,,. -f .uz cm
first papers were refused to "RNrTF?. unrl octiqmqII,. ;; .,
Joseph Gandil, who said he had" two ii i SJ1 .. -e i y
inn v 1 -.v . M TJ? 1
brothers in the German armv and ucr d1'" u .Ub ir yu navS
not be willing to fight against "0U0p With faulty Vision. Con-
A.11 women of the church over eighteen Germany, but would ko back there ir SUltatlon free.
The runeral ot Mrs. Hannan Dun- years of age are cordially invited to at he could.
can Taylor, who died at her home on 'tend these meetings, and in hecnniP. It is easy to think and not decide:
A trip through this city would pleasant street, about six o'clock, .members , of the Circle and Auxiliary, i1- is easy to decide without thinking
kow many streets, yards and open Wednesday evening, was held at the ' ,but if Js ot always easy to think and
Dlaces that are littered with the win- rpMonn. nf i,rpp vinM- vpstpr.inv' ine nnsuan n,naeavor society oi aecme arignt.
ter's accumulation of waste and rub afternoon, with services conducted by the Paris Christian church wi meet
Wen, and are unsightly and unsani- Rev W E Ellis pastor of the Pari in the church 'Parlors at the usual hour,
tary. If these are the conditions, out- christian church.' The burial on the 6:30 ,cIock Sunday night The ub
Jrvw PYnnsPd tn vier. ivhat. must ho e ti it- : n,n -d : n,f-., . Ject for consideration will be "The
.., ..x- w .. .., .. Laiiuij iui in liic i ai 10 vjciucicij vu.n
Get Your
Easter Dinner
From
N'S
Sanitary Market.
IflRGOLt
Lamb, Veal,
Yousig Pig Eoasf
and Fancy Beef
A FuJI L5ns of
Fruits and
Vegetables "
CALL UP
the conditions indoors, in cellars, at- private. The ipall-bearers were Geo.
Quiet Ways of God's Providence.
FRYE & FRANKLIN
Doctors of Optometry !
Dow Bide., opp. Windsor Hotel j
JMRGOLEN'S
First Class Meat Market
tfcs and passage ways and in little out- vt rpII nnnnan RpII Tamps p.hnmhPrR Miss Etnel Harper, leader. The C. W
of the-way places where dirt and filth George W. Stuart, James O'Brien and,B 1S,I-?;uxliliariy1 a,nd f Youn& w.f
can be conveniently hidden for the Amos Turney Sr .mens Mission Circle of the church will
white. Mrs. Taylor was the widow of ihe'??86 th week or prayer, beginning
It is hardly necessary to dwell on late Mr. William Taylor, who for many Monday and ending Friday. Prayer
these facts, as all of us know there is vears resided on the suburban prop- eU& Y b(Lhel? at e church aJ
great need for a thorough cleaning erty at the junction of the Maysville -'." " ""?."" v" " ,
vn. and that vp Klinhl trvtn mnlrp mirL.i x,.f, Tf?,iiTr-,. iroc iofa. lrilulJ' ancuiuuu
living habitations more sanitary and j owned by Mr. M. B. Lovell. She --vas
better places to live in. We should 'one of the best-known women in Paris.
try to make things around us mor
"beautiful, and strive to make better
"working and living conditions for ev
eryone.
A "Clean-up and Paint-up" campaign
(mot merely a week) will serve to re
jnlnd the general public of the impor
tance of this work. It will result ii
verybody taking hold and making a
sore thorough job ot it Experiences
la other places where such campaigns
have been held indicates that after
campaign is over property-owners anj
more apt to keep things clean than
iras the case before the matter had
.been brought to their attention.
CHANGE IN HANDLING FIRE
INSURANCE POLICIES.
Xracal agents of fire insurance com
panies have received information to
the effect that, beginning May 1, a rad
ical change will be made in routine o
handling fire insurance policies in this
State. Heretofore insurance agencies
.to the smaller communities hav
-ihandled their business directly with
ompanies, while in Lexington and sev
aral other cities the policies have gann
through a stamping office, in which the
-folicies have been scrutinized as to
Tates and other technicalities.
Hereafter all the work of the several
(imping offices will be done in Louis
rille under the direction of Mr. G. H.
There will be no
services held on Tuesday.
and was a representative of one of the
oldest families in Paris, being a daugh
ter of the late Mr. and Mrs. Jerre Dun
can. Ker parents reside'1 on what was
the old Duncan place, occupying the
space between Duncan avenue and the
Dresent residence of Mr. E. T. Hinton.
then the old Paris City School. Mrs.
Taylor had been ill for several months
from a complication of diseases.
Mrs. Taylor is survived by three
sons, Messrs. William Taylor, Louis
Taylor, of Paris, and Duncan Taylor,
of Los Angeles, California; two sis
ters, Mrs. Winnifred Duncan Ford,
widow of the late Mr. James K. Ford,
md Mrs. George R. Bell. Another in Judge Wallace's court, in the case
sister, Mrs. Kate Chambers, died in' of the Commonwealth of Kentucky
this city several years ago. Mrs. Tay- against the Kentucky Children's Home
lor was a niece of Mrs. Thomas Henry Society and George L. Sehon, superin
Clay, Sr.. and of Misses Winnie andtendent of tne school.
Lou K. Williams, of this city. "The amended petition states that a
STATE RAPS MANAGEMENT
OF CHILDREN'S HOME.
Owing to the fact that the people of
Paris have a personal interest in the
Kentucky Children's Home at Louis
ville, "the fallowing special, from Lou
isville, which appeared in the daiiy
papers of Wednesday, will be of Inter
est here:
"The appointment of a receiver to
take charge of the affairs of the Ken
tucky Children's Home Society is ask
ed by the Commonwealth of Kentucky
in an amended petition filed Tuesday
DRESS UP WITH
She had been a member of the
receiver is asked, in order that the
Christian church her lifetime, and was j salary list of the home and other ex
always devoted to it. The writer re-'Penses not necessary to the proper
members that in his early days the management of the home may be re
love and devotion of Mrs. Taylor and
her sisters was always held up to him
as an example of family unity. They
were almost inseparable in their com
panionship, and it was a rare sight to
see one without the other.
GETS PROMOTION.
arker,
The. Maysville Daily Independent of
manager of the Kentucky Tuesday, says: "Mr. William Lundrl
duced, and to provide for the proper
maintenance and education of the chil
dren until suitable homes may bo ob
tained for them, and for the purpose of
carrying out the aims and objects of
the society.
"The amended petition charges that
the provisions for the maintenance
and education of the children in the
Home, maintained by the Kentucky
Children's Home Society, under Super
intendent Sehon, have been worse dur-
Actuarial Bureau. Miss Margaret gan, r., better known to his friends
Ryan, who has been in charge of the as "Bunnie" who for some time has mg the present year and are now worse
Iixiagtoa stamping office, will be 'been employed in the local L. & N. than at the time mentioned in the
transferred to Louisville, with an ad-freight station.1 left yesterday for Paris, original petition. It charges that the
Taaoe la salary, and the office at Lex-? wneie no wm euier upuu ms neworne now contains zb cnnaren ana
fcagton will be closed. j duties as brakeman in the Paris
The change will cause some delay in yards. This is quite a promotion for
the delivery of policies to the insured,! Mr. Lundrigan and his many friend.
hat the chief advantage to the com-congratulate him and hope for his
paniee is that it will insure the check continued success."
ing over of all Kentucky policies at' '
- nAntMl nfKsa Tncnraiipp mpn Hiv .''- CH3 I Ltt CVaVa nuULllMU
WHO vtuuia viv. .jww w rf
that the new routine will tend to a,
greater care on the part of the agents.
The change follows the adoption of a
AT THE WHITE HOUSE.
that it is overcrowded, unsanitary anfl
unwholesome. It charges the children
have not been adequately clothed dur
ing the past winter to permit the
proper outdoor exercise and recrea
tion." Mr. Geo. Sehon, the superintendent,
is well known here, where he has fre
quently visited. Mr. Sehon was a guest
r I i ' w rT
fl 1 I V tl M V V 1
It wMJw)
I lf uj& y
Mil
wii AND CHII DRFN - whi
WJL At ONE-HALF the Price You Pay Elsewhere! 1J!
ImA j 0w Method of Merchandising Cuts Your J
I nN&'i r Shoe Cost! Experienced shoe men buying x 1
1 vU' 1 ! n unmite( Quantities for our large chain of y.
1 va (j II stores for spot cash assures you of the best wtmh
ik Tfi II in shoes at lowest possible prices. 7 W
ISP J) J AJ PfJTTtlsj flJ I
J8L UJxIS y J Jtl Jj, 1
tfijlk PARIS, JY. (
V v l JrA
vhii
i ?ki JluW III
WJt
iive ftlffWk
W
The largest and most complete
display of beautiful Easter Foot
wear ever offered now ready
for you. AM the new novelties
in white, grey, Russ. tan and other fashiona
ble shades, as well as th
slyl
IQ
UV
more
conserv
Egg rolling within the White House LnTnftHmft an of friends in North Mid
. - .C i it. erounds on Easter Mondav. at "Wash- ,.. , j,. -r
w series or unuorm lorms oy mu - ' -- jaieiown. several cunuren irom coui'
Actuarial Bureau and the State Rating g?a' custm f; s d af the bon county are in the Home at Louis
... TAliit-Q TTniico iTcolf ri'ill Via ohqnilnnorl
Bowd, which will be put into effect on ".. "wl r 1 Vi" ,-"" "rJ "
Aril 2
this year because ot the international
situation, and the grounds around the
In a New York divorce suit a Sal- Washington monument with be used,
ration Army captain has been named Under the present rule policemen keep
xm ee-respeosKtent And his army is all unauthorized persons at a distance
9tW Ji oil ting 'hallelu jab."
.from the White House.
The West Virginia lady who will
give tor husband a divorce if she gets
the-parrot evidently intends to leave
J him without a single remembrance.
t-'
,d
4
1
4
W
V
,
jM'
- f