THE BOURBON NEWS, PAJHSrKY.
TUBSDAY, APJHE U, lfll
fAGK EIGHT
i
I
4
4 II II 1 1 1 1 1 1 1 1 1 1 1 1 1 1 i 1 1 1 U 1 1 H H 1 1 1 1 1 1 1 1 H 1 1 1 1 I " neer Talley's engine, and an hour after 'tax. Senator Huntsman desired o
T nis chiefs death was r mb .... ,., .-, -
nfnni ., ... " war to striKe inis provision irom tne Dill, but
Cincinnati with the train, which left, Ms amendment was defeated.
i wi, f i hi ' . j I 'Tne Schneider race track bill, impos-
I - lu"Ci" wu do Kneici in St.
I Mary's Cathedral in Covington at
nine o'clock this (Tuesday) morning.
Hue interment will follow
Mary's Cemetery,
War Orphans!
t
in St.
Servfpps wow v.ti.i I i . it. tt
iw fi, o, tr 'i...,'.; . r "wujea uy iue nuuse.
., wm ttcuiuuaj xjuyai uraer of
ing a license tax of $500 daily on the
Louisville and Latonia race tracks and
$200 daily on the Lexington race tracir,
as amended by the Senate, was pass
's I fcmeers ami
Spall-be? vers.
conductors will
act as
t
1 mn
'uaxiujmlujniajl.
According tO local papers, France is allowing Jj Moose at the Tally home on Latonia
. .. o n f omfcnonpo nf pQrh wrnmn $. avenue, Sunday night. L. & N. en.
Think of the little ones who meet YOU when YOU
. !
return home at night, being placed in the same cir- J
cumstances; their under-nourished little bodies; their $
craving for food because our Government could
allow each one only ten cents a day.
True parental love could provide against this J
by adequate insurance. Think of what a small
monthly income policy would have done for the or-
pbans of France, and will do for your own children
should they become orphans.
R. F. CLENDENIN
Associate General Agent The Northwestern Mutual
Life Insurance Company
Cumb? Phone 37; Home 72 Residence, Cumb. 352 f
f201 FIRST NATIONAL BANK BUILDING $
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 l-l"1"Tt T'T,,T',T"T',,"t'"T"T"T"T'","T"T"T"t',T',T,,t,,T,lT ' f-T'-T'-T'-T-TTTl
TAYLOR TATE.
Mr. Walter Tate, a prominent res
ident cC the Shawhan vicinity, and
Miss Maude Taylor, of Denver, Col,
were married last week at the home
of the bride's brother, in Oklahoma.
CUTS OUT SCREEN
ADVERTISING IN MOVIES.
MILLERSBURG
;
' DEATHS.
HITT.
Mr. jl G. Allen and Mrs. Clara. The funeral of Mrs. Susan Hitt,
Shanks are improving slowly. aged sixty-eight, who died at eight
Mrs. Katherine Davis Craig was a o'clock Saturday, after a long illness.
. guest of Mrs. Porter H. Nunnelley, in resulting from paralysis, was held at
Georgetown, Friday. Foster Chapel, near Mt. Olivet, Sunday.
-Mrs. J. T. McClanahan has return- Mrs nitt ,d and , sur.
'hf hHvTanrfs S vived b two daughters, Mrs. Janie
at'Yiit to relatives in Paris. . J
Mrs. Minnie Hurst has returned Linvillo, of Robertson county, an-J
from a visit to her parents, Mr. and Mrs. James A. Snapp, of Bourbon
Mrs. Edward Cochran, at Elizaville. county. The family formerly lived in
Mm. Raymond Frizzell, of Paris, Robertson county.
was a guest last week of Mrs. Mollie
Daugnerty, at Switzer, Scott county. YOUNG.
Mrs. Charlton Alexander has re irs Agnes Atkinson Younc,
turned home from a visit to Mrs. Josie wjdow of tne late Prof c E Young, a
111 Farris, at "Maple Hill," near Ver- former well.known Paris educator,
-" w- r- ,i i,nr0 died last week at the home of her
' Paris' have returned from a visit to daughter, in Greensboro, Alabama, af-
'lirs. Jack South, at Switzer, Scott ter a short illness. Mrs. Young, who
aunty. was n ner seventy-sixth year, had
Mr. M. E. Pruilt and family have been visiting at the home of her
returned from Stanford where they at- daughter, Mrs. Georgia Hollings worth,
tended the funeral services of Mr. Pru- ia Greensboro, and up to the time of
itts father, rma. her death, had apparently been in her
Mrs. Maoei iwuruiey aiiu. . ". , . hpalth
M Caldwell spent from Saturday until usual &0d wealth.
Monday with her parents, Mr. and Mrs. Young will be remembered by
Bailes DeBelle, at Ewing. tae PePle & Paris w" knew her
j j, c. Leer, while in his new prior to 1884, when she was associ-
automobile, ronding the curve on ated with her husband in the conduct
South Main street, Friday, collided of a perparatory schbol for young
-!7ith Mr. Isaac Furman, who was m women, in the residence on High
Iris buggy. None of the occupants street now occupied by Mn Jos w
ere injured, and one fender of Davis
3r. Leer's machine was slightly dam The remains were taken to her oW
The 'cadets of M. M. I. mt on the hme Staunton, Virginia and In
beautiful three-act comedy drama Fri- tered by the side of the body of her
day evening at 8 o'clock at the M. M. I. husband. She is survived by her
Drill Hall. Notwithstanding the in- daughters, Mrs. Bradford Noyes, of
clement weather, a good audience was Charleston, West Virginia; Mrs. Chas.
present Th& play was full of humor Bidgood, of Wilmington, North Caro
and each one did his or her part per- lina; Mrs. Georgia Hollings worth, of
Xectly. , ,. p . Greensboro, Alabama; and two sons,
Tour of the World The -ladies of Vn nn( .... Yn.,;
the Methodist church will conduct a TC1rlesf E'Unf andwRofe. ou.ns'
"Tour of the World" on Thursday, both f Charleston, West Virginia.
A'pril 20. The parties will start from Mrs. Young and her daughter; Mrs
the park in the afternoon from 3, 4 Noyes, were guests about two years
.and 5 o'clock. Tours will be taken in ago of Mrs. Thompson H. Tarr, at
automobiles to the various countries her home on the Georgetown pike, near
represented, and refreshments typical pariSf here they had a hap,oy re
el, each country will be served at each union in meeting manv of their fViends
slop. Those wishing to do so may go .
w. their own machines, but trans.porta- OL uie IOI1k as-
tion will be provided for all. Tickets,
zdnlts, 50c; children 12 years of age ",
and under 25c. While getting ready to take out his
' train on the regular run from Lexing-
TWO NEW4INTERURBAN ton to Cincinnati, from the Union Sta
CARS ARE PURCHASED tion in Lexington, Saturday morning,
Edgar B. Talley, aged fcrty-seven,
The Kentucky Traction & Terminal dropped dead.
Company purchased Friday two double- Mr- Talley was in the trainmen's
end interurban cars for usi on its in- room ia the basement of ,the station
terurban lines, especially to permit an vhen the sudden summons came When
increased service between Lexington he reached the station a few moments
and the mobilization camp. before his death he was apparently in
The new cars were purchased from nis usual good health and fine spirits
a. Columbus, Ohio, Comnany. The and had just begun to get into his
will be put into immediate service, overalls for his day's work when he
After the departure of the soldiers was stricken. His fireman, R. C. Pep
these cars will be used on the Paris- Ps, and Dennis Minogue, both of
Lexington and the exington-Ver- Paris, were standing only a few feet
filfe Frankfort lines. .away. They stated that Talley sank
M to the floor without a word and ex-
FORMER PARIS MAN HEAD pired almost immediately.
OF BIG INSURANCE CO. Engineer Talley has been in the em-
ploy of the L. & N. for about thirty
THE NEWS has received a copy of years. For many years he was a Are
tha Pittsburir. Pa.. Chronicle-Tele- man, but for more than twenty years!
. - -- .
graph in which appears a half-pag3 he had been running as a passenger!
. display advertisement of the Pittsburg engineer between Lexington, Paris and
Life and Trust Company. The fea- Cincinnati. Paris railroad officials said
tare of the advertisement is the an- he was one of the best engineers in
nouncement as follows: the .service of the company and his
"The Board of Directors of The long service with the company indi
Pittsburg Life and Trust Company cated that his services were satisfac
ta.kes pleasure in announcing that Mr. fcory and duly appreciated.
Frederick A. Wallis, of New York He was a member of a well-known
City, has been elected President of Virginia family, and had been a resi
the Company. The Company now dent of Paris at different periods dur
vfcas Insurance in force amounting to ing his career as fireman and engi
over $118,000,000 and assets over neer. His home was in Covington, but
$24,000,000." his run necessitated spending his
.Mr, Wallis is a son-in-law of Mr. nights in Lexington, as his train came
and Mrs. Thomas Henry Clay, Sr., of in late in the evening and returned to
Paris, having married Miss Nan- Covington the next morning,
iine Clay some years ago. He was . Mr. Talley is survived by his widow,
im business in New York several years j who was Miss Nellie Coughlin, sister
as General Manager of one of the of Edward and Mike Coughlin, and
largest insurance agencies in the Miss' Jiary uougnun, or aris; tnrec
metropolis, and was at one time fa-j daughters; one son; and one brother,
rorably considered for the position of Mr. Waddy Talley, of Richmond, Va.
Stat Insurance Commissioner of New .They were notified of his death. The
York. Mr. Wallis owns and manages (body was prepared for burial, and sent
a fine farm, near Austerlitz, a part of to Covington at 2:35 o'cclock Satur-
tkft Clay ertate. where he spenaa aay atcernoon.
Fireman Pepples was commissioned
Mr. E. H. Husley, proprietor of tho
Queen and Zoe theatres in Houston,
Texas, and owner of moving picture
theatres in Dallas, Galveston and
Waco, Texas, has abolished all screen
advertising, with the exception of an
nouncement of coming attractions, in
all his houses.
"The revenue we derive from these
advertisements did not justify us in
forcing patrons to sit for several min
utes while we told them where to buy
pickles or petticoats," said Mr. Hulsey.
We discovered that theatre-goers
went to playhouses to see pictures and
not read what some firm had for sale,
or wanted to describe. We concluded
that newspapers are the proper medi
um for advertising and that we
should not force such ads on our pat
rons who assembled to be amused
entertained or instructed, and not to
be forced to read or look at something
entirely extraneous."
This action taken by Mr. Hulsey is
strictly in line with what has been
done uy moving picture theatres in
all the larger cities. Screen advertis
ing is considered an indication of a
country town where theatres must de
pend upon all sources of revenue in
order to make expenses.
Thero is no doubt that the patrons
of the Hulsey theatres appreciate the
action of that enterprising gentleman
in depriving himself of a few dollars
in order to better serve those who go
to see moving pictures and not to
be informed that some one sells beans,
buttons or bicycles.
BILL TAXING LIQUOR
PASSES THE SENATE.
By exactly the required vote, 20 to
13, the Senate, Friday passed the
Squirner bill, fixing a tax on spiritu
ous and vinous distilled and sold in
Kentucky. "
As amended by the Senate Revenue
and Taxation Committee the bill pro
vides for a tax of two cents a wine
gallon on every proof gallon of dis
tilled spirits, known as double stamps
spirits, distilled in Kentucky. It pro
vides for an excise itainp tax of twene
cents a gallon of spirituous and vinous
liquors sold at retail in Kentucky.
The bill provides that if liquor id
found in possession of a person in tho
State without the stamp tax, even if
the liquor is for personal use, the
possessor of the liquor must pay the
SUBSCRIPTION
DANCE
AT
Varden'sjHall, Paris, Ky. '
ON
Thursday Night,
April 26th
Music byMontague7s Saxophone
Trio, of Lexington.
TICKETS, $1.00
MflRGOLEN'S
SPECIALS THIS WEEK
Home-Killed
Meats
Beef, Pork, Veal, Lamb.
Seed Sweet Potatoes
(Strausberg and Bermuda)
AETNA
Automobile insurance
Company
Fire, Theft, Collision,
Liability and Prop
erty Damage
ETNA AUTO SERVICE
Presenting an Aetna Auto
Identification Card to any agent
of the Aetna in any part of the
country places the agent's ser
vices at your disposal in the
event of your having an accident.
The largest company in the
United States writing auto in
surance.
A. J. FEE, Agent.
Paris, Ky.
Coming
Attractions
PARIS GRAND AND ALAMO
TUESDAY
Miss Christioe Mayo
In Person
"The Vampire Woman"
Miss Mayo will appear at each show
afternoon and evening when a feature
starring her will also be shown
Robert Warwick in I'Heart of a Hero,"
World feature. Charles Richman and
Dorothy Kelly in
"The Swamp Adder"
9th episode of "The Secret Kingdom.'
WEDNESDAY
Famous Players Featur
ing an All-Star Cast in
"The Martyrdom
of Philip Strong"
Also Burton Holmes'
Travels and Bray's Car
toons. THURSDAY
June Caprice in
'The Mischief Maker'
Fox production. Also
Hank Mann in "The
Cloud Puncher," Fox
comedy in two parts.
Hours-Alamo, 2 to 5:30; 'Paris Grand,
7 to 10;30, Admission 5 and 1 Oc.
tittr
Conservation of
Eye Sight
Is the Practice of
Optometry
By intelligent methods of eye
examination, for the purpose of
furnishing thq right kind of
Glasses when needed.
We Practice
-Optometry.
Call or Phone Us.
FRYE & FRANKLIN
Doctors of Optometry
Dow fildg., opp. Windsor Hotel
HIGH GRADE HOUSE 5 SIGN PAINTING
Interior Decorating
Hard Wood Finishing
WALL
PAPER
PAINTS WINDOW GLASS
EAGLE and DUTCH BOY WHITE LEAD
SHERWIN-WILLIAMS MIXED PAINTS
BERRY BROTHERS and PRATT & LAMBERT
CELEBRATED VARNISHES
"The Best," Our Motto
C. A. Daugherty
Paris, Kentucky
Fifth and Main Streets
i
Largest Selection Of
Spring Footwear!
All the New
Novelties,
The Latest
Creations of
en's, Women's and Children's
Boots, Oxfords and Pumps!
In white, grey, mahogany brown, black kid and other fashionable shades, as well as
the more conservative styles., Owing to our system of merchandising in advance and in big
quantities, we are now in position to offer to our customers the highest quality and the
most stylish Spring Footwear AT PRICES LESS THAN THE PRESENT WHOLESALE
MARKET.
Just a Few of the Many Styles and Their Prices:
v
J
Ladies7 White Kid Most Fash- c
ionable Boots at 20W3 lip
Ladies' White Cam. Sea Island eo ttia
Polish Boots :fr-5J5J
Ladies' Rich Brown or Russ. Tan
English or French Heel Boots
Ladies' Kid Lace Boots and
Pumps which add grace to your
foot
Ladies' Pat. Dull Kid eo QQ co AQ
Boots and Pumps at. . fciw-Ai!
Ladies' Pat. and Gun Metal Shoes - 0L
and Slippers at . . U5J
4.95
3.49
Men's Russian Tan English M
Shoes and Oxfords, W.-0...$4.50 Up
Men's Plat. Calf English and Me- - -
dium Toe Shoes and Oxfords. . . . $4-00
Men's Gun Metal and Tan Shoes ,-.
and Oxfords, Walk-Over 3.50
Men.s Gun Metal, Button and 0 At
and Lace, good quality 2.99
Men's Tan Lace Oxfords -
at 2.49
i
Men's Gun Metal High Shoes and ,-
Oxfords 1.99
Special Prices This Week,
tt of his Yuoa (Miring tne sum-
ar aoatiuE.
to temporarily take charge of Engi-
Boys', Misses' and Children's Shoes and Slippers At
ONE-HALF THE PRICE YOU PAY ELSEWHERE
DAN COHEN
Paris' Greatest Shoe Store
Where Beauty and Economy Reign
nrM rmo z
.. . m m. w ii
firm n ii rm if .-
fall II ml 11 f - I 1 ' - - ' - -
l m MM II m LJ f mmt ! 1 tF w FwwWwwWWWwwWWwwwwwwwwwwrwrrrw ''vvWWWWWWVWWWWWP H
r
4
k
- r i i m
- .- , v - m