PAGE EIGHT
-the bourbon news, park; ky.
4
TUWDAY, JANUARY 1, ItlT.
t
i
- ture. On Thursday her condition lie-
W VCfcAlV oOiXVUOt xa. u axucu UUIOC LXVftU
4
MILLERSBURG
Lexington was sent for and she grew
. tvorso from this time until the end,
"which took place about 7 a. m. Friday.
Mrs. Vimont was about seventy years
Mr. R. M. Caldwell was the guest ot asfe, and was one of a large family
Saturday and Sunday of Mr. and Mrs. o children, all of whom have preceded
W. V". Hutchison, at Nepton. her to the grave, except one brother,
Mr. Julian Allen and sister. Miss Mr. Henry Letton, and one sister, Mrs.
Xargaret, spent part of the Christmas Nancy Patton, the latter of Carlisle,
bxtffdays with their grandparents, Mr. One brother, Mr. J. H. Letton, died
d Mrs. Enhriam Wood, at Stanford, about a month ago. She was united in
Mr. A. T. Hillock has resigned tec marriaSe riy m life to Mr- Jefferson
position as sexton of the Millersburg M- vimont and bv their umon tnree
Cemetery, his resignation to take ef- children were born one daughter. Mrs.
feet as soon as someone can be secur- a B: J' 1SB' UF' I' VJ1'
ed. Mr. HiUock has recently nur- mont and Mr T' Vcnont- the latter
ckased a farm in Mississippi, and with h?yins Preceded her to Che grave about
his family, hopes to move there about ee years ago, while her husband
Feb. j passed to his eternal reward scone thir-
', , , A. , ,, . 'teen years ago. Mrs. Vimont was j-
Z r fn?J,alTelectl0tt i ??"- devout member of the Methodist
cere of Amity Lodge was held Wed- church and was interested in all re
nesday evenine. and was preceded with ligis meetings. She was a liberal
an elaborate banquet at 6 p. m Not- contributor to all church funds, and. in
wthsanding the inclemency of the fact to every fund wllich was for the
veather, a large number of the breth- upbuilding and the betterment of hu
rea were present After die banquet jty. she belongs to one of the
a smoker was, enjoyed for half an historio families of Central Kentucky,
ll0Ur;J'fter. Wh!fh Master called and ner entire life has been sjpent in
the lodge to order and the following and around Millersburg. Just before
officers were elected: W. M V. L the death of her hugbarld they pur-S0;118:-'
chased the home she occupied at the
? ?J?rSfi'.VVTLBailnetin?)' time of her death, and has resided
J r ' M B(leJ' (D' E- CIaie there ever since. She was one whom
retiring,) Sec, P. E. Peterson, (O. H. to know was to y and her beauti-
Collier retiring,) Treasurer, S. M. ful christian character was manifested
Allen, by an almost unanimous vote, in her everyday life. The funeral ser
having held the office for a number of vices were neld Sunaay at 1:30 p. m.
years. The committees and stewards at the Methodist church, conducted by
-will be appointed at the regular meet- ber former pastor, Rev. B. C. Horton,
In on Tuesday evening, at which all of Richmond, whom she loved and ad
tke members are requested to be pres- mired. interment in MiliersLurg Ceot
GU ' etery. Six of her beloved nephew s
The follow ing is a continued list o" bore the remains to the last resting
those who spent the Christinas holi place, where she now sleeps bnath, a
days 'with relatives and friends here: beautiful bower of flowers
Messrs. L. T. Vimont, of Newjport, W.
3C. "VTinint, of Maysville, and sister,
Mrs. Munsing, of Maysville, with their
tii other and sister, Mrs. Martha Vi
monU and daughter, Miss Florence;
Miss Stella Stirman. of Ewing, with
her aunts, Mesdames S. H. Bndicott
and M. D. Hurst; Misses Edith and
3Targaret Wood, of
STATEMENT OF COND ITION OF THE
Paris, Kentucky
At the close of business December 30, 1916.
and Mrs. W. li. Pinnell, at their home Messrs. Rolla Farris, Ffen-y Thomp
near Winchester. son, Stanley McClintock, of Millers
Miss Kate Alexander, of Paris, will burg; Mr. Basil Hayden, of Paris,
attend the fifth, anniversary of the Miss Grace McCord has concluded
Central Union Life Insurance Com- a very pieasant visit in Corbin, Ky.,
pany, whicji will be icelebrated wnere sttio was the guest of Miss Jes
witfli a reception for all of its agents, sie wortham. Miss Worthata return
at Lexington, on January 29. ed witn her aud will be Miss McCord's
Messrs. Edgar Vansant, Duke guegt for several days. Miss Eliza
Brown and James Clay Ward, who betIl Clarkf who hag also been a guest
have been spending the holidays in 0f Miss Wortliam; returned with them,
this citv and countv witih their Dar-
ents, left to-day to resume their stud-j One of the (most enjoyable social Loans and Di8CounU 166,668.96
ies at the University of Virginia. 'events of the holiday season was the Overcheck 553.63
I Miss Charlina Ball and her guest, annual Christmas subscription dance -,asn 19,847.9o
Miss Gretchen Landen, of Omaha, 'riven at the Masonic Temple ballroom iwe from Banks 19,327.5 7
. Neb., who have been at the ihome of iu tliis' city, Wednesday night, promot
the former's parents, Mr. and Mrs. ed by Mr. John W. Stuart. There va:.
Farmers & Traders Bank
RESOURCES
(Furniture nd. Fixtures .....$ 2,400.00
;C. A. Ball, near Paris, during the hoi- a large number of visitors from out-oZ
'iday, returned to Hamilton College at town, and a large attendance from the
I Lexington, yesterday, to resume their city and adjacent territory. It was es-
studies. timated tihat about two hundred were
Mrs. L. B. Keal entertained afam- present. The hours were from 9:30
ily gathering with a New Year's dining p. m. until 3:30 a. m. Music was fur
at her home. Those present were: Inished for the dancers by the Free
Mr. and Mrs. John M. Woods and Mr. man Orchestra, which is filling an en
and Mrs. Wallace M. Woods, of Win- gagqment at the Alamo and the Pari3
Additional Personals.
Chester: Mr. and Mrs. James R. Sti
vers, Mr. andMrs. Arthur Burley, Mr.
R. P. Stivers, of Paris.
One of the most delightful gather
ings of tine holidays was the luncheon
given Saturday at the Phoenix Hotel,
in Lexington, by the Chi Omega frater
nity in honor of the members who
were there for the holidays. Among
the guests were Misses Mary Fithian
Hutchcraft and Miss Helen Hutchcralt,
of Paris.
Miss Willie Wilmott, of this city,
was one of the guests at a family din
ner given last week by Mr. and Mrs.
J. H. Gaines, at their home near
Hutchison, in honor of the bridal party
of their son, Mr. Allen Gaines,-whose
marriage to Miss Madge Miller, of
New Albany, Indiana, was celebrated
last Wednesday.
Mr. and Mrs. Thos. C. Whaley had
as dinner guests recently Mr. and Mrs.
Hnmffan Wood, of Mt. Sterling: Mr.
Grand. It was impossible to secure a
complete list of those in attendance, as
Imany of the participants left before
midnigQit. In the intermission a de
lightful luncheon was served the
guests.
The following young ladies were
present: Misses Jane Adams, lionise
Wood and Alice Williams, Frankfort,
Marion Moore, Caroline Elkins, Lil
lian Elkins, Evelyn VanMeter, Lillian
Julian and Unice Wilson, Lexington;
Mary Nell Finnell, Bessie Finnell and
Cornelia Blackburn, Georgetown; Te
vis Young, London; Elizabeth and
Bessie Allen, Millersburg; Gretchen
Langdon, Omaha, Neb., and Elizabeth
Brown, Francis Clay, Catherine Wil
son, Caroline Roseberry, Matilda
James, Anna Louise White, Charlina
Ball, Nell and Elizabeth Crutcher and
Rachel Wiggins. The chaperones were
Mrs. Mary Ireland Davis, Mrs. John
James. Mr. and Mrs. C: A. Webber,
and Mrs. Wm. R. Martin and Mrs. j Mr. and Mrs. James H. Thompson,
JWelburn Ammerman, of Cynthiana; iMrs. J. F. Clay, Mrs. Kate Wilson,
Mr. Lyman Petree has retum,pi to
Brooksville, and his home in Lexington after a visit to
Shrapsburg, at Jiome; Miss Kitty Bur- his cousin, Miss Margaret Petree.
berry, of Centerville, with her eousin,. Mr. and Mrs. James McClure had
aftes Mary McDaniell; Mr. Brown, of as tJieir guests during tflie holidayd
Cyatliiana, with Miss Christine Pattei- Mrs whitehead and Mrs. Eginton, of
m;- Mr. Albert Prather, of Mt. Olivet, Winchester
with Miss Nancy Whaley; Mr Chas I f IIunUngtm West
Carrington, of Reverence with Miss Myrick. of Fulton,
Kuie Mar McDamell: Mrs. r. reb g
Stokley and daughters, Misses Maude , rfapriR
aud Clara, of Cynthiana. with Mr. and Joues' neaTrT 1S , , ,, . tJ
Mrs. ft. L. Hill; Mrs. George Jeffrys r5 H- Baker, ot Springfield,
and little son and daughter, George and Mo., and Miss Linda Martin, of Annis
Irene, Lexington, with her sister, ton, Alabama, are guests of Mr. and
Mrs. Mabel Courtney; Miss Eva Hen- Mrs. J. T. Martin, on Main street,
dersoni of Harrodsburg, at the M. C. Mrs. Carolyn Erdman, of Lexing-
is a guest of Mr. and Mrs. C. A. Web
Our town and community was some- her and daughter, Miss Mary Kenney
-vrh&t started on Thursday when it was Webber, at their home near Paris,
learned 4 that Mrs. Lavina Vimont was Rev. and Mrs. W. E. Ellis have re
critically ill at the honie of her son, turned frcn Louisville, where Rev.
Mr. Letton Ylthont Mrs. Vimont had Ellis attended the Forward Movement
gone fcof Ihe rhome of her son several banquet given at the Seelbach Hotel,
days betore tlie Christmas holidays to Mr. and Mrs. Clark Petree have
spend OhrlBthias there. She had a as guests at their home on Vine street
Wee cold at tne time of leaving home, Messrs. Jay Petree and Herman
Trat little wi thought of this. On Schulte, students at the University of
"Wednesday ine was partially paralyz- Cincinnati
ed, and hefteart action became very Mr. and Mrs. James Arkle, Miss
frjcL She had been suffering from Nannette Arkle and Mr. Fitihian Arkle,
fee&rt tromble for sotme time, though it Mr. and Mrs. James Pinnell, of Paris,
Traa not thougit to be of a serious na- were guests at a dining given by- Mr.
Mr. H. Clay Whaley, Misses Princess
and Lena Whaley, Mjsses Princess and
Lena Whaley, of Paris; and Misses
Nell and Mattie Whaley, of Midway.
The faculty of the Bemett Schpol
of Musks, of Lexington, will give a
concert in the Paris Christian church
on the evening of January 10. Th
(program was to have been rendered
in December, but was postponed on ac
count of the illness of one of the fac
ulty. The concert will be given un
der the auspices of the Womans' Soci
ety of the church.
An event of the New Year's weeic
will be the dance to be given in the
ball room of the Phoenix Hotel, at
Lexington, on Friday night, January
5. A popular saxophone sextette will
furnish the music, and the hours will
be from nine to three. Among the
chaperones for the occasion will be Mr.
and Mrs. Charles A. Webber, Mrs.
Frank M. Clay and Mrs. Kate Wilson,
of Paris.
Miss Ella Louise Keal entertained
a number of her friends at her home
on Henderson street with a six-o'clock
Mr. and Mrs. Rudolph Davis, Mr. and
Mrs. Geo. W. Stuart, Mr. and Mrs.
Charles Fithian, Mrs. W. R. Scott,
Mrs. Wto. G. McClintock, Mr. and Mr3
John McClintock, ot Huntington, W.
Va., and Misses Kate Alexander, Lucy
Lowry. Mrs. O. L. Davis, Mr. and
Mrs. B. A. Frank. Mr. and Mrs. Frank
M. Clay.
Mr. and Mrs. Thos. Cain were
host and hostess at their home on Sev
5208,79S.1'
LIABILITIES
Capital ; 60,000.03
Surplus 2,500.00
Undivided Profits 834 J4
Due Banks
Deposits 145,463.18
$208,798.1;
Gross Earnings for Past six months '. $5,118.1 1
Distributed as follows:
Expense Account $2,482.04
Furniture and Fixtures . . 232.45
Interest Reserve 400.00
Suirplus 1,500.00
Tax account 503.65
$5,118.14
OFFICERS
F. P. KISER, President
S. L. WEATHERS, Vice-President
W. W. MITCHELL. Cashier
W. A. GRIMES, Ass't Cashier
$5,118.14
DIRECTORS
F. P. Kiasr, S. L. Weathers, J. D.
McClintock, Geo K. Jones, Sam Hous
ton, M. H. Payne, G. R. Burberry, Geo.
Wyatt, Sr., L. Saloebin.
I, W. W. Mitchell, Cashier of the Farmers & Traders Bank, of Paris, Ky..
do solemnly swear that the above statement is true to the beet of my knowl
edge and belief. . '
. i -1 11 ' : f W. W. MITCHELL, Cashier.
Subscriled and sworn
to before me, this 30th day of Dec 1916.
C. K. THOMAS.
Notary Public, Bourbon County.
My Commission Expires Jan. 18, 1918.
132nd SEMI-ANNUAL STATEMENT OF
Deposit & Peoples Bank
ORGANIZED IN 1851.
At the Close of Business Dec. 30, 1916.
RESOURCES
Cash $ 37,262.21
Due from Banks 184,132.22
Other Real Estate 12,605.89
Furniture and Fixtures .... 3,000.00
Overchecks 1,652.77
Loans and Bills 756.477.tf4
$1,010,130.91
dinner, in honor of her guests, Misses phy, 0f Frankfort; Messrs. Charles B.
Frances Rawlings, Moreau Morrow I Thomas, Ed. Woods, Joe and! John
and Mr. Asa Banks, ot Winchester, i Cain, Dr. William Kenney and George
Others present were Misses Agnes Browner, of Paris.
Kendall, of Frankfort; Lenora Ali- . .
band, Emma Louise Burley, of Paris; (Other Personals on Pages 3 and 5.)
enth street Thursday at a dining given i Banking House 15,000.00
in nonor oi a nuuiuer m umu mcuua
iu tJiis city and from other places.
Following the dining a musical pro
gram was rendered and dancing was
indulged in. The guests were as fol
lows: Mr. and Mrs. Summers Bel
faiar and daughter, and Mrs. Emma
Newman, of Frankfort; Mr. and Mrs.
L. B. Robinson, of Mt. Olivet; Messrs.
George Conway. Richard Tobin, Leo
Maher, Robert Phillips, of Frankfort;
Mr. and Mrs. Charles Massie, Mr. and
Mrs. G. Overby, of Carlisle; Misses
Nancv and Margaret Quinlan, Mr. and
Mrs. Rubbell. Mr. Lew Losekamp, of
rsrifvinrmH- Mr. and Mrs. John Mur-
$ 1
BANKRUPT SALE
LIABILITIES
Capital Stock $150,000.0
Surplus 97,500.00
Undivided Profits ... 901.39
Due Banks 7,002.69
Individual Deposits 754,726.8
$1,010,130.94
COMPARATIVE STATEMENT OF DEPOSITS.
July 1, 1914, After Merger $548,492.21
December 31, 1915 626,696.69
December 30, 1916 754,726.86
OFFICERS S. E. Bedford, President; C. K. Thomas, Cashier. ,.
BOOK KEEPERS Geo. Doyle, TV. T. Bryan, F. W. Galloway.
DIRECTORS Edw. Burke, J. W. Jacoby, Edw. Blake, B. H. Gorey. S-,
E. Bedford, Duncan Bell, E. M. Costelo, Robt. Meteer, C. K. Thomas, F. P.
Campbell, Geo. W.' Wilder, H. S. Caywood, E. M. Dickson.
Bought From
R. de V. CAROLL, Trustee of
VUcDONALD-KILEY, B4NKR1
Men's High Oracle M. & K. $10.00and $12.00 Shoes
ON SALE MERE AT ONE-HALF PRICE
U"" l
1
T
Open Evenings. '
1917 Art Calendar Free.
" - - Jib
?l! 2T w &S.
5 mn
KJ
Your Last Chance
This Week
Great Unloading Sale of Holiday Shoes and Slippers
benefits thousands of late shoppers. If you haven't
that gift, come here at once. Every pair of slippers
in the house marked at
CLEAN UP PRICES
Thousands of pairs of these suitable gifts must
must be sold before Saturday night.
Men's, Women's and
Children's Shoes
At Less Than Their Present Wholesale Prices.
A U 1 K
' J- '
' b 1 ft
fr rh s" r It
ff IT ' ff I (
f u M
ffafii(biJa
Ladies Dark Russia Calf Lace Boots ,. . .83,95 j Men's Russ and Platinum Calf English Walk
Ladies' Dull Kid High Gut Boots $3.41 ?f samples......... ..... S4.50
j Tv it t-j oi C7 go 9 Men s Russ. and Plat. English Walk-Over 5i.50
Ladies' Patent and Dull Kid Shoes W.W Men?g Gun Metftl EngHshf button and lace 2.99
Ladies' Patent and Gun Metal High Shoes $2.49 J Mens Gun Metal button.and lace, good quality. . . -SI.99
Ladies' Gun Metal, Button $1.69 1 Men's Heavy Work Shoes, good quality $1.99 up
SEMI-ANNUAL STATEMENT OF THE CONDITION OF
First National Bank
Paris, Kentucky
AT THE CLOSE OF BUSINESS DECEMBER 30, 1916.
t-
RESOURCES
Loans and Bills 547,481.10
Overdrafts .00
United States and Municip
al Bonds 116,000.00
Stock in Federal Reserve
Bank, Cleveland, Ohio. . 6,000.00
Real Estate 48,302.55
Cash. Due from Banks and
U. S. Treasurer 115,208.ir.
$932,991.31
LIABILITIES
Capital Stock $100,000.40
Surplus and Undivided
Profits 107,051.07.
Circulation M.QSl.S'
United States Bonds 5,000.0
Bills Rediscounts! 33,508.50
Deposits 582,434.74
5932,991.81
DIRECTORS W. V. Haley. Clintonville, Ky.; R. B. Hutchcraft, Jr.,
Paris, Ky.; M. R. Jacoby, Hutchison, Ky.; Chas. C. Clarke. North Middle
town, Ky.; Jos. 1. Leach, Centerville, Ky.; H. A. Power, Paris, Ky.; B. J.
Burris, Little Rock, Ky.
STATEMENT OF THE CONDITION OF
Bourbon-Agricultural Bank & Trust
Company
(Incorporated)
PARIS, KENTUCKY
At the Clo3e of Business December 30, 1916, After Placing Semi-Annual Div
idend of Five Per Cent, to the Credit of Stockholders.
RESOURCES
Rubbers of All Descriptions at Lowest Prices
Delay No Longer! Follow the Crowds Mere, Where Values Are Creates!!
XD-A.3ST COHEN
Paris' Greatest Shoe Store. 335 Main Street, Paris, Ky.
m Loans and Bills ?898,040.3D
I Overdrafts 4.225.U3
J Real Estate 29,000.00
Purni,ture and Fixtures 500.0U
Cash 36,942.
Ol
9 ' Due from Banks 152,237.53
? 1,120.995.39
LIABILITIES
Capital Stock $200,000.0f1
Surplus 125,000.00
Undivided Profits 16,189.6?
Fund for Taxes 4,039.3$
Individual Deposits 775,776.6
Due To Banks .q
Gross Earnings Past Si Months.
Disposed of as Follows:
?1,120.995.59
..$23,064.0j
Serai-Annual Dividend No. 3... $10,000.00
Expenses Past Six Months 5,235.19
Added to Tax Fund 3,500.00
Building Account Charged off. . . 2,128.35
Added to Undivided Profits 2,200.49
$23,064.03
rf.
595 ACAfA'f
Vu,V07.Wt
DIRECTORS-J. T. Hinton, W. W. Hall, Jno. Mawton,-.W. H. Anderi
i
1
IF
Hil
r
J
... ii. ua.uu(n. micucr, x. A. HMI, JWX T. CC4Hi,- Tho. HIMTiJ
iiay, jr. , ,, - . f, yjt
. C i V, .
. i"