PAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
TUESDAY. JANUARY It tf IT
i - '
I
K
W
i)
K
H
;
1
8
If
J
I
I
ii;
i r
- i
MILLERSBURG
BUFFALO BILL FIRST EMPLOY
ED BY BOURBON MAN.
The death of "Buffalo Bill' removes
one of the (most noted characters of
the West, whose career began while
in the employ of Ben Holladay, a
noted Kentuckian of Bourbon county,
Mrs. E. M. Thomason entertained
the 2th Century Club, Saturday afternoon.
Mr. and Mrs. J. Clarke Leer enter- wno emigrated to Missouri during the
tained six young married couples witii California gold discovery and became
a six-o'clock dinner Wednesday even- a (millionaire.
ins.
Mr.
When Colonel Albert Sidney Johns
C. C. Clarke left Monday fo." t0I1 was dispatched with troops to Utah
Si. Joseph's Hospital, Lexington, wher?
to put down tihe Mormons, Holladav
"K will imr1ntcr on nnorfiMnn r Tli
Bullock. The operation will not be nee- secured a contract to furnish the pro
essarily severe and Mr. Clarke hopes vender and supplies for Johnston's
to resume his duties at the postoflice men and animals, sending it west by
in two weeks. trains and pack animals from Inde-
Our town and community was vis- pendence, Mo. He also established
5ttid with a snow storyn Friday night, later the "Pony Express" and Ove
Vhich lasted well up into Saturday land Stage line across the plains
ajght. Sunday morning the snow was hich traveled from relay stations to
sxwjul 14 nicnes on uiu ievei, lii iiu.iv- others that vere fortified. On theso poet, whose ipoem, "The Moneyless
iwst nere since jamiar. kjiu, wne.i stages were armed guards, with others Man," was one of the best contribu
'on (horseback. Of the latter "Buffalo tions to the State s literature. Col.
DEATHS.
VANSANT.
The funeral of Mrs. Dora Vansant, a
popular young woman of Harrodsburg.
who died there after a short illness,
was held at the family hoane, Friday
afternoon, followed by interment Hi
tflie Harrodsburg Cemetery. Miss Van
sant was a niece of Dr. J. T. Vansant,
o Paris.
tery Saturday afternoon, at 1:30 Nellie Travelstead, and four sisters,
o'clock with services conducted -at. the4 The body was taken to Franklin,
grave by Rev. Dr. O. R. Mangunv, pas- Ky., Friday afternoon, for interment
tor of the Paris Baptist church. The Funeral services were conducted In
pall-bearers were her six grandsons. that city at two o'clock Sunday after
Mrs. Neal was the widow ot Mr. Jas. noon, and the burial followed in the
H.' Neal, who died in this city about Greenwich Cemetery,
one year ago. She is survived by two Active pall-bearers were E)nmett
sons, Mr. Edward Neal, of the county, Robey, R, F. Neely, I. Foster Leake, '
and Mr. John Neal, of Texas; three Callie Harris, Harry Black, Clarence i
sisters, Mrs. Nathan GoodVnan, and Evans, Gerald Finn and Lawrence
Mrs. John Mitchell, of Pans, and Mrs. , Finn, all of Frankfort Honorary pall
bearers were H. K. Cole, of Louisville:
J. Whitt Potter, Bowling Green; Judge
John P. Haswell, of Harrodsburg; C.
HWRGOLEKS
SPECIALS
For This Week1
STANTON.
Col. Clarence L. Stanton, a former
member of the Confederate army, and
a well-known traveling man, died in a
Cincinnati hospital recently, where he
had been under medical -treatment for
some time. Col. Stanton was a brother
of Henry L. Stanton, the Kentucky
Sarah Whittaker, of Harrison county.
FULLER.
Mr. Jefferson Fuller, a faifmer of the(U. McElroy, of Bowling Green; H. H
Old Union neighborhood, aged fifty Cherry, Judge Henry R. Hines, Tom i
seven, died at his thome Saturday after- Pannell, of Frankfort; V. O. Gilbert,
noon, after a long illness. He is sur- superintendent of education, Frank
vived by his widow, Mrs. Martha Ful-jfort; Gov. A. O. Stanley and the mem
ler, five sons, William, Thomas, Rob- hers of the Kentucky State Board of
ert, James and Alvfn Fuller, and one I Agriculture, composed of the follow
daughter, Mrs. Clarence Blackerby. ing Matt S. Cohen, Frankfort; V. J.
The funeral was held at Old Union Harris, Kevil; R. J. Bassett, Leign
church at 10:30 o'clock Sunday morn- field; Thomas L. Hornsby, Eminence,
ing. and the burial followed in the! J. Lewis Letterle, Harrods Creek; H.
the snow reached 16 inches.
Paris Cemetery.
An automobile driven by Mr. Jos Bill' was one, and enroute he was ad
Harrison, of Carlisle, caught fire from signed to the work of supplying buf-
'backfiring" just outside of Millers-
burg, Saturday afternoon, and was en
tirely destroyed. The car was valued
t $1,200. Mr. Harrison secured an
other car and proceeded to Carlisle.
falo meat. Being an experienced shot
with a rifle, he did this duty excel
lently, thereby securing the soubri-
Stanton was for many years editor o; j
the Maysville Bulletin, and was well
known ihere.
m. Forman, Ghent; J. M. Ellison,
Glencoe; Fred D. Blackburn, Stanton
DOTY.
The Young Peoples' Missionary So
Ksiely in a meeting at the 'home of Mr.-?
A. &. tsest on w eunesuay uuurnuuii in- (jay jn varjous ways
Ki:iiit?ii Liitn uiiiui;i? iui xjxi. x iv-n-,t.
Thp. oieht.-aTionr.'iiK-nld son of Mr. ami
quet of "Buffalo Bill." For a time he .Mrs. Edward Doty, of this city, died
helped to transport the U. S. mail at the Good Samaritan Hospital, in
from Independence to California and .Lexington, Saturday, where it
was generally employed by Ben Holla-; had been taken for an operation for
double narelip. The bony was brought
here Sunday. Funeral services were
BLUEGRASS PUBLISHERS TO
FIGHT HIGH COST OF PAPED.
-ere also raised for 1917. All pledges' Holladay acquired vast tracts of hel(1 at the residence jn Thornton Di
and obligations of the society were land in the Sacrrpiento A alley and nn- vision, Sunday afternoon, at 1:30
mid in full at the opening of the year ally built a railroad down the valley i o'clock, conducted by Rev. W. E. Ellis,
mid a small balance to tne credit oi from Oregon to San Francisco. Al- pastor of the Pans Christian church, vivos him
the society was still in the hands oi though at one time a multimillionaire, (The burial followed in tihe Paris Cem-
Uie treasurer, a ucugnuui ium.-u ia ne (ie( in jjew y.orjc a broken man. .tery. Tiie parents nave wie sympatny
Ffrved.
RELIEF OF FAMILIES
OF GUARDSMEN.
(One of his daughters married Count
.Pourtalay, Secretary of the French Le
gation at Washington, and another
married Count Boussiere, a Paris
banker. The first died soon after the
ot the community in their affliction.
Supstantial aid in the passage
tlirough the House of the appropria
tion of $4,250,000 for the support of the
dependent families of members of the
National Guard now on tihe border was
rendered bv Congressman Martin
Madden, of Illinois. Mr. Madden call-. he came to Kentucky
the attention of the House to spv-i'The Meadows" for
oral cases ccjning under his personal
Observation which demonstrated thf
r.eed of funds in addition to the
amount now on hand. In his opinio.i
FRYMAN.
The funeral of Mrs. Anna Fryman,
aged sixty-five, who died at her home
near Barefoot, in Harrison county,
Civil War, while en route from Cali-, after a brief illness of paralysis, was
rornia to Lexington on a visit to the
faanily of her relatives, that of Colonel
Jesse H. Talbutt, at "The Meadows.'
Colonel Talbutt's wife, Mrs. Mary Tal-
B. ibutt, was a niece of Ben Holladay and
and visited at
sometime, lie
used to relate scjmo very interesting
and amusing stories about "Buffalo
Bill" and his exploits while in the
Oveland Stage Route employ. Holla-
held at the Mt. Pleasant church, in
Harrison county, Friday morning, with
services conducted by Rev. J. R.
Howes. Mrs. Fryman was a daughter
of the late John and Sarah Damphyer,
o fMadison county, and was the moth
er of Miss Martha L. Frypnan, of Bour
bon county. The remains were inter
red in the ML Pleasant burying ground
near the church. (
TAYLOR.
The body of Mr. Gibson Taylor, a
former Winchester attorney, who died
at his home near Los Angeles, Cali
fornia, several days ago, arrived in
Winchester. Saturday night. The ) 1 he Blue Grass Publishers' and
luneral was held at Winchester, Sun-' Printers' Association, in its quarterly
day afternoon at 2:30 o'clock, and the meeting at the Phoenix Hotel, in Lex
burial followed in Winchester Ceme- ,ington, Friday, decided to adopt a co
tery. The pall-bearers were F. H. i operative plan for buying newsprint
Jackson. R. P. Taylor, Stanley Prewitt, ' paper and supplies.
Will Simmons, John Wheeler, Lee W. j After discussion of establishing an
(Bean, T. W. L. Vanmeter and David . advertising agency, the association en
Gay. Mr. Gibson 1 named Miss Sara.h dorsed the Mutual Benefit Advertising
Hanson, formerly of Paris, who sur-. Company, of which Thomas M. Owsley
is manager. The so-called "free plate"
advertising matter will not be accept
ed except at the regular advertising
rates, was the decision reached at the
meeting. The members agreed to send
notices also to manufacturers that no
free plate need be shipped except on
express order of trie paper.
J. M. Allen, of the Cynthiana Demo
crat, president -oi the Association, was
instructed to ccnimunicate with Ken
tucky Congressmen and Senators, seek
ing their aid in the campaign to lower
newsprint rates. D. M. Hutton, of the
Harrodsburg Democrat, is secretary ot
the Association.
The Executive Committee, composed
jul ir mbiuttiiL viien, ottcreiary nuLiuii,
members ex-oilicio; Owen Mclntyre, of
Danville; Harry Giovannoli, Lexington
Leader; A. A. Bowmar, Versailles; M.
25 pounds Sugar $1.90
All Canned Goods
B cans for 25c
Best Grade Flour, 24-pound
sack S1-2S
Beans, per pound.. .--12 1 -2c
Pork Chops
per pound 25c
Lamb (best cut)
per pound 20c
TANNER.
The funeral of Mr. John W. Tanner,
aged seventy-five, a former resident of
Bourbon county, who died at the homo
ol his brother, Mr. R, B. Turner, at
1001 South Third street, in Louisville,
Saturday, was held Sunday afternoon
!in the Paris Cemetery, with services
conducted at, the .grave by Rev. W. O.
Sadler, pasbor of the Paris Methodist
qhurch. The pall-bearers were Jos. W.
Davis, Jaimes McClure, Buckner Wood
ford, Charles C. Clarke, Dr. Chas. G.
Daugherty and Wm. B. Woodford.
Mr. Tanner was one of the promi
nent farmers of the old regime in this
county, and had become noted as a
poultry fancier, his pens having taken
FOR BILLIARDS AND POOL 'Baptist Church.
Mr. Trabue is survived by one sis-
TRABUB.
tlie War Department is exceedingly .day's relatives now m Lexington are! l'lv- lu"rv,u a;lla UL t :. ,
slow in passing on applications for Mra. W. 11. Polk and her brother. Be J
allotments to needy families, and m E. Talbutt. Mrs. Harry Ogle, of Paris, j -n Lexjngtonf Vere held at the gra'vj
likany cases refuses aid wnere it is ab- is also a relative of the pioneer. L-n tne" parjs Cemetery at 11:30 o'clock
solutely necessarv. One ot the mos. I Friday morning, conducted by Rev. Dr.
Aggravated cases was where a soldic-'cLUBS MUST HAVE LICENSE I O. R. Manguni, pastor of the Paris
bad left his sick wife at home. She
fcns sinr.p rlind and his home has been
sold because of his inability to nice ' Tne following notice has been issued ter, Mrs. J. T. Thompson, of Winches
ip intPrcst on the mortKace ct his Elector oi internal uevenuis ueu wr, ins., -ouu muuiei :i. su. u. xia
the interest on tne mortgage, ci ms Marsnall. ,bllCf of uarrisonville, Mo., and two
application for relief still awaits tnr , ..Un(ler the new revenue law. passed nieces, Mrs. Lucy Laycock. of Poin-
tction of the Department. In this case SepteT11Der is, ioiG, every building or dexter, Harrison county, and Mrs. Jas.
snd others Mr. Madden has personally nace where games of billiards or pooMngels, ot near Parte.
untributed relief. are played, or bowling alleys wher? I
i bowls are thrown, except in private NEAL.
Fvr correcting soil acidity, 1 ton of homes, is regarded as a bowling alley,' Tihe funeral of Mrs. Minerva Neal
bwrned li)ne is practically equal to 1M makes ijt necessary for all lodges and aged seventy-three, who died at her
tons of slacked lime or 2 tons of clubs t-o procure a special tax stanii. hvime on Second street, at seven
ground Mimestone, in case all thre This must be done in the month of o'clock Friday morning, after a long
orms are of equal grade of purity. January in order to avoid the penalty. ' illness, was held at the Paris Cemc-
manv prizes at the poultry shows and
county fairs, as well as at the State iR. Purdon. of Maysville, and Gemill
Fair and the Bluegrass Fair. He was Senff, or Mt. Sterling, will meet in a
a bachelor. Mr. Tanner had been vis- few weeks to adjust advertising rates
iting his brother in Louisville, and ol the twenty-seven papers of the Blu?
seemed to be in his usual good health.
He did not respond when called for
breakfast Saturday morning about sk
o'clock, and upon going to his rocm
he was found dead in bed.
Grass in the Association, in an efTort
to make thefci uniform.
The next meeting will be held in
Lexington in April.
STOCK, CROP, ETC.
MflRGOLEN'S
THE SANITARY MEAT MARKET
GOOCH.j
Wm. J. Gooch. Secretary of the Ken
tucky State Fair, Chairman of the
State Board of Regents of the Western
State Noimal School and former
Speaker of the House of Representa-1 J. .lacoby, of the Hutchison
tives, died at his apartment in the vicinity, sold his crop of 20,000 pounds
Seelbach Hotel, in Louisville, Friday, of tobacco to Abnee & Mussinon, of
morning, at 6'.) o ciock. tnis citv. tor an average of ?l.oo per
Mr. Gooch was a native of Franklin, hundred pounds. j
and was 59 years old. lie is survived j j
by his father, Mr. P. A. Gooch, off Permits for the importation of 127,-!
Wichita, Kansas, one daughter, Mrs. 706 canaries were issued by the Bio
logical Survey during the past year.
NEW YEAR'S
GREETING
Wishing you 365 days
of
HEALTH,
HAPPINESS '
and
PROSPERITY
in
197
We are yours truly,
WILMOXH
Grocery Co-
BANKRUPT
SALE
I
Bought From
R. de V CAROLL, Trustee of
MacDONALD-KILEY, BANKRUPT
Men's High Grade (VI. & K, $ 1 O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to D
ON SALE HERE AT ONE-HALF PRICE
GREAT
hflciniR
Hi
All short and broken lines must be sold at once.
Prices marked are far less than the actual whole
sale prices.
I X V
Corning
Attractions
PARIS GRAND AND ALAMO
Shoes
Rubbers
Slippers
Included in this extraordinary value giving sale. The following are
but a few of the many bargains that await you here tomorrow:
Ladies'
Ladies'
Ladies'
Ladies'
Ladies'
Ladies'
Ladies'
Ladiet'
Felt Boudoirs, SI. 00 value, at
Felt Juliets, fur trimmed, $1.50 value at.
Dark Russia Calf Lace Boots
Dull Kid High Cut Boots
Patent and Dull Kid Shoes
Patent and Dull Kid High Shoes
Gun Metal, Button, Low Heel
Dark Gray Milady Boots, all sizes AA
Quality, at Bargain Prices.
to D,
-.59c
..99c
$3,95
$3.49
$2.99
$2.49
$1.69
$9.00
Men' Tan and Black Romeos, $1.50 values, at 99c
Men's Black Felt Slippers 49c
Men's Russ and Platinum Calf English Walk
Over, samples $4.50
Men's Russ. and Plat. English Walk-Over $3.50
Men's Gun Metal English button and lace $2.99
Men's Gun Metal, button and lace, good quality $1.99
Men's Heavy Work Shoes, good quality $1.99 up
3D-A.3ST COHEN
Paris' Greatest Shoe Store.
335 Main Street, Paris, Ky.
& y"- - "
fc ilu J m. -J--4IC.,iJA
TUESDAY
Douglas Fairbanks
IN
"Manhattan
Madness"
Fine Arts Production.
Ora Cerew and Joseph Bel
mont in
Dollars andSense
a Mack Sennett Keystone
comedy.
WEDNESDAY
SESSUE BAYiKAWA
IN
"fionorabh
Trknd"
See this famous Japanese
artist. Famous Players.
Hours-Alamo, 2 to 5:30; Paris Grand,
7 to 1 0:30, Admission 5 and 1 Oc.
I.Mjgfo
V j L3i, '
- ' " '.iff i
Jnsepczrable Companions
they should be the Wedding Ring and the Life Insur
ance Policy.
A policy of Life Insurance in her favor should be the first"
gift to the bride,
If that were always the rule, there would be fewer un
happy homes, less poverty and humiliating dependence. -
There is a Life Insuradce Policy
To Meet Every Purse.
The Northwestern Mutual Life Insurance Go.
R. F. CLENDENIN, Awociate General Agent
Suite 220 First Natl Ban BH. PARIS, IT.
i
T
f