PAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
TUESDAY, MARCH f, lj.
fe
i
i
K
v
i!
U
I
'! I
M
MILLERSBURG
irapro
, ,,
DEATHS. !
FARMERS' INSTITUTE AT NORTH .PRESIDENT AND VICE
MIDDLETOWN, MARCH 8-9.
PRESIDENT INAUGURATED
FOR SECOND TERM.
3 ...
vins !
i.
Mr. J. G. Allen is l
ttlowly.
. t Mrs. J. B. Cray and Mr. R. L.
Powell remain very much the same.
Miss Robertson, of Minerva, is the
the guest of her cousin, Miss McLona
Butler.
Mr. C. W. Corrington "was in Cin
cinnati on business from Tuesday un-j
W Friday.
CARROLL.
Tihe infant son of J. C. Carrol was
buried Thursday afternoon in
Paris Cemetery from the residence of
his parents, at the corner of Main
and Twelfth streets.
The Ndrth Middletown Commercial
ninl oti-TIT Vkl.l .. V.....1 .MH..1 T I . --rrv&Y4-f"n--. -. -. - .
VjIilu yxl uuiu no iuiiu ctuuuui jp arm VV AollllN Vx JL U1S, JJ. U., AiarCll 0.- -
ers' Insitute on Marcfr 8 and 9. The ' President Woodrow Wilson took Hi?
program announced indicates that it oath of office for his second term at
will be the most extensive and the noon yesterday in his room at the
'ie most-successful of any yet undertaken Capitol, and was formally inaugurated
Leie. pionuay wun puoiic ceremonies re-
The meeting of the Institute will be jiecting a great National expression oi
opened with an address by Matt patriotism. Before a desk piled high
Cohen, Stale Commissioner of Agri- with executive business laid before
4 culture, on "Kentucky's Agricultural him in the closing hours of Congress.
uppor amities; itoi. vv. u. Nichols, and surrounded by members of his
i-
&
coming
Attraction?"
PARIS GRAND ID ALAMO
TUESDAY
McKBE.
an. iiiga. itiv;ivuc, iigcu viiiiin,.- r j.i, o..- a -:iii -n i. . . .. .. .. Z. - . -
... . ........ Ul Llie OLclLt: AKllljUlLUlill VjX Ilfrin 111HI1 L Mllimni Mmi v tlio kpoc rtnnt rootHrmnrt
eiKht. a orotner oi iurs. Agnes r.icivee .. ,. T t .. -.i j , .. ...., y xuUb im.mv.u
r V o WMvi,t f Qimnnnville ArklP of iioar Firis died at his hnmp oluuoii at jexiiigum, wm speaK on with, upliltecl hand and grave features
Mrs. Lena Wright, of Simpsonwue, Arkie, or near -ans, aieu at nis nome ,. subl-eCf "Acrieulture nn Thn ;c .t,io i,m nfo r.ff.
r j - L4AQ JX WJULLAJV ,J UJllUlU tlUl VjllOUtUHUU
111 tlie atternoon Geoffrey in ivhn.tfivr crisis mnv onnfmnf fitM
Morgan, in charge of the countv Nation in the momentous four years
agents of the Extension Department, .before him. After he had solemnly 1
CHAS. RICHMAN AND
DOROTHY KELLY
in
u
is the guest ofher cousins Mesdamesn Beverly Township, in Canada, re- Farm
S. H. Endicott and M. u. Jriursi. icenuy, auer a suoii uiuess. ma sis-
' Miss Judith Beeding, of Lexing- ter, Mrs. Arkle, of Paris, and one
ton
flumes
u,,r-at six" children.
Mrs J. P. Auxier sold a
a
&.
aeS S. H. End.oott and 51. u-f" "?,J sunlvors o a famU of tion;" Dean George Roberts, of tbe Washington a century ago President'
house
and lot in Judyville last week to Mr.
Allison, of Nicholas county lor a pii-
vate price.
John Toomey
aking out a plate glass were held in the Chapel in the Lex- lZTl"(r i nn SrnJ SiVIn aPin' me c?remany ?in5
' fined ?10 and costs, 'ington Cemetery. Mr. Bentley is sur- f" . Hnienmire on it fn K fi1 'f1?
s Y. W. C. A. convention vived by several brotbors and sisters, S' fl?,.nH-)hF: l?ulJ: xe !!lf,.. FlfSd??1 decAed
BENTLEY.
Funeral services over the body of
Mr. Charles Eentley, a former resi-
was arraigned be- dent of Little Rock, this county, who
ore Judge Wadell a few days sincj died m tlie (iood Samaritan Hospital,
icnrpriv ronduct ill the Blue in Lexington, after a short illness.
Howl and breaking
window. He
TVi State
Trill convene here Friday, baiurau two or mem residing in tins county,
and Sunday of this week. About fifty Mr. Bentlek had lived on his farm
Tlsiting delegates are expected. The near Little Rock many years. He
Relegates will be given a reception v. as taken to the Good Samaritan
Friday afternoon at the M. C. Hospital last week suffering from
The Carlisle local talent company ' pneumonia.
ut on "Tihe Thread of Destiny," at
the Opera House here Monday even- BANTA.
frig It was well received and was The funeral of Mr. Lot Banta,
reeted with a good audience, notwith- aged ninety-one, who died Thursday
!rfi5n- the bad weather. The acts night at his home near Little Rock.
' Wa intprsnersed with music 'after a short illness, was held at Llt-
College of Agriculture, will speak on Wilson kissed the Bible at the nass
Legumes;" Miss Mary E. Sweeney iage reading: "Tihe Lord is our refuge,
will discuss "Rural Home Economics." a very present 'help in time of trouble."
On Thursday evening Lieut-Bov. Jas 'chief Justice White administered the
D. Black vill deliver an address on 0ath, and was the first to extend hit--'The
Future of the Kentucky Moun 'congratulations,
tains;" Friday's program includes ad- Today the President took the oath
dresses by R. L. Blastock, of Walnut again, this time the ceremany taking
RED YMMQ"
Second Episode of "The
Secret Kingdom.
Constance Talmadge and
Wilfred Lucas in "Ths
Microscope rYsysisry,1
Fine Arts production
if
WEDNESDAY.
Vivian Martin in
"Her Father's Son
17
Oliver Morosco production on Para
mount program. Also two Paramount
comedies.
THURSDAY.
Wm. S. Hart in
a
Th4 Devil's Docble"
A bad man fights temptation and wins.
Lonesome Luke in "Luke's Double
Pathe comedy and Pathe's pictorial
news N-o. 3.
-One of tie most enjoyable affairs J tie Rock. Saturday afternoon at three ' h , t railroadt and llas ouly a
. ii. ,i., crixron hv inV.lnn.fr. with sprvip.ps conducted at the . . . . ., , ., . .. ,.
urcnara in me aiteraoon aaaresses to comnlv literally with the constitu
will be made by Hon. Reuben Hutch- tional stipulation that he. take the oath
craft, of Paris, on "The Tax Laws;" 0f office at noon on the 4th day of
Prof. C. M. Truax, on "Pigs; ,and March. Vice-President Marshall took
Prof. D. M. Slade on "The Baby i the oath of office to-day at the same
Chick." Prof. H. H. Cherry, of the time as cuci President Wilson.
Western Kentucky State Normal
School, at Richmond, will speak in the
evening on "Kentucky Rural Educa
tion," and plans have been made for a
high-class concert to wind up the pro
ceedings on Saturday night.
North Middletown is ten miles from
Hours Alaarso, 3 o 5:30; Paris Grand,
T to 10s30, Admission S and 1 Oc.
vl tlie week was uie uam:c 6i. -.
the rillersburg Dancing Club m the
Opera House, Tuesday night. Music
iras furnished by the Smith Quartette
The cihajperons were Mr. and Mrs;
Clarke Bascom, Mr. and Mrs. Sanforu
and 3irs. r. w. v;w '
attending were, jmiss
and Elizabeth
Allen. Mr
Among those
;,v Vnimfr .Tnr.kson
,c luUii8 ' : -i,. Tofiin
OL UW1I15SV1UVJ, -"'
Mary noss,
Paris; Lou
Ratcliff.
--, TT.Hrnhptll BrOWlL
dciuica, ii... ,.. 0f
of Paris; Lou uraasuaw diwu., -Sharpsburg:
Louise Smith, Gene
Faulkner, Blanton Collier, Miss ; Dun-
nington, of Cyntmana, - ,J
o'clock, with services conducted at the
kg me, by Rev. Metcalfe. The burial
followed in the -old Banta burying
ground near Little Rock.
Mr. Banta's wife died fifty years
ago. He is survived by four children.
Mrs. Margaret Sparks and Breckiu
ridge Banta, of Little Rock; Andrew
Banta, of Okladioma; and James Ban
ta, of Lexington. He was an uncle
of Mrs. Lucy Squires, of Paris.
Al-
few hundred residents, so that its in
terests are tied closely to the adjoin
ing districts. The Commercial Club
has been working hard to make the In
stitute a success.
Dinar l;irv
0A.ii "Winchester: Margaret
TJvieo AT'. nil. Mattie Butler, Ag-
"' -tt.,ii "iiPA Tnsels. Amelia
Hurst. Mr. 'and Mrs. Robert Johnson.
? and Mrs. Alex Miller Mr an
Mrs Clarke Leer, of Millersburg
' -cro'.io Hnll. Hawkins, Bur-
no viv Cain McMurtry He is survived by two daughters.
geSS, UUtJ, -. -i iw TI1n.V Ali-o T?rrTnov ATPMrfl nf P.ivinfrtnn
MrgelovmTNelsoii Haggard, of and ' Miss Olive Robertson, of New
wEHhecter ."ohn Stuart, Withers and ork. a distinguished and accomplish-
Davis, William i). """X. i Xr; "rTi tiT. .Hv
Harvey Rogers, oi ".o, j-- "--'- ?:1":",.Z' r.
Hon MClVee, Vli 'US UlKfclir LU cUU&lt;, WUC1U UIU IU1IC1-
RG6LRTS0N.
Mr. Solomon Robertson, aged sev-Mity-four,
for many years Clerk of
the Nicholas Cir. uit Court, and Trus
tee of the Jury Fund of Nicholas
county, died in St. Joseph's Hospital,
in Lexington, Saturday, after a long
iliness of stomach trouble. Mr. Rob
ertson was a prominent Mason and for
twenty years was secretary of the Car
lisle Masonic Lodge.
O
O
FORMER DEPOT EMPLOYE
FILES SUIT FOR DAMAGES
STOCK, CROP, ETC.
Suit against the Louisville & Nash
ville Railroad Company for $25,000
damages has been filed in the office
of Circuit Clerk Wm. H. Webb, in
Paris, by Mr. R. L. Briggs, of Paris.
On November 21, 1916, Mr. Briggs,
who was employed at the Louisville &
Nashville freight depot, on Third
street, in this city, was thrown be
tween two freight cars, receiving in
juries, he alleges in his petition, about
the head and body ana a shock to his
nervous system, whicBi, combined.
have totally incapacitated him from
O earning a living. Briggs was employ
led as a freight handler.
In Scott county last week, J. L Briggs claims that while employ-
Carrick & Co., bought of Mr. Skinner, ,od as a freight handler at the dopo1;
of Bourbon, one hundred and ten bar- he wan engaged in transferring freight
rels of corn at $5.18, delivered. RobL , trom one car to another, and that.
Ward, of Newtown, bought of Mrs. C (while removing a skid plank connect
L. Garth, of Lexington, 250 barrels ing the two cars a reight engine
of corn at ?5.50 barrel. ling the two cars a freight engine
The prospect for a good wheat to the ground, the heavy plank fall
crop this year, according to a well- ins on him, inflicting injuries which,
I posted Bourbon county farmer, is not 3-e alleges, have prevented him fron
as promising now as it was a few resuming active work.
veeks ago. It seems that after the
heavy snow and sleets the cold weath- MEASLES EPIDEMIC IN CARLISLE.
er which followed, froze and injured
Joe
Turner.
Homer Whittaker
Ham Northcott,
Tipton and SoUi Botts,
Asbury, ?asi. Croucl .Duke Don-
ii Mr Meadows, ol ""','' .
Vll !. -
Cvnthiana; William
of ML Ste
Nathan Young,
the young shoots, though the extent of
teh damage is not yet positively
known.
al was held yesterda'.
VANARSDALE.
The boay of Mr. Elijah
dale, father of Mrs. C. B
Vanars
Mitchell, of
KENTUCKY STOCKMEN
EFFECT ORGANIZATION
n At I norn c i- . i iii-.i l x r -
-DnrAthr- ATnvsvilie; Alien J.11&W, .fans, who was Kineu uy a iram near
m" . TnePls H. C. Current, Julian Lakeland, Florida, last week, was
Adair Russell Caldwell, Alfred Pence, i)r0Ught to Paris, Saturday atternoon, w
inhnWright Major Kelson, Capts. !for interment in the Paris Cemetery, ti
column and McGruder, Glenn Shank-jTne funeral was to have been held in
lin, of Millersmns.
Fifty cases of the measles in Car
lisle last weok made the prevalence
ot the disease assume tihe proportions
of an epidemic. Six children in the
family of Mr. A. J. fcarr had the dis
ease at one time. The enrollment of
pupils in the Carlisle Greded School
For the purpose of advancing Hip as seriously altecteu. ten cnnuren in
interests of pure-bred live stock indu. one grade, the Third, being reported
try in Kentucky, preliminary steps to- down with the measies. Tlie authori
ward formation of a strong organiza- ties are doms all in their .power to
tinn vorfi taken at a recent meetintr combat tlie disease, ami an uue pre-
4
MATRIMONIAL.
in LiOuisvnie. fromment siock men
Friday afternoon, but due to delays in from all over the -State were present.
railway connections, it did not arrive C. E.-larvin, or Faynes Depot, was
.at his old home near Harrodsburg, un- elected Temporary Chairman and L.
til Friday afternoon. Services were B. Shropshire, Louisville, Secretary.
'held at the family home, conducted by Permanent headquarters are to be es-
jRev. J. A. Trostle, of Harrodsburg. tablished at Louisville at once.
'The remains, accompanied by Mr. C.l The organization will encourage par
IB. Mitchell, of Paris. Mr. Abel Sharp Heularly the raising of pure-bre
pnnnF-FUl KNER. 'and Misses Isabel and Lucile Sharp, of stock, and it is announced the bod
uuuuni l- - j Talmadge, Mercer county, was brought will promote a system of operation
M Wilbur P. Faulkner and Miss!nere Saturday afternoon and taken whereby th-ousands of dollars will be
imrineGoode Wth of Lexington, wen? jdirect to Uie Paris Cemetery, where kept in the State which previously
lted a maniage license yesterday lhe interment took place. The pall- has gone elsewhere.
DV V. OUnt) viv UL'ttlUIS fl c ms. iiaujva, u.xo. i.ua- -- wr....... w. v .- . - --.--
E. B. January, John W. Larkin to ciratt plans lor permanent orgamza
tion, which will be eftectea in a meci-
j Mr. Vanarsdale was a fine type ot mg on pru a. ine comrauiee vt
ithe old-time gentleman, and made j- composed of J. L. Lettrelee, Harod's
ihost of friends here on his numerous Creek; R. H. Lilian!, Lawrencebi'rg,
Visits. H. 0. Moxley, Shelby ville; W. R.Moor-
Jliau, vxicillluaii, aim uuuu u. - " i.,
t 1IANLV. hJarastown.
Miss Mary ITanly. ajre-I seventy
cautiors are being
its further spread.
taken to prevent
W93Q9QG09QI
m
j .says
ill
pjj
The Worst Handicap
in the world is WORRY it ties a man hand and foot
takes off they edge of .his taients and cuts down his
ability.
WORRY as to what will happen to the family if any
thing should happen to you, will do more than anything
else to reduce jour earning power.
LIFE INSURANCE solve the problem the day you get
your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
The Noroiwes
ton Wool Life ioeoranee Go.
R. F. CLENDENIN, Associate Geneial Agent
Svite 201-202 First Nafl BanK BIdg. PARIS, KY.
cm Wf
rlrrl
m nn-k rr i risiiii. vjw
aiieruuiiti .v ':., i,,tiv of -
-r Tiiov wprf niarrit-a aui; errv.
Ltnt' the residence of the officiating and Robert L. Frank
minister. Rev. W. B. Ellis
TALtfERT BROWN.
Mary
were
Ir Jesse Brown and Miss
n.nihort both of Bourbon county
-.arried in Carlisle, Tuesday.
Sf Maggie Belle Crump , of Nicto
las countv, and Mr. Wm. D. Allison
nf BoTboA county, were married at
Se tome -of the bride, near Carlisle
on the same day.
nine, one of the best-known and best-.PRICE OF HEMP SEED
beloved women of "Vt. Sterling, dicl
I at her home in that city Friday of per
itonitis. after a lont? illress. She was
TAKES ANOTHER JUMP
The latest quotations on hemp seed
born and rpared in Mt. Sterling, where , according to a local dealer, places the
Iciio imrl livfrt nil -her loner and very nrirp nf that arfr.inlfi at S13.50.iftvith a
SKIDMORE PHILLIPS. Jugful life. She was foremonst in all .prospect of its going to $14oforo
Mr Wm. H. Skidmore and "a",worics 0f nharitv. and was one of the.verv lone:. In less than two weeks
Mae Phillips, both of Lexington, came most iova,ie Women in Mt. Sterling time there has been a sharp advance
supply is
to the de-
. (i...r.1iiv SlffPTIlOOn. anU .. , , v.i.. -,, Uir- nil r -l rft .. U,.nl,nl rpi,
made application to .County ierviwho knew her. (now said to be hardly equal
Pearce Paton lor a mariitb " "-; j Miss Hanly was a sister ol Mr. jonn mand. I
On account of the youthful appearance Kanly and Mr Joe Hanley b0th for- Tihe orders which hive been receiv-j
of the bride-to-be Clerk Paton causc;raer residents 0f Paris, and now resid- ed by the dealers of Taris for hemi,
her to sign an affidavit that she was ing in Kansas City Bepides thes , seed may be taken as indicating they j
past, above and beyond twenty-one i oi twQ Drothers, she is survived by two will put in a larger acreage of hemp
age" County .ludge Charles A. aisc 'sisters, irs Margaret Ragan, of Mt. tliis season than has been the custom
Milian was called in and Pertormc7 j sterling, and Mrs. Betty Dorsey, of for many years. The crop with some
tihft marriage ceremony Auuw. -" Umatilla, Florida. Messrs. Jos. ana farmers will, in a large way, sup
Against
Higher Prices!
Cy J
Grasp this opportunity
NOW! This wonderful
bargain giving
UNLOADING
SALE
are
offers you the biggest
money-saving event.
doing. Buy now for
Not for a long time
Do as thousands of others
future as well as present needs.
will you be able to buy high grade shoes at prices so
low. .
Follow the crowds here and save big money.
weds
house
e.
hand-in hand, left tne t-uVrr John Hanly arrived Saturday to at-'piant tohacco. Seeding will hegin in.
as happy as any coupn- w'u ; teni tie funerai, which was iheld Sun ( April, and the growers who are con-1
day atternoon, the interment follow- j templating putting in a larger acreage
ing in Machpelaii uemetery, at iut. (iiave been putting in tilieir orders tor
FISHER SCHEFPER. Sterling. Miss Hanly was an anut olithe seed earlv in order that they wiU
The marriage of Miss BllzaPv:J Mr. Hanly Ragan, of Kansas City, for not be up against the condition that
Prewitt Fisher, daughter of Mr. J0inJ'naily years well-known in newspape'iexijted last season, when practically I
X Fidier, of Louisville, former ol , circles in this state, having been tiie entire seed crop was exhausted
North Middletown, this county, to ir ipTorting editor of the Louisville Her-(0efore the growers had time to realiz-j'
Halph K. Sclliter, oi tuiumuu-, --- ald .there was a shortage.
fnrmerlv of Louisville, was reiuu.-w-
?.,"n.- nt hiHi noon Saturday at the jAoo
Central Christian Church, in Linen
r?5OTic ami Mrs. Russel Mayhall,
"..r ,- rvi crhoffer. Sr.. of Louis-
v lie, were the only guests Present at.
:..!.. li: ftPr to-dav Mr. and O
Mrs sSIr nf n.u..e tholr home in
Suffield. Ohio.
BIRTHS.
',i Tihere is said to he a scarcity of
seed that will be likely to force the
price still higher during the next few
iweeks, although one dealer said Satur-
day that it was more than likely there
would be a small decline in price.
A son was born in St. Louis, Mo . ,
n cuter of Mr. Warren Sunday, February 25, to Mr. and Mrb ,
MILLERS' ASSOCIATION TO
MEET IN LEXINGTON
., Jtnro theCarlisle Mer Wm. M. Rogers.
- :-1 lGZ twotenns a membcxlchristened Wlnsf
Vjf-the Paris High School faculty.
TAX ON AMUSEMENTS.
Race tracks"lnlll Places of
amusement in K ;- '
The lad has been
inn ttrnttnn Koirers. i iur. u. ll. neniCK, oe uie rau& aiui-
The mother was lormerly Miss Annie ing Co., President -of the Kentucky
Laurie Brown, of North .Middletown, a Millers' Association, has called a meet
niece of Mr. Jos. W Hart, of Paris. I ing of. that organization to be held in
. (Lexington on next Thursday, March
FIGHTING SLEEPING SICKNESS ;8- Notices of the meeting have been
; ay lit vui uy an. vv. sn. vvumcu, .
One of the little islands in the Gulf ?Ttanfo"!- Secretary of the Association
r nino, 0n. fh AfnVnn nn.ct h. More than forty millers in Central
n Sr cenL of their gross earnings
" ---- . . , , v.r wonrpsRHia-
if the bill introauiu , , i"' " .ii-. oi,rn Kentucky are men
T-A;1?rr-Dover .ays that Vbi?miaZi methods. Sloping sick- "on- all of jhorn
tive
hopnmes a law.
are members of the Associa-
are expected to at
the tsetse fly. and "" uie uhjuis,
pecouiw onnrmous revenues t3,ness is carried by
I AV III K 1 I lfr . . -.
?L cli hp knows that it will meec he hundreds of men m the army oi ,..., AI jA! CA Cljrilll r, n,r r,,T
th-?uS;.onnos?tion. It is proposed I sanitation were turned into walking, WHEN ALFALFA SHOULD BE CUT
Ladies' Dark Russia Calf Boots
S6.00 values 5
Ladies' Dull Kid High Cut Boots
$4.50 values
Ladies' Patent Kid Cloth Top Boots
5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values
Ladies' Cun Metal, button, S2. 50 val.
Ladies' Felt Boudoirs, 31.00 values
Ladies's Felt Juliets, fur trimmed
1.50 values
3.69
;2ss
S.4-9
1.99!
1.69
Men's Russia and Platinum Calf Walk-Over
and Beacon, 84.50 values $3.4-9
Men's Russia and Plat. Calf English Walk
Over Samples, So.00 valuesrr..$400
Men's Gun Metal English Medium Toe Welts,
$4.00 values $2.99
Men's Gun Metal Button and Lace
S3.00 values t .99
Men's Tan and Black Rompns
.49 ! S1.S0 vnlnpa OQ
r-.. w w.w. .................. w ,
Men's Black Felt Slippers
79 1 75-cent values 49c
Ladies' Dawn Grey Kid, Also Mahogany Tan, Most Fashionable Boots at Almost
ONE-! ALF THE PRICE YOU PAY ELSEWHERE
Boys', Misses and Children's Shoes at Great Bargain Prices.
FROM THE "
IVIaeDoiiaSd-liiley Bankrupt Sale
Men's High Grade fV2, Sc K. $ I O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to O
ON SALE &-SERE AT ONE-HALF PRICE I
lUX O""o - , . Un. IniriOM 111. flf.nnnnr ilnrtnf thn PamnniPTI ThPV ' In rrnnnfnl olfolTo nViniilrl 1a riit
a nf the ordinary license for sucli wore canvas suits coated with a sticic f0r ihay when the young shoots at th
steaa on amusement. Places o substance similar to that used in cum-, bases of the plants first appear. If
p ceLont will include picture shows, mercial fly-papers. Five years ago these new shoots become long enough
amusement win nY, J.,. ! to .nmoHm nxht snn fiipr-. i, ,.f nn u f ,... , .
a day. This squad of 300 caught 17.--crop may be badly damaged. The
000 a month. For the last nine months blossoms often appear simultaneously
aance
1UCU1- ..... - -
halls and ball parKs.
a rriiTip- to repotts, came
vjerait " . , .j .tfVi th'..- n nr liao lioon namrVlf nnfl iht .. ill. U -n,. -...n f,l,..in V...4- l,1nn
n, near being aeconiwu .c v- .uui . iv n . v-wt,.. . ..w mm WiC UKs juuue auuuw, um uiua
Gennaii order of the double-cross j sickness has disappeared from the is soms alone are Jiot a safe gijide to
DAfi
C0HEM
Paris' Greatest Shoe Store.
335 Main Street, aris, Ky,
A
m
m
a
a
o
?
s
a
m
m
s
I
AtlanU Journal.
land
the time for cutting.
i j
$7
L-V
.k
r