r
-
k i
PAGE EIGHT
THE BOURBON NEWS, PARIS, KY:
FJtIDAY, FEBRUARY 3, 1M7:
at
PARIS BOWLING LEAGUE
.
MILLERSBURG
In Tuesday night's game in the
t scries ueing pia eu uy uie tenuis uj. mu
4 4. . Paris Bowling League, the Bourbon
Laundry team "put it over ineir op-
NOTE (Owing to an unusual and ponents, the R. P. Walsh team, though
unexpected rush of advertising matter it wasn't a very big majority, only
tiat cxtfaie in. at the very last hour, twenty-two pins difference in the
ve are compelled to hold over to the score. For the Laundry team, Fred
Tuesday issue Mr. Caldwell's verv in- Burgin carried off high honors, maK
teresting article on -The History of "S 177 in the second gaime. Funk
Millersburg," on account of its length.) came strong for first place, wiUi 201
,170 m tjhe third game. For the Walsh
r Prof. Ellette preached at the team- Hill was high man, with 178 in
. Christian Chinch Sundav evening. Ue first game, also coming second
Miss Martha Smith was at home with 174 in the second game. Ilia
irpni Georgetown College from Friday j score follows:
- 'CTtii Monday. , . ni ' BOURBON LAUNDRY
The Young Men's Dancing Clu'J . 1 2 3
tx1I give a mop at tne upera nouse on Jacks3n 169 142
tate evening ol t eo. ai. j Burgfn 114
Mrs Mabel Courtnev and Mr. R. Templin 151
M. Caldwell visited friends at Lexing- 'Neal
tan, Monday and Tuesday.
Col. W. M. Layson and grand-
' daughter, Miss Lavina Layson, leii!
Tuesday for Florida, where they will!
oTvkl ISo rAmnimlnr nf the winter.
'
MATRIMONIAL.
Funk
.111
.162
177
145
130
123
133
127
15?
1461
170
HOWELL WiNkLE.
At the court house in this city
Tuesday afternoon County Judge C. A.
McMillan performed the marriage
ceremony uniting Mrs. Margaret Hov
ell and Mr. William Winkle, both of
this county.
Totals 767 717 711
DOTSON BEASLEY.
The marriage of Miss Virgnia Dot
son and Mr. George Beasley, both 01
Clintonville, was solemnized at the
Christian Church, in Georgetown
Monday afternoon, the Rev. Ira M.
Boswell, pastor of the church, offici
ating. After the ceremony Mr. and
Mrs. Beasley left for a short visit to
friends and relatives in Lexingtor.
and later will go to housekeeping near
Clintonville, where the groom is en
gaged in farming.
R. P. WALSH.
1
,Hill 178
Mr. S. E. Bruce and fahnly .moved ( Huffman 139
Wednesday from rooms in the Best Kenton 172
lints, to the cemetery residence, va- Douglas 136
cated by Mr. A. T. Hillock and family. Duncan 116
174
147
131)
156
137
3
120
7 120
sharon Mccarty.
Mr. James McCarty, a prosperous
joung fanner of the Centerville pre
cinct, and Miss Malvina Sharon, of
Miss Ethel Jones, of the Bourbon
TJome Telephone Co.. attended a meet
ing of the operators of that company .
at Paris, Tuesday evening. An inter-'
esting program was rendered, after.
. utiich refreshments -were served. j
The Annual Junior reception ot j
the M. M. 1. will be held on the even
ing of February 23. Cadet Hamilton,
.or M. M. I., v 111 give a private mat-
inee dance to a few of his friends in
3L M. 1. Drill Hall on the afternoon of
February 24.
Totals 741
108
I Paris, were granted a marriage licens"
165 j Tuesday, by County Clerk Pearce
Paton. They were married in Lexing
iv6 xszi. inn T-iiPsrlnv niffM. The bride is a
Laundry Totals 213S g,a(iuate 0f the Paris High School and
R. P. Walsh 211Goiis a daughter of the" late Mr. Alle.i
Sharon, formerly of Pans, bhe was,
until her marriage to Mr. McCarty,
bookkeeper in the local office of the
Singer Sewing Machine Co.
Laundry Majority 22
A mixed team cchiposed of mem
bers from each team in the Paris
Bowling League, played the George
town team on the Georgetown Alleys
Wednesday night Georgetown won
tihe series by a margin of 30 pins.
For the Georgetown team
Mrs. Clara Shanks remains very
- much the same; Mrs. G. L. Hill has
r suffered a relapse of the grippe; Fred
Hill is ill with tonsiUtis; Miss Anna
a fok is .auite ill; Mr. E. H. Kerr is
.- Imnrnvimr at this writing: Mrs. J. P. third ga;me
Redmon is confined to her home with
- grippe.
Mr. George Gardner returned to
his home at Berry, Monday, after a
came strong for first place, with 207
in the third game, Ammerman follow
ing for second place with 191 in the
second gajiie. For Paris, Hadden
gained first place -with 185 in the sec
ond game, and Funk second in the
The score follows:
HOWELL WINKLE.
Judge C. A. McMillan performed the
marriage ceremony at the court house
Fleming t Tuesday, uniting Mrs. Margaret Howe
and Mr. William Winkle. The couple
came to Paris, Tuesday, from Harrison
county and secured Imarriage license
from County Clerk Paton.
The Cynthiana Democrat says:
"Wm. Winkle, aged 50, and Mbs. Mar
tha Cummins Howe, 40, both inmates
RELIGIOUS.
The Episcopal church, Rev. Geo.
H. Harris, rector; Sunday School,
9:30 a. m.; Holy communion and ser
mon, 10:45 a. m.
Rev. Mr. Hicock, of Hot Springs,
Ark., will preach trial sermons to the
congregation of the Paris Presbyterian
churcQi at the court house Sunday. A
full attendance of the congregatioi
is urged to hear the speaker.
The February meeting of the C. W.
B. M. of the Christian church will be
held in the parlors of the church at
2:30 o'clock, this (Friday) afternoon.
Mrs. J. D. Booth, the president, will
preside. A full attendance of the
membership is urgently requested.
The Mission Circle of the Christian
church will meet in the church parlors
next Tuesday for their all-day sewing.
Tthose who desire to contribute mate
rial for the work will please notify j
Mrs. Thos. W. Allen or Mrs. Charles
May. Mrs. Funk's class in the Sun
day school will furnish the dinner for
the Orphan's Home one day the com
ing week. One of the splendid things
this class is doing tihis winter is look
ing after clothing for a family with
six children in this city. The Teach
ers' Training Class that is taking ad
vanced work will meet Monday after
noon with Mrs. R. F. Moore, on Fif
teenth street, at 3:30 o'clock. The
Workers' Conference will be held 111
the cihurch parlors Wednesday night
following the prayer .meeting service.
The new text books will be given ou
at this meeting.
three-weeks visit to his son. Rev. J.
W. Gardner, and family Mr. Gard
ner is a remarkable man. He has
passed eighty years of age, has never
.suffered frcm toothache, rheumatism,
neuralgia, nor insomnia, and has taken
but little medicine. He is almost a.
supple as a boy. and in perfect pos J
ession of all of his faculties. j
GEORGETOWN.
1
Betts 165
Allen 151
Fire, wind and lightning in
surance. Thomas, Woodford& Bryan.
THREE ARRESTED CHARGED
WITH GRAND LARCENY
George Cravens, claiming Somerset
Gibson 163
Fleming 136
Am merman 171
127
149
124
138
191
.mimiwi ,,
ot the Countv Infirmary, secured I ?B "lt5 IIOI"' -?" imu-xiu, 01 a-jl-
., .license to be married Monday, button, ana a wine Ionian giving ner
, later called it off because it was ills-1"1" a? it, la waters no nome were
14-l, 1 !, n, i.;.iti, i,,i nni' lodged 111 the Pans jail, charged with
JiiMbccn granted a divorce." " (housebreaking and grand larceny
Coming
Attractions
PARIS GRAND AND ALAMO
Frcdaij Saiurday
J. Warren Kerrigan rSSie'SSSS
IN - IN
" B16 lS''Cnt "The Ninety 3Dd Nine"
, ,.,,., Vitagraph Blue Ribbon Fea-
a Bluebird Feature. ture.
Eddie Stevens in
"The Crystal Globe" "fahiNfah!"
Ninth episode of "The Yel- KaW K2"! KahI
low Menace." a Big V Comedy.
Hours Alamo, 2 to 5:30; Paris Grand,
7 to 1 0:30, Admission 5 and 1 Oc.
150,
2011
178'
Totals ... 7SG
PARIS
Duncan 156
T -1 11.1
j.iacKson "i
729 sjo' BIRTHS. '
' I which was disposed of to junk dealeis
'in Paris and Georgetown. He also
160
173
'
3 ! .'
15;;
156
(The arrests were made by Chief of
! Police Fred Link.
I ThroKle, it is said, confessed that
' the trio stole several hundred dollars'
worth of brass, copper wire, lead, etc.,
.treni the Paris Gas & Electric Co.,
To the wife of Mr. Russell Bell. tol(, of the tiiefL of CJUUiv chewinc
" in the COUntV. a teil-DOUlld SOU. Mrfc. 'mini otr. trnm Air .Tnlin Tttnn. wllfi
l-W4LDWOOD," ATTRACTIVE NEW Henry UJ r , Bell was formerly Miss Dennie Ken-. conducts a candy stand on Mai.i
SUBURBAN RESIDENCE ADDITION (Hauden - o.j i jnetly, ot near i'ans. J street; also to taking a coal oil stove
. iuj in a telegram was received last nigiu and chair from a voting booth on Sec-
i loin Covington announcing the birth ona street. All the stolen property was
Funk 16
Totals 720
Georgetown Totals
Georgetown Majority o0
The new fair grounds tract, or.
South Main Street, just beyond the
city limits of Paris, has been named
"Wildwood." and has been platted in j
tracts of 2 and 4 acre farms, which
will be offered to .prospective pur-'
oli3Grs
This high and sightly tract of land j
has been divided and staked off, and jH0ME TElePHONE CO. HOLDS
prospective purchasers can now visit ANNUAL PLANT MEETING
the grounds and select one or more
small fanms to suit their fancy. A . The tMrd anmml piant meeting" o!
beautifm ana convenient uixY"":'tibe Eastern District of the Central
been provided in the rear of a" tract-. TeleI)hone Company, of which
SOS 7SJi0i an eight-pound son to the wife of ' recovered.
2335 i Mr joim w. Mackev. formerly of Pari;.
Paris Totals 2305 , christened John Bernard. Jr. Th2
mother was Miss May Agnes Shannon
of Paris.
The Bruce Miller farm
of ! 22 acres, near Paris,
will be sold a auction
IThursdav, Feb. 5. See
deaths. J descriptive advertise-
- ment on page 2 of The
Kentuckian-Citizen.
from the Clintonville Pf tothe pass- J-is ,
vay leading to the L & NV lNa; 0f the Paris exchange.
The owners of this body of land will nftprnnnn nnd fiven
Mw.
Mae
JOHNSON. I
held in the ollice The body of the infant child of.
in this city, on! Mr. and Mrs. Joe Johnson, who diedi
ilmn a CI i t a 1 mfnninfT f Tnllflo I ni !- Knmn nf lie nniftllL' ill TIo 1
: , ,. it,. in.c i uie utLtri iiuuii auu cciiiiib ui iiiii.iu.j m, tiiw iiumu ui no jai uuio, in i.- u.i-
5ell the irapie Dunuinb& uu wc . January 29. The following exchanger. ' mouth, Indiana, Saturday, was brought
, on Saturday afternoon, b eo. J, ana ine werc represented at Uie meeting, to the Jacksonville Cemetery, in thH
public is invited to attend uiib mi- MaysviUe Aiayslick. Cynthiana, Car- county. Tuesday, for interment. Short.
and inspect the lay 01 uie uwumu. Paris. Millersburg, Little Rock, services were held at the grave,
grounds. ,.f0t Owenton, Lawrenceburg and Frank j Johnson .was formerly Miss
Tiip.se small farms nae pcueci. i,... ny.n v or,,ii ' li e uo,;- ,
-Vvdrainage, studded ith state anu Eastern District, having .
beauaful torest trees and numerous, Central District un. STATE HEALTH NURSES'
inaple trees ar distributed througu- ( y j ASSOCIATION ORGANIZED
w out Uie entire Siounds. No uount The afternoon session was (levoteu
many of opr people nae nec ii uio informal meeting and confer! The Central Kentucky Public Health
the beauty of tne srouniu. QncQ of tne various managers, at Nurses' Association was organized a'
gently sloping ma oft er which plans for tne coining seas0n's a meeting held in Lexington, Monday,
tion and afford nign anu " ' vork were discussed. This was follow- Miss Elizabeth Hunt, of Georgetown,
tions for desirable suburban chairman. Dr. W. L.
Visit taie p ace and walk oei vu UuVlvz up with an athletic contest ou Hizer ot Bowling Green, addressed
most desirable suburban sinaii ri LexingtoIl pike. Mr. j. B. Cham- the ieetiiiK. The Association effect-
tracts ana tnenjou j i.u. . . . jberg m;uiager ot- lhe Frankfort ex ed an organization by electing the foi ,2
neciate their Jwty and tt1" J-rt change, won the one-hundred yard lowlng officers: Miss Florence Hanr-
-For Jiiliisli. The other events were won by alttf 0f Eminence, president; Miss
undersigned, who will take plcasme 11 members of the Paris roup. j Virginia Martin, of Lexington, vice- J
LnSnnn i GOREY At 7::i0 'clock a delightful banquet president; Miss Margaret Frost, oC Mt.
WILDER, LA uuu V1" al the n0tel Windsor, the regular busi-' sterlinc. secretary. Mrs. Harriet Min- flfc
' ncss session was called to order by aker, Visiting Nurse of tho Bourbon , Jm.
at whioii the following program waoj0f pais, was named Chairman of j
J m5-rrwi?ON carried out: the Program Committee. The next
nu i oniv-'i-.. nendiiifr nf ATInnP nf tliP T.n-f ',,,,., ,;u l lmlfl mi I.Iip spr-iin.l
I A
The Worst Handicap
in the world is WORRY it ties a man hand and foot
takes off the edge of his talents and cuts down his
ability.
WORRY as to what will happen to the family if any
. thing should happen to you, will do more than anything
olse tu reduce your earning power.
LIFE INSURANCE solve the problem-the day you get
S your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
i The Northwestern Mutual Life Insurance Go.
S R. F. CLENDENIN, Associate General Agent
S Suite 201-202 First Natl BanK Bldg. PARIS, KY.
'CLEARANCE SALE
:
:
IN ALL DEPARTMENTS
R Winter
i
. .Meeting. Thos. K. Smith, Paris; "Our Saturday in May, at Lexington.
'iNew Exchange at Maysville," John J.
,. A1 , (Lynch. Maysville; "My Method off -..,.
- - Our farmers are about throug,- pIaintaining a Plant With a Small, The BrilCe Miller farm
x delivering tobacco, realizing go . Force," w c Cornian, Carlisle, "Lo-if 00 arr?s npnr Daris
prices. , f . Icating and Clearing Cable Trouble, Ul aK-1 " ll-ul un 10,
Mrs. Laura Wiggins is slowly "-jK. E. Lawson, Paris; "Taking Care Will be SOld QT ailCTIOn
proving from a fall which she recento joC the Company's Property' as We'Thnrsdai Fh PP
eceived. t I Would Our Own," J. Cager Head,' ' llUI U?" KU ' .CC
Mr. and Mrs. i.ee rcmi irae Bou iwrenceburg; "How the Automobile aeSCripilVt: OUVU IIJL-
2 ot lhe
Citizen.
-. to bionaa 10 spenu lu ibu.u.. Compares With The Horse and Wagon mpnt on nane
Mrs. Clyde Rice, of Lexington, 1- E chambers. Frankfort: "Our Ames- KenfllCkian-
the guest of her parents, Mr. and Mr.-. T Truck William Bowling, Paris;
-M.-R. Jacony. .... r'The Proper Method to Locate Higa
f Mr. Claybrooc Jacoby is an e 10 . Resistance joints With Voltmeter'!
vle out after a several weeks nine-., f (Chart Demonstration). Wm. H. Can-
J of pneumonia.
REAL ESTATE TRANSACTIONS
Mr. W. W. Talbott, of near Ruddle-.
f pneumonia. PYinetor non' Pans; My PIanS tor Plant Work Ms. has purchased of J. Elmer
.-Mrs. W L Carte, of Lex ing tor. DurIng thc Year 1917, George w. Boardman and Chas. B. Walls, of Llt
las returned home, after a msii -jBennet, Paris; "How 1 Would Set ' tle Rockf the Horton farm of 102 acres,
a
SHOES
and
RUBBERS
;
Must Go
Despite the great advance in the price of Shoes and Rub
bers, we have greatly reduced all short and broken lines in
Men's, Ladies' and Children's Footwear.
S PREPARE NOW!
An opportunity offered you to suppiy yourself for present and future needs,
and take advantage of this BARGAIN CLEARANCE SALE !
Come here today
has
Miss Marj' Burbridge
'Poles and Do General Construction
ju n T:,ir n;in fV,. Cioiih.i
i mi i h i .fiNM iviiii:r: ifixvrz. iui j-Ld.uuu.
4 M""MJ-n, t rAntv he recent v'Work with But Little Assistance' ', Possession will be given in March,
ily. of Clark County, haj e lecently anQ Duncailf Millersburg; "Howl Mr. F. A. Chilton, of West Virgini?,
-moved to the ncishborhood. 'Keep My Stock Material Report Unpurchased of Mr. R. P. White, Jr., a:
Misses Margaret Ga and . Maoe Balance," C. M. Mynheir, CynUiiana; ,a private llrice hs 500-acre farm on
r .MpniiiL. ol ra.ua. ac 4 ... ,"Riio 'nntu I ' h p ifponrr r nnci Km-.
files," W:
Paine,
the Brvan Station nike. nart lvinc ill
T .rMi?erillia l . . i . -i-i ix x
COntlUUfj ,IT7, n TvnrT Pnrmat? -. . ... .f. l i.. i ij.
i ivuvuv vciiiijjibWf i.rwiw WW....,, Mr i-niiTon will converi uie nome ni-ii
Jiiver.-.a summer residence and the farm inlo
I a model stock farm.
Mr. Edwaru sneenan uougnt oi iurs
Hannah Butler, trhrough the Paris
r- u 1 1 e 11 Ti:1.
i.- ,.i,ocof1 hv Mr ' iteaity to. ner irauie cuLtust- un mn
recentl puruiasea oy mi. Hnnlev. of Louisville. Utrppfr fnr S2.100 cash. The Realty
1. ' .- -- 7 T U. UUW, .w. T,.,
BroBAUgiu litH. assistant treasurer of the Kentucky I Co. also sold to Mr. A. C. Menton.
,f Mrs. jaiut; i'
-atter a. visit to Miss Maggie Medlin
Mr. Steve Burbridge contiuu
' seriously ill at his home uear.Hutcllii Louisville; Open Discussion
.-son, much to the regret of his manvbodv
w friends. I
JCr. Bronaugh and family m i HANLEY IS REMEMBERED
iair Viotnp in Snencar
-soon uiuvc iu "if ""- -- --- j
.County,
and little
.. - , from the MaSSl3 I'lSUlieries auu vvdicuuusc uwpa, WHO reueill-iy luuveu. uuuu muiaiw w
son "vf , and are now wjtn was tendered a surprise banquet at the, Paris, a one-story frame cottage on
AUUlllUIl,
Distilleries and Warehouse Company, ' who recently moved from Indiana toi
Mepioruu "Jl; "" " ", , h Hotel Henry Watterson, in Louisville, Parrish avenue, in Henry
Mr. Wilmoths parents at their nome attended byn the officials for ?800
Mepiorial Hospital, and
Mr. Wilmotn s
5r Hutchison
TO ADMINISTER ESTATE
and heads of departments of the cor- Mr. W. H. McMillan, of Paris, sold
poration. Mr. Hanley was presented Tuesday, through a Frankfort real
with a magnificent gold Knights oi estate firm, according to the State
Columbus fourth degree watch charm Journal, twenty-six and one-half
Mr. Letton Vimont, of near Millers graded with rubies and diamonds, in acres of fine bluegrass land on the
fcurg: has been appointed in tni commenioration of his birthday anni- Versailles pike, near Frankfort, and
County Court as administrator of the Aersary and his long service with the known as the old McMillan place, to
etate of his mother, Mrs. Vina A i- company. Mr. James Phillips, of Franklin
wont, who died some time ago aiuu , Mn Hanley married Miss Mamie Me-fcountv, for $5,500. The tract origin
home in Millersburg. Mr. Vimont at Tjeott, sister of Mr. John McDer- felly contained 31 acres, and was pur
:
Ladies' Dark Russia Calf Boots
$6.00 values
Ladies' Dull Kid High Cut
Boots, $4.50 values... -
Ladies' Patent Kid Cloth Top Boots
$5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values ---
Ladies' Gun Metal, Button ,
$2.o0 values 'f.
Ladies' Felt Boudoirs, $1.00 values
Ladies' Felt Juliets, fur trimmed, S1.50
values, at -
S3.95
S3.49
$2.99
. $2.49
tA nn Men's Gun Metal, button and lace.
S1 RQ 53.00 values..
I I W J
j Men's Russ. and Platinum Calf English Walk
i Over, samples, $6.00 values
Men's Russ. and Plat. Calf Walk Over and
1 Beacon. $4.50 values. .
Men's Gun Metal English. Medium Toe Weits
$4.00 values .
.59
.99
Men's Tan and Black Romeos, $1.50 values,
at . . ,
Men's Black Felt
Slippers .
Boys', Misses' and Children's Shoes at Bargain Prices.
$4.00
S3.49
$2.99 5
$1.99
99
.49 J
Prom MacDonald-liiley Bankrupt Sale i
Men's High Grade M. & K. $10.00 and $12.00 Shoes.
ON
Varsity Shoes AA to D
SALE HERE AT ONE-HALF PRICE.
CpiOa U? uiiii . --.------ . JLUOL-l uiaiiajjci jl uio jl ana uinoc v.uaseU HUtLL,
. Jnc boad, with Mr. j. a. wbvu tue postal Telegrapn Co. The dis-; voare .ago by.
out-Atv The aBDraiserS OL Uie estate tniprv nlant. tit .Tiiiliis TCeaaler Sr. Ktara nlilv
Mr. McMillan, several
Dr. C. K. Wallace. Dr
& portion of it to How-
are James Burroughs, G. S. Allen and a rand! 0f the Kentucky Dis- ard Jeffars and Jatefsold the remain-
R7oW Letton. tillerie k, Warehouse Company. der backvto Mr. McMillan, v
It Pays To
Shop At.....
Paris' Greatest Shoe Store.
DAN COHEN'S
336 Main
Pris, Ky.
Where Beauty and Economy Reign.
-
x
i
:
:
:
:
Q
f
s
:
:
f
I
:
I