PAGE EIGHT
THE BOURBON NEWS, PRIS, KY.
FRIDAY, 1 EBRUAJtY W, 1$17.
V
' ?
MILLERSBURG
: :
DEATHS.
then the property of Hon. George C
Lockhart, a prominent member of the
Bourbon county bar, where she and her
family have resided since.
I John T.
McGINLEY.
McGinley, infant son of
Mrs. Woodford had a large circle of
friends and relatives who were loyal
and devoted to her, and who loved her
very dearly for the many noble traits
Mr. D. P. Jones was in Cincinnati
n business Monday and Tuesday.
.XTf O M Tnhncrm rf Polmmith
was the guest of Mr. C. R. Bonar and lir auu x ' oouu iwwmey, ujcj ot neart ana minu wnicn sne possessed
family, Monday. Wednesday morning at the home of his She was of a very hospitable and geif.-
Mrs w. S. Judy, of Lexington, ar- Parents on Cypress street. The bur- al disposition, and her home was the
rived Tuesday at the bedside1 of 'her ial tookiplace in the Catholic Cemetery gathering place tor those who loved to
Bister, Mrs. J.B. Cray. yesterday morning witih services at the be with her. She had been a lifelong
Th hanks and nostnffip. wpip grave oy Hev. Fatner Kugene ue- member oi tne .fans unnstian church.
closed yesterday, the occasion being Bruyn.
Washington's birthday. i
Misses Hazel Kerr and Dorothy i KELLER,
"Conar visited relatives at Maysvillc Miss Mattie Keller, aged sixty-one,
SENATE AND HOUSE PASS
THE "feONE DRY" BL!.
Mrs. Woodford is survived by the
following children: Misses Lou, Annw,
and Mary Woodford, of Paris, and Mrfc.
Ollie Steele, of Lexington; Mr. Willie r.i
from Thursday until Sunday. died at her home near Kiserton. at b. Woodford, of near Paris; and Hon.
Miss Ruth McClintock left Tuesday "oon yesterday, of paralysis. Miss Hal Woodford, of Paris, who resided
for a few days visit to her cousin, Keller was a native of this county, with her. Her grandchildren, Misses
Miss Mary Hayden, at Lexington. and was a sister of Messrs. Ike and Elizabeth and Louise Steele, resided
Mr. and Mrs. Clyde Rice, of Jake Keller, of near Kiserton, ana with her.also, and another granddaugh
Hutcfaiscn, were guests of Mr. and Mrs. Mrs. Rebecca Spears, of Columbia, ter, Miss Laura Steele, and two little
P. E. Peterson, Tuesday and Wednes- jio. The funeral arrangements had grandsons, resides in Lexington.
ay not been conmleted last nisrht. i Thn funpral was (held at flip ros'-
Messrs. J. G. Allen and R. L. Pow-,
ell are both improving. Mrs. Minnie
Hurst is able to be out again. Mrs. J. '
B. Cray is no better.
r The annual Junior Reception of
the M. M. I. will be iheld this evening
in the M. M. I. library and parlors,
beginning at 8 o'clock.
The Missionary Society of
Methodist church, met witih Mrs. May
dence on Winchester street
o'clock yesterday afternoon.
at 2:30
The s.er-
WILDER.
T. T M T "llr TTllt wswl ... irisinc ttrAn nntirlunf nrl 1-nr T7m 1 T '
I ill. J. ULLUlt VYUUt;i, ctgcu aii,", n;ca icc iyi;iiuui.i.tu uj jjjxu. u. i.
six, died of heart disease at the Treo- Sharrard, in the absence ot Eld. W. E.
ling Hotel, in Louisville, last weel, Ellis, who is in Martinsville, Indiana,
where he had made his home for manv for a ten-days' stay. The burial fol
years. He was the father of Mr. John lowed in tho family lot in the Paris
the Wder, oE High street, and a brother Cemetery. The pall-bearers were
o Mr. George w. Wiiaer, or the l.ou- i Messrs. J. t. wooaiora, sr., w. ,
Whaley, Wednesday afternoon. A good isvnie c iasiivine, in rans. .Besides ( juucKner, benjamin wooaiora, wainer
mfrram was rpndprpd these he is survived by two otner Buckner, urice bteeie ana John I
The Millersburg Dancing Club has children, Patrolman Abram Wilder, of
postponed the dance which was to thp- Louisville .police force, and Mrs.
have been given on February 21, until Glass, of Louisville. The funeral was
held in Louisville and the remains
were taken to Lexington for inter
ment on the Wilder lot.
Tuesday evening, February 27.
Miss Sella Craven, instructor in
frr dergarten, will give an entertain
ment in the Graded School auditorium
with her little folks, Friday afternoon
Mr. and Mrs. Harmon Ammerman
have moved to Nicholasville, where
they will make their future home, Mr.
Ammerman having gone into business
in that city.
Quite a number from here are at
tending the Laymen's meeting, now in
session at Lexington. Mr. W. E. But
ler and Mr. TSios. Thome have spent
the entire time there.
Mrs. Mattie Hawes wiho has been
SUTTON.
The funeral of Mr. George R. Sut
on, a .prominent farmer of the Broad
well vicinity, in Harrison county, who
died at his home near that place Mon
day night, was iield at the family hom.
Wednesday morning at ten o'clock,
with services conducted by Rev. J. B.
Jicnes. The burial followed in the
cemetery at Jacksonville, in this
county.
Mr. Sutton was a member of Ihe
Christian church
the guest of her mother, Mrs. America
Butler, since Saturday, left for her'Leesburg
home at Chicago. Wednesday. She i the Civil War he esposed the cause of
fras enroute from a visit to friends injtihe Confederacy, and was well-known
Florida, j i0 .jie Bourbon county Confederatas
The stock and ipersonalty of tli'as a man of courage and honor. He
late William Ardery and Mr. Frank vas seventy-two years old, and vms
Barton were sold Tuesday. Every- the last member ot a highly-respected
uijng uruugui. nugu pneus. uni suii
at $6 per barrel at both sales horses
Tery high at Barton sale.
The Mission Study Class of the
Young Peoples' Missionary Society of I
the Methodist church met with M:ss
Olive Fisher. Tuesday afternoon
Fisher.
: ;i
RELIGIOUS.
!
The Pastors' Aid Society of the
Presbyterian church will have an oil
day meeting at the manse next .Tues
day, February 27. A full attendance
of the members is requested.
Ua recent meeting of the congre
gation of the Christian church at Car
lisle more than $1,000 was raised in a
short time, in subscriptions ranging
from ?1 to $35. Of tihis amount $700
was paid in cash. The sum raised will
liquidate the indebtedness on tho
During ;onurrU
Rev. Dr. F. W. Eberhardt, of Dan
ville, Ky., will fill the pulpit at the
Baptist church at both hours Sundav.
The pastor will supply for Dr. Ebnr-
jhardt, at Danville. Sunday School at
The "bone dry" bill, which has bpn
the pet measure of the dry forces m
the United States Senate and the
House for several weeks, and which
passed the Senate last week by a large
vote, took its longest stride forward
Wednesday, when, after two hours ot
most uprorious debate in the House, it
was approved by a four to one major
ity. The measure, which would raise
an iron-clad barrier against the impor
tation of liquor into prohibition States,
is expected to receive the approval of
President Wilson within a week, thus
adding immediately to the "bone dry"
territory about one-third of the Unittd j
States. !
The provision is regarded as the
most far-reaching that could be enact
ed by the Federal government, and as
sweeping as would be possible unuVr
any method short of national prohibi
tion amendements. It would cut off en
tireiy liquor importations, amounting '
now to millions of dollars annually, in
to the large number of States which
have forbidden manufacture or sale,
but have permitted importation tor
personal use.
Advocates of prohibition were di-
vided amcung themselves over the ex
pediency of the step, some friends of
the cause declaring so drastic a law
would have reactionary effect. In the
same way those who have opposed pro
hibition were not unanimous in tne
opposition when the vote was taken up
Tlie vote as officially announced, was
321 to 72, but .a recheck of ttie roh
changed it to 319 to 72. Party lines
were completely broken down, and nu
merous Representatives from prohibi
tion States were recorded as opposed
to the measure. So large a vote has
seldom been recorded on any meas
ure ever before the House.
A provision barring liquor adver
tisements from the mails in States
that prohibit such advertising is in
cluded in the measure, whicih came be
fore the House as a rider to the an
nual postoffice appropriation bill, in
serted by the Senate last week on
motion of Senator Reed by a vote of
55 to 11.
Some members have taken it as their
opinion that legislative measures ad
ded to the postal bill would not be ef
Comitig
Attractions
PARIS GRAND AND ALAMO
FRIDAY
HARRY CAREY,
EDBTK JOHNSON
and MARC FENTGN
IN
"Behind
the Lines"
A military drama. Also
Edwin Stevens, in The
Aeroplane Accident,"the
12th episode of '"The
Yellow Menace."
SATURDAY.
''BLIND JUSTICE"
Written, produced and featuring Ben
jamin Christie. A Blue Ribbon Feature
"Spunk Speed," Biv V. comedy.
MONDAY.
Marie Doro in
"THE LASH"
Produced by Famous players.
Helen Holmes in the best and last
episode of "A Lass of the Lumber-lands."
Hours Alamo, 2 to 5:30; Paris Grand,
7 to 10:30, Admission 5 and 1 Oc.
leader;
family that had passed all their lives I1 u- -10' J- l- mciter,
on the same farm on which they were ' evening worship, 7:15.
born. In tne attendance contest between
the Baraca (men class) classes of the
Paris Baptist Sunday Scihool and the
Maysville Baptist Sunday School.
The firs
had 45
9:30; morning worship, 10:45; B. Y.fective until July 1, the effective date
HERR1N.
Mr. Thomas Herrin. of Paris, re
There was a good attendance and an ceived a telegram from the military nu- Paris is ahead by only two
interesting nroEram was rendered. itiinrftina nt th Sniriiora' Hnmo in Sunday of the contest Paris
Mrs. J. C. Leer, Jr., while prepar- J Washington, yesterday, telling him (,i ,aml Maysville 31. Last Sunday May
ing to come to town from her home the death of his brother, Chas. Herrin. ville lia(1 52 an(1 Paris 40- Tne Paris
Monday afternoon had her buggy de- jr Herrin had been in the United Baraca's have a flght on hand to win
molished by the horse getting loose states Arm , , H and win they will. Help us beat Mays-
irom the hitching ipost before leaving . . . TT " vIHp'
was a memuer oi tne u. a. Array corns
thnt cow corvino in Pnha nnri tnnr .iw Lent began Wednesday and will i
ling ipost
the home. Before the horse could br
stopped the buggy was badly damaged.
The recital given on Monday even
ing at the Christian church under the
auspices of the Ladies Aid Society by
of the appropriations it carries. Sen
ators and Representatives who are con
sidered authorities said that all the
legislative riders, including the Ret-1
prohibition amendment undoubtedly
would become operative as soon as tho
President has signed the measure.
in all the principal engagements there continue for forty days, when the de-
during the Spanish-American war. He VOUL cuurcn peopie win
wjiR in tho Rnn .Tiinn win pnnmon worldly amusements and
abjure all
fast Wed-
Uk: AW WiRnn ncc?ctp,1 hv Tl.tr nnrl in nthprs onnnllv nnto,l Af uuay was AHll weuuesuay, WHO was
Fennell. of Lexington, was good and oIorp nf tlm war lm Wns hnnnrnhiv observed in all the Catholic and Epis-
vell attended. Elder C. O. Cossaboom discharged, fronuthe service and, while C0Dal churches. The Linton season
Sirrri n ppH thorn tn the niiriionpp in i)u ., .... . . puris with Tnatpr whioh thio voar fnllc
uiMwuuvwu w.vm w ..w vww .-.. aiittaptrcr Tt-nrn n altcrrir nfnnnri l'aAanr. .- ...,.. .uww, ... v..w j . ... i
. auuviu.fa "iu c Oiibiii, .iwuuvi &,- . ..
on Sunday, April, 8. The Lenten aea-,
Charles I. Frohman. of Columbus,
Ind., spent more than $365 to make a
calendar he gave to his sister, Mis3
Lillie Frohman. Frohman used a $1
bill for every day of the month on hisi
fancy calendar, and at the top he
showed the moon changes, making the
moon of a $5 gold piece.
The Worst Handicap
in the world is WORRY it ties a man hand and foot
takes off the edge of his talents and cuts down his
ability.
WORRY as to what will happen to the family if any
thing should happen to you, will do more than "anything
else to reduce jour earning power.
LIFE INSURANCE solve the problem the day you get
your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
I The Northwestern Mutual Life iosoreoce Co.
R. F. CLENDENIN, Associate General Agent
Suite 201-202 First Nat'l BanK Bldg. PARIS, KY.
son marks a general cessation of so
cial affairs.
The Christian Endeavor SociPtv
mfffHrr' frnnS n slicht
ring to Elder Fennell he said tlioy ed in battle at San Juan Hill, he was
were classmates at Transvlvania Uni- transferred to the Soldiers Home at
versity aiU since leaving school they Arlington, Virginia, just across the
m? alnn c lis on ?n tnurh with nnrh Pntnmjio Rivp.r frnm Washincrton. Thp.
other. The numbers by both wero telegram to Mr. Herrin gave no partic- of the Christian church will meet in
veil rendered. They were the rccini uiars. The funeral arrangements had
onts cf continued applause and re- not beeil completed last night,
sponded liberally to encores. An infor- -
mal reception was held at the close of
the entertainment, to which most ev-'
orvnnp. rftmnineil. and a. social tiini
oc aninrml Jv -ill Mice WHenn Of
rfves promise of a bright future. Shi
RENICK.
Funeral services over the remains
Mr. Scott Renick, of Winchester,
who died suddenly in Havana, Cuba
is a splendid reader, one of our home last week, were held at this late home
girls of whom we are justly proud, on South Maple streat. in Winchester,
and is thoroughly devoted to ther work. Tuesday afternoon at two o'cIock.
the church parlors Sunday night at
the usual ihour. The subject will be
"The Home Mission Boards," leader.
Miss Jeanette Link. The Mission
Band and the Triangle Circle will fur
nish the program for the C. W. B. M.
meeting next Friday afternoon at
2:30. This will be the annual elec
tion of officers and a full attendance
of the members is urgently requested.
Mr. Fennell is also a good reader.
Miss Wilson has a number of other
readings booked for the spring An 1
conducted by the Rev. William Cum
mins, pastor of the First Presbyterian
:JLriL ZZa" IT ii" "K. "If .," - church, of Winchester. Rev. Mr. Cum-
nuiiiUici, aiiu we. &iauij v;omiiiuiiu jiui . ...
and endorse her work wherever
jjoay go.
she
HUTCHISON.
mir.gs in his remarks paid a high trib '
ute to the deceased, who was one of J
tiho best-known and most popular ,
men in Winchester. (
After the services at the home the i
MATRIMONIAL.
TABB HOFFMAN.
Mr. Miller Hoffman, of Mt. Sterling.
. remains were interred in the family well-known insurance man, who is
lot in the Winchester Cemetery. A well and favorably known here, was
large concourse of sorrowing relatives married at the home of the officiating
and friends followed the body to its minister, Rev. Mark Collis, in Lexing
last resting place, where it was plac- ton, Tuesday, to Miss Mary Vansant
ed beneath a canopy of beautiful flo- j Tabb, also of Mt. Sterling. The at
ral tributes, which attested the high tendants were Miss Hazel Grubbs. Miss
Mr. Ennis Jordan has rented the ' esteem m which he was held in the Anna Lee Young, Messrs. R. E. Toms
Hugh Ferguson farm for the coming 'community. and Hunt Priest, all of Mt. Sterling,
year. The active pall-bearers were: Webb The bride is the daughter of Mr.
.ur. iienrj iiciue ik ame to u Johnson, Reuben Franklin, W. P. 'and Mrs. I. F. Tabb, of Mt. Sterling.
a severe inness oi pneu-, Hampton, Vic Bloomfield, Dwighljand is well-known and very much ad-i
Bowden, and W. T. Ogden. Honorary mired in Paris, where she has been '
Mr. Lee Peim is able to be out af
rer a brief illness. "
Mrs. Laura Wiggins is convales
cent from a recent illness.
Our Big Bargain Giving
1 "H
gms i .v mm
0AD!
g
Cotinues Unabated,
bringing you the great
est avalanche of shoe
bargains at a most op
portune moment.
REAP NOW
YOUR HARVEST
of our unlimited re
sources; our many years of merchandising knowledge;
our prestige in the world's greatest shoe markets.
THIS WEEK
more wonderful bargains, greater values, greater
economies that will simply force you to buy now for
future as well as present needs.
SALE
V r
V
r
$ ) a
I Gz n' Si II
N. Ford Brent, S. D.
out, after
raonia.
"MVc "T TT! Pnrnontop ic nuiro Ml
with PTiPiiTTinnJn af lir hiniP lip.ir I pail-DearerS
Hutchison. jGoff, J. K. Allen, R. P. Taylor, Levi
A valuable driving mare belonging Goff and J. M. Benton.
to Mr. Alonzo Ginn dropped dead Mon- j Among those from Paris who attend-
i
day afternoon
The children of Mr. and Mrs
Pridemore are confined to their home
with the mensles.
Mr. Lee Penn lost his family driv
ing horse this week. The horse vsi,
thirty-seven yeans old.
Mr. and Mrs. Frank Smart are re-1
on the arri-1
a frequent visitor and attendant upon
the numerous social events in the city's
social life. Mr. Hoffman is the son of
Mr. and Mrs.' Albert Hoffman, of Mt.
Sterliug, and a brother of Mr. Harry
Hoffman, prominently connected in in
continues quite . nigniy respected residents oi the city for a Southern bridal trio
, celving congratulations
val of a fine daughter.
Miss Anna Bagg
ill at her home on the
pike. A trained nurse is
Der- w ,..,. -, j lowing an illness of several weeks, due
-ine : saie ox it. wiiiiam v.abe yv innrmities 0f age
ed the funeral and burial were Mr. an 1
Mrs. B. M. Renick, Mrs. Wm. H. Ren
ick, Mr. and Mrs. Duncan Bell, Mrs. surance circles of the State. He is a.
Fanniebelle Sutherland, Mr. Clay nephew of Mrs. Charles Scott, wife of
Sutherland and Mr. A. R. Dennison. Mr. Charles Scott, manager of the Lex-
lington Opera House.
Afttjr the wedding the bridal party
had luncheon at the Phoenix Hotel,
WOODFORD.
Mrs. Mary Halleck Woodford,
aged ninety, one of the oldest and mos4- after which Mr. and Mrs. Hoffman left
On their
Lexington or county, died Tuesday night at the
attending i family home, on Winchester street, fol
well attended Tuesday, larming im
plements and stock bringing gocl
prices.
-Mr. White and family, of Muir.
return they will reside at the home
of the bridegroom, in Mt. Sterling.
Mrs. Woodford was the daughter of
Jacob and "Lucinda Dill Halleck. She
was born August 31, 1827, in Bourbon
will move the first ot March to his 'county, and was married in 1846 to Mr.
farm near Hutcihison, which he re- j William T. Woodford, of the North
cenuy purcnasea oi jurs. tieiue ttoss Middietown vicinity. After their mar-i at Hazard,
.riago Mr. and Mrs. Woodford came to 'Mitchell was
:DANVILLt I-AIK WUUNU5. fcULU. j parigf where Mr Wo0(lford was fov
i several years engaged in the dry goods
The Danville fair grounds was sold business, which he gave up later, and
Tuesday afternoon at public auction t became a farmer.
Dr. J D. Jackson for $13,325. The I Mr. and Mrs. Woodford acquired a
Dam 'lie Fair Association will be dis- large estate, comprising about f.20
solved and it is not likely that another j acres, on which they resided for many
fair will be held there. The grounds years. Mr. Woodford died in 1889, and
will probably be cut up am used tor after his death, Mrs. Woodford pur
bHilding lots.
Ladies' Dark Russia Calf Boots
S6.00 values
Ladies7 Dull Kid High Cut Boots
$4.50 values
Ladies Patent Kid Cloth Top Boots
$5.00 values
Ladies' Patent and Gun Metal Shoes
?3.50 values
Ladies' Gun Metal, button, 82. 50 val.
Ladies' Felt Boudoirs, 1.00 values
Ladies?s Felt Juliets, fur trimmed
1.50 values .
$3,69
2.49
1.99
1.69
.49
79
Men's Russia and Platinum Calf Walk-Over
and Beacon, S4.50 values $3.49
Men's Russia and Plat. Calf English Walk
Over Samples, 6.00 values $4,00
Men's Gun Metal English Medium Toe Welts,
$4.00 values $2.99
Men's Gun Metal Button and Lace
S3.00 values i .99
Men's Tan and Black Romeos
$1.50 values 99
Men's Black Felt Slippers
75-cent values 49
chased the home on Winchester street, 'b. Marsh
BIRTHS.
To the wife of Mr. Lewis Mitchell,
Ky., a daughter. Mrs.
formerly Miss Nancy
Napier, of near Paris.
To the wife of Mr. Henry Chism,
residing on Cypress street, in this
city, a daughter, Mr. Chism is con
nected with the Louisville & Nashville.
To the wife of Mr. Harry Marsh,
yesterday, at Massie Hospital, a fine
8-pound boy Lew Nick Marsh named
for his grandparents, Mr. and Mrs. B.
Ladies' Dawn Grey Kid, Also Mahogany Tan, Most Fashionable Boots at Almost
ONE-HALF THE PRICE YOU PAY ELSEWHERE
Boys', Misses and Children's Shoes at Great Bargain Prices.
FROM THE
MacDonald-KHey Bankrupt Sale
Men's High Grade M. & K. $10.00 and $12.00 Shoes
Varsity Shoes AA to D
ON SALE MERE AT ONE-HALE PRICE
DAN C0MEN
335 Main Street, Paris, Ky.
Paris' Greatest Shoe Store.
r
:
JN