PAGE EIGHT
THE. BOURBON NEWS, PARIS, KY.
i
.
H :
M
.
I
;
1 '
in
?
Y t-
r.
V -
'Jf
MILLERSBURG
4. land three sisters, Miss Cordie Owsley, cv JBIrs. Clinton Earle Hooven, and Mr. j
sot rans, Mrs. L.izzie insane, 01 jnor- w
DEATHS. ,ida, and Mrs. Emma Scheidermantel, MATRIMONIAL.
4 'of Minnesota.
I ,
ERD.
FUDOLD.
Mr. P. X. Erd, aged eight', a former
. i
, seven- resident of Lexington, died in Chatta nesday trom tuie ottice ol me Fayette "l"u" " 'ueu uim rmiumuu uuu ,
5. John noora. Teitn.. Monday, -of the infinni- County Clerk to Mr. Jasper Craycraft. .uiuuieiown socieo auenuea en masse,
of his ties of age. The body was brought tu 25, and Miss Lorena Vice, 18, both of uie eenL oeuig one ot tne most im-
iDortant recorded m tne citvs socia1
Mr. O. E. Hurst was in Louisville.
Wednesday and Thursday on business.
Miss Edwian Ammerman returned ' The body of "VVju. Fudold
Tuesday after a visit to friends at months-old son of Mr. and Mrs
Paris. Fudold, who died at the home
ffcrr-Mrs. O. E. Hurst left Wednesday parents, on Eighth street, Sunday, was the home of his son, Mr. Charles Erd, Bourbon county
foir a visit to her sister. Mrs. Wollimio, buried Monday in the Paris Catholic in Lexington, Tuesday, and the funeral
nr i .iih i -iHsi'iii. ill. rpnu'iHiv vnc npin rnnro i npm; v : irprnnnn : r i u . uj"ii i u.
Mrs. Clara Shanks and daughter. , 2:30 o'clock, with services conducted The engagement is announced of an elaborate reception being held, to
2vlrs. G. L. Hill, are confined to their WHITLEY. by Rev. J. W. Porter. The burial fo'- Mr. Ralph Kneiss Scheffer, of Loui- lowed by dancing in the spacious bail
homes, with grippe. . ' 'lowed on the family lot in the Lexins- ville, to Miss Elizabeth Fisher, of Lou-j room. About 1 o clock t-ie bride and
Mrs o W. Ingels entertained with A telegram received by Mr. Wade II toll cemetery is ville. The bride-elect is a daughter , groom bade a merry adieu to the danc-
a dining Wednesday, in honor of he- Whitley, of Paris, bore the sad an-j Mr Erd was a member ot the firm of Mr. John 1. Fisher, formerly oilers and were driven to Cincinnati
sister, Mrs. B. H. Dorian, of Monnhis, nounccment of the deatili of his moth-'of Sutt0n & Erd, furniture dealers in North Middletown. (from whence they went South or a
.er. .Mrs. .m. J. wintiev. wnicn occurred ' i v., ,ro,., o t,i 1,0,1 i,a,, monui s ueuguuui uoimymuuiiiii
iinnrni CVl'C
Robert Wilson Itenick, son of Col. M. I fijt 7"! IT I t! 1 1 Ml 11
V. Renick, of Middletown, which was' If 1 I II VIJULLI 1 v
SPECIALS .
celebrated with much .brilliancy and i
splendor, the ceremony taking place at !
8 o'clock at the First Methodist Epis-j
1 copal Church. Rev. Arba Martin ofiici-t
CRAYCRAFT VICE
-A marriage license was issued Wed-'ting. Several hundred wedding invi
Dortant
jannais. At tne kiks lempie tne wee
ding festivities burst into full swine.
For This Week
$1.90
25c
Tenn
&. i
uf liin linnirv Jn Dnntnirn XT-tll fnrtn. - - ... . . - Tl IIITA T" TT7 l" T I ui rrTiycr firof fl i Pi tl oil 11 TG t OTIll than
Rev R C Goldsmith nastor of th L IIW1 "w," "' x ""-cfa n... uaiu- ,1)aking his Home in Cliattancoga lor uauiu jmumv i . ii'" " . ""' "r A, ", X
BanUst church who resides at Owe llIla' Mon(la MIBht- Mr- Wlutley lelt several years with his son, Mr. Charles' Public announcement of the mam-.going down into Southern Florida On
fon came here las .week in his ; auto- for his old lvome immediat0,y on r0 Erd. He leaves five "sons and three age of Miss Mary Caroline Baird. ot their return Mr Remck will establish
weuth i'L Ul ,",Vi "-"J """'" Ul,v- "- (laugnters: .J. U. mra, or uincinnati, ooulu umue&i.un, wmu, n. omuu., .. w. ... .....v- v ... ...
IE. B. Erd, of Atlanta, Ga.; C. D. Erd, S. Ardery, ot Fans, was maue at aouui,iumuieLown.
!of Lexington; Mrs. T. M. Bryan, or Charleston, Ohio, Sunday. The wed I "The out-of-town bridesmaids in tii
iok .. . M.n w at C5iu ,.r riino- will fnk-P nlfft jit the home of Renick-Hooven wedding party. Miss
V MiUiaiuuKa, .his. x-.. ah. uuiuu, ui "o ..- t - - - -
InnTkSlv nvl wititin- f r 4li ocktrkirk
xuuiic anu wnib w i.. ,w. ... , burial
er, has been snowbound and imau& '
to return. j
i
MADDOX.
ati- t r. Alien nml dmif?lit.P.rr. i I lie funeral of Mr. Jos. Alaudox, DOWn,it QV,.in no wn tho wnniifj thn bride's narents. Mr. and Mrs. Ld-'UIadys Bievins, ot bt.
MPSflaines' O. W. Imrels. S. M. Alien Jised forty-three, who died suddenly th" ,f Tr. prpfl Frd. nf Paris, local ward Milton Baird, on Wednesday, Rachel Capen, of Boston.
a t? u r;-. tiin loHnr nC M nm. ' Sundav at the home of his daughter.' , - ft, Ainu,n o,i ti,0.p..v;E .Tjimmrv 91 .Miriam McDonald. . it Pi
piiis, Tenn., were guests Monday of Mrs. William Mathers, near Midway. Grand 0pera House. ,ho attended tho . . e(1 to their homes.
Mr. and Mrs. J. M. Alverson, ai was neiu luoimay, une iiueimeiii m funeral Tuesday alternoon. ii'istuu buiuvu,.
.the Midway Cemetery folio wing tiie
Louis; Miss
and Miss
ttsburg. return
CROMWELL.
flsmrpptnwn
-v-ww.i- -- --- I . . . . - -
the services. Mr. Maddox is survived
The first number of the Lyceum bv four brothers and three sisters, one
Course, given under the aspices of tho of whom, Mrs. Lucy James, resides in Tm James W. Cromwell, one of Har
Millersburg College Y. W. C. A. is tiu Paris. 'rison county's most tnroKressive farm-
Helen May Abbott Concert Co., and
will appear in the College Auditorium
Friday evening, January 10, at 8
o'clock. The Lyceum Course Wiis sev
ers and business men, died at his home
on Main street, in Cynthiana, Sunday,
McNEES
The funeral of Mr. Berry McNees, after an illness of about two months
noPfl fnrfv-Piirht.. whn dine! at his lining, Mr. Cromwell was born in Cvnthi
son consists of three numbers funusli !at Robinson, in Harrison county, was ana in 1840, and had spent nearly al.
ed by the bureau and a play, presented ,el1 aL t(iie christian church in that his life there. His mother was Mis
by Miss King's Expression Class. ' pace Saturday, followed bv burial in Elizabeth Miller, a sister of Mr. James
Season tickets for the four numbers. jIlA pVfhinn rnmetprv nt Bnrrv. Mr. .Miller, who owned "Sunnyside Stotlk
25 pounds Sugar-.-
Ail Canned Goods
2 cans for
Best Grade Flour, 24-pound
sack $1i23
Beans, per pound... 1 2 1 -2c
Por Chops
per pound - -
Lamb (best cut
per pouna
20c
entitling purchasers to reserved sats
are ?1.00.
The following are the interment.-.
McXees was a prefninent farmer of Faiyn" on the Cynthiana pike, and of
his community, lie is survived by his Mrs. Margaret Miller Patterson, of
widow and four sons, three hrothrs Bourbon county.
MlSrPrT d rinr t r 'd tour sisters, one f the latter, Mrs. Mr. Cromwell resided for many years
fn Millersburg Cemeterj dunng tlic,-. . ,.,.. '.., , rin,.u. '.. .(, i.nWi:i r.mV" fnrm nn Mip
,-v,o- nr 1Q1C Phorlio rnllirio infa nf i ,lal iiowu, itoiuijit, in ""'""" -" '- .-w .. -.- ...
n Trlm n Ttni-rU Ti Honrv "Rnrrlpn CMiilC0UnJ
of JoOin C Burden, Mrs. Mattie E.
Boulden, infant of Gano Duncan, Mrs.
Mary E. Collier, John F. Caldwell. Ru
fus Leonard Kelly. Henry D. Miller.
Mrs. Alice Wadell Johnson, Harrison
W. Trigg, Thomas McClintock, Kathei
ine Riggs. William Ardery, infant
The imarriage of Miss Julianne Fio- SMALL PUBLISHERS MAY
ter, of Scott County, to Mr. Louis, OWN PAPER MILL.
Burke, of Georgetown, was one of th"
social events in Georgetown last u (, ciiappell. of Middlesboro. has
week. Rev. Father DeWaganere of iUen twentv-five small publishers
St Paul's Catholic cliurch ohctated. Kentucky, Tennessee and Virginia
TTon NheFS:Sst ofUco!lt to meet in Middlesboi-o on Saturday
county. and is a most highly accom- morning. January 20, for the purpose
plished voting woman and a skilled of making scpe effort to establish a
musician. She is a sister of Messrr paper ,pulp (mill near Middlesboro, to
John and Charles Fister, of Bourbon manufacture newsprint paper for the
county. After a honeymoon trip u gmaii papers in Kentucky, Tennessee
Northern cities they will reside on the. amI Virginia.
Offutt place, near Georgetown. I AU otner pubijshcrs not included in
T3nnivrTrn unpicix the written invitation are urged to at
BBDINGBR HOPKINS. . business is such
,. ,1? 1? '! Cli;. ..y..tt. w..,
rue weuuiiiK oi ins& oaiuu iiuw
20c
MflRGOLEN'S
THE SANITARY MEAT MARKET
fc
CH1SHOLM.
Mr. Selby L. Chisholm, aged sev
enty, died suddenly Monday at his
home in Cincinnati, death being as-
Ji jrribed to the shock occasioned by his cynt.hiai
of J wife's death, which occurred last week. rs
. 'I'mp wprimnir cii iviis oiiiiiii uutci- .. . . . , it
Millersburg pike, which he Purchased ;"-'--""" d M Thos that they cannot attenu, tney ure ru
after leaving Cynthiana. Desiring to KSelpSi; Ala!1 Quested to write letters to Mr. Chap
letire, he removed to Cynthiana about . fftnvPnlano ATnnrinv nfternonn at .oell, stating the amount of print pa
... . . .!!. UllUlUI. UWUn. MIIH-K iw.v.j --w.-. ...
ten years ago, selling me larni, which
is now owned by Mrs. Lizzie Keller.
He is survived by his wife; one son,
Mr. John M. Cromwell, cashier ot the
ana National Bank; two daugu-
iss Lillie C. Victor, and Mrs
John D- Parrish. John G. Smedley. He is survived by one son, Nathan I Fral'lk Nortllcott, both of Cynthiana;
infant of John Parnsn, Robert L. Wil- Chisholm, and one daughter, Mrs. El- aml twn sjsters jjss Maigaret Crom-
son,' Mrs. Laura Cleaver, Mrs. Lizzie jmer Kendall, both of Cincinnati. He jj of vjtiiiana and Miss Bettie
htirnian, James H. Letton. Fannie Mc-jvas a brother of Mr. John J. Chis- f'roinwen 0f Morehead.
Clelland. infant of Ro Coy, John H. holm, of Paris, and of Mrs. Stuart Wil- rr,,. c' ..i .. i,'i ua ri,,.;
Marr, Jr., Mrs. Lavina Vimont. Theie son, of Lexington. The funeral se.'- t- ohurch Tuesday afternoon at tvoi?llia11 velvet nat
Avere
there
lu 1914
Our phy
coutqmpl
ness.
or get
5:30 o'clock at the home of the bride's -per they use m a year, tine price ior
parents. Mr. and Mrs. Everett Bedin- same one year aga. and what they are
ger, at Anchorage, Ky. paying now and any other information
There were io attendants, and Ue an(j encouragement they may deem
Rev. Charles Henry Pratdier, pastor of necessarv and profitable for this meet
the Anchorage Presbyterian church, ing
performed the ceremony in the pres-t Paper nas gone up n the last year
ence of the bride's immediate family d d an
TrniiiPfliatelv follow- SClUUOn OL Liiu mstt&piiiii, ii'ci o.c
The pine and otaier pulp roauc j
NEW YEAR'S
GREET!
,-... "Tr 'mil "VTrc Himi- tinn
xriv-xxj ix)i?& liiiiirruii in -& i ii'in -n-c" i-nT"f nnni it iiiii i-ui:iiii)iiiii i .. iir iiiii .t. itiuT - -
were in 11)15. and four le.s than Cincinnati. Wednesday afternoon a T'n 1 ; nn,.n t (H I-l W"S left tor Lexington, where they will ing woods of this section uill supmy :
. Millersburg is a healthy placo.nvo o'clock. V' "' ru,. ; " r hnrHi The burial ,s'emi several nays as guubLb m ..n. a turn ot ntty-fon or more cup.u. u. .
sicians and undertaker are ' nwn, i 1.iip p.i-ovp remeter , Hopkins' relatives, auci wuiu. t. , S0Veral years and will solve tne soia-
ating going into other bus. OWSLEY. tih. mii.i,Mror: woro Robert Ward. J lwl11 makc Ul.eir ". " ;J"!Ji'" tion of newspapers being forced to pay
as the people here will not die The funerai 0f Mr. James Owsley. Miller Ward, W. II. Nortlicott. W. G n,e )"roo.m,lsr a " ', . Liitip tn,st prices for prinL paDGI' The eX'l
. Sick. n f,.f,.,vi, .!, .Mn.i ot li liooin, ,Tr- ,7. i. iirn. i tr.,,iini J COUIlty. hawig ieSlUt.(l nun uini nr.inn. i,oinr ,,oii? for nrint n:imr
rtSCU JUiLfcism. nu uivu til- cuv. iiuin AltllVtil!. I' lillllt t) Una mill jmmmuii . . i.r,.,.n rrnnict . , v,uaa 11 iv uwii.fc, j.... .-. , z
KENTUCKY ELECTORAL VOTE
DEPOSITED IN WASHINGTON
of 4iis father, Mr. Thomas Owsley, oi. Renaker.
'High street, u ednesttay afternoon, was
held yesterday afternoon, at 2:30
o'clock, with services conducted t tho
Kentucky's electoral vote, cast at grave in the Paris Cemetery by Rev
Frankfort, January S, for Woodro v W. E. Ellis, pastor of the Paris Chris
Wilson and Thomas R. Marshall, was tian church.
JDcmopolis to reside.
SAFETY FIRST" LOSES
VALUABLE LOT OF POULTRY
HOOVEN-
by the cmall publishers in the three j
Suites above mentioned will, as esti
! mated in a year over pay for the con
RENICK
The Hamillo-i, 0.) Daily News ha struction oi a p-iper 311 ip nun.
im rniinwinir recardimr the recent I
Believimr corn was not fit to eat marriage there of Mr. Robt. W. Ueii-
ATr DwsIpv had lieen an invalid for irc Honrv IIpIitiv of SvnVmes Corner, irk, son ot .Mr. .uums
Renick. o
EFFICIENCY COUNTS.
ueposuea wun uie ice rresment a: iir. uvssiey na ueen an mvaiui ior Mrs. Henry lieiim. 01 symmes i onier, uv, awn wi -" - - -. .
Wasliington, Tuesday, by E. W. Creal. several years, having received a par Ohio, emptied the can in the chicken Middletown, O., formerly ot 1 aris. j
ot Hodgenville. official messenger of tial stroks of paraljsis about two year", vaid and as a consequence she lo' "The traditions ; of one ol Hamilton ( h
the thirteen electors. Mr. Creal, who ago, which had kept him confined to three dozen chickens, two dozen tur- ond one of Mulletown s most . I'J "" '"jnv
deposited with the Vice President at
It's their efficiency and solid worMi
hat makes THE NEWS advertise
mantc -r vnlitnhlo Whon t.-ll AVntlt
- --., 1 ' lUlLlO 3J Mil UUUiVt JWi. yvw .
arrived in Washington, Tuesday his home. Besides his father he is kevs. a dozen truineas and probably nent famines were uuucu iuuio j ieal service an(i results, call either
morning, will return to Kentucky to- survived by one brother, Mr. Grant the balance of th poultry as a resin evening b the marriage ot miss .u phone V1A. THE NEWS' service cov-j
morrow. Owsley, of the firm of Owsley & Harris, oi ptomaine poisoning. rion Hooven, only daughter ot .Mr. an . a arge ton.itory an(1 XEWS adj j
EM
n
11
ANtE
In All Departments!
AU Winter Shoes and
Rubbers Must Go!
Despite the great advance in the price of Shoes and Rubbers, we
have greatly reduced all short and broken lines in Men's, Ladies' and
Children's Footwear.
PREPARE NOW!
An opportunty offered you to supply yourself for present and future needs. Come here tomorrow
and take advantage of this BARGAIN CLEARANCE SALE!
IHHHI S
0 lib Si MM
I fl ;
i
are always result-producers.
Wishing you 365 days
of
HEALTH,
HAPPINESS
and
PROSPERITY
in
IB 17
We are yours truly,
WILMOTH
Grocery Go-
Ladies' Dark Russia Calf Boots
$6.00 values
Ladies' Dull Kid High Cut Boots
$4.50 values
Ladies' Patent Kid Cloth Top Boots
5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values
Ladies' Gun Metal, button, 2.50 values
Ladies' Felt Boudoirs, 1.00 values
Ladies's Felt Juliets, fur trimmed
1.50 values
$3.95
3.49
2.99
2.49
1.69
.59
.99
Boys', Masses' and Children
Men's Russia vnd Platinum Calf English Walk- ,
Over Samples, 6.00 values $4,00
Men's Russia and Platinum Calf Walk-Over
and Beacon, S4.50 values. 3.4-9
Men's Gun Metal English Medium Toe Welts,
$4.00values 2.99
Men's Gun Metal Button and Lace
$3.00 values 1 -99
Men's Tan and Black Romeos
1.50 values : : .99
Men's Black Felt Slippers
75-cent values 4-9
s Shoes al Bargain Prices.
PROM THE
MacDonald-Kiley Bankrupt Sale
Men's High Grade M. & K. $1 O.OO and $12.00 Shoes
Varsity Shoes AA to D
ON SALE HERE AT ONE-HALF PRICE '
3D
Paris' .Greatest Shoe Store.
L.
1ST
COHEN
335 Main Street, Paris, Ky.
Corning
Attractions
M GRAND ANU ALIO
fRIDA
Tyrone Power and Lois
Weber, in
of 6od"
a Bluebird production.
Also Edwin Stevens, in
"DROP OF BLOOD"
Seventh Episode of "The
Yellow Menace."
SATURDAY, JAN. 20.
Valeska Suratt in
"Ths Straight Way"
. woman's quest for happiness. Writ
ten and directed by Will. S. Dayis. Fox
Film Corporation.
MONDAY, JAN. 22.
Lou Tellegen in
"Victory of Conscience"
Famous Players.
Helen Holmes in "A Lass of the
Lumberlands."
Hours-Alamo, "2, to 5:30; Paris Grand,
7 to 1 0:30, Admission 5 and 1 Oc.
i
rr
Vie 7addy tycm"
always feels himself a "buffer" between the knocks and
hardships of the World and the helplessness of the child.
This is all right while he lives-but if something should
happen to the father, who will be the 4 'buffer" then?
87 1-2 Per cent of all estates left for administration con
sist only of Life Insurance-how unwise for a man to
think that he is all sufficient in providing an 'estate for
those he loves. A
LIFE INSURANCE is the only sure
way.
The Northwestern Mutual Life Insurance Ca.
R. F. CLENDENIN, Awociate General Agent
Suite 220 First Nat'l BanK Bldj. PARIS, KY.
I
i
MtttttttMp
t
t4 A
- ,y
4t ' TrJ
2 - Jf
A
."V
i- rIJ
Si -r ,A
Ty
. i '.
s
-IVv.
.