PAGE EIGHT
rt-v
THE BOURBON NEWS, PARIS, KY.
TUESDAY, MARCH H, If 17.
r
"EVERYWOMAN" AT THE
LEXINGTON OPERA HOUSE
On of the distinguished character
istics of a dramatic spectacle, "Every
"Woman," which Henry W. Savage will
er at the Lexington Opera House,
BOWLING LEAGUE CONTESTS
COME TO sCLOSE CURTIS
HENRY TEAM CHAMPIONS.
DICKEY.
Mrs. Ella Dickey, wife of the Rev.
C. K. Dickey, formerly of Millershurg.
who died at her home in Louisville.
With the game between the R. P.
"Walsh and Bourbon Laundry teams at
xiesaay ana xuesaay matinee is the the Fordham Alleys, Thursday nighf.
iage size. There are two complete the serics games between members
carloads of scenery and electrical ef- nP T, toM- tu t , wW(li,
o Tfco fnnrfnnf nlnn lo Tnn. f tnG PaS BOWling LeagUe, WhlCll
tkan'the majority of mrge attractions. nas been in Process since December last week, of tumor of the brain, was
It c fhtx ant in Tvhiri ia rnnracontoH Zt. CaniC tO a ClOSe. (JlirtlS MenrV team "'" u mail 1050 Ul JXMV. J. J
the fanfare and riot of New Year's. winning the championship,
live on Broadway, New York. Those The final game was a corker,
-who have witnessed it are amazed at the viewpoint of the victors, the Laun
tke faithfulness of the picture. It $ry tean3f Wjnning oy the skin-of-their-if
as painted by Walter Burbndge who teeth f three ins Th
visited Broaaway at the time descnb , . . & ... . , t ,
H and made pen-pictures of the aston Walsh team battled manfully, but the
iehing scenes just after the theaters Laundry team was too much for them
luxo released "their patrons and the and they went down in defeat. Jack
hilarity has set in. There is, perhaps, son, for the winners, made the highest
jn actual life, no other situation so individual score, bowling 188 in the
difficult to reproduce. Seats now sell-third game For the iosing team, Dun-
' 1 r r i 1 it . I03-11 bowled 172 for first place, in the
Several from Paris attended the per-1.. . , ,. , . l ' .
formance last night, and came awayjtnird same, followed for second lion-
delighted wiUi the superb production ;ors y Douglas, who ,put over just one
A larirA ftmwd will iro over to-dav for less pin, making his score 171. For
known turfman, who is at present at
Tlajuana race track, in Southern Cali-
DEATHS. fornia, and one daughter, Mrs. M. H.
Davis, of Maysllck, Mason county, for-
'merly Miss Emma Hukill, and one
I niece, Mrs. Laura Hanly, of Atlanta,
ua. ie was a brother of the late Mr.
John Hukill, of Paris, also a mercant
tailor, who died in Paris some years
Dickey, jpastor of Hutchison Chapel, at
Mlirniet-lTl thin siminf-i'.
frvnn "'iqiu, hub tuuutj.
O'CONNOR.
Mr. Moses O'Connor, sixty years
old, died at his home in Frankfort, Fri
day, after a short illness of heart
trouble. Mr. O'Connor was one of the
pioneers in the newspaper business in
the State, and was editor of the Daily
Journal, at Frankfort, when it was es
tablished as the first afternoon daily1
in that city.
ago.
The funeral services will be- held at
the family residence, on Broadway, at'
2 p. m. to-morrow (Wednesday) and
will be conducted by Rev. W. O. Sad
ler, of the Methodist Church. Burial
will take place in the Paris Cemetery
Better Than
an Auction!
BREEZY LETTER FROM
THE BREEZY WEST.
I THE NEWS is in receipt of a breezy
letter from a former resident of
1 Bourbon county, in which she pays a
very Handsome compliment to THE
NEWS, as all well-regulated people do
nRTTTHP.HFTTCT,n uo appreciate a really good Home
Mr. John B. Crutchfield, aged six- home paper- We UP our nat to the
tv-four. dip.d at. his liomP. in Tnatcr writer. The letter follows:
." . ' . ... "v T-
the matinee performance.
w ii m. 1- r.. ... .1.1. ..1 " hnria . nnfonn ninmi. in ini7
(adv 'the Laundry team Funk came second !i?SL wPe- lJ- uniicnneia was a na-' , fn; thw wwqV' '
I.IVt 111 II if VMI I M fMllIHV MP TVflC Tll-cr . -.- -.-m,,j
NEW OIL COMPANY.
.'with 174.
j At the conclusion of the games the
losers tendered the winners a lunch-
Hon. Abrain Renick, of Winchester, ' eon, in which good cheer and fellow
Brother of Mr. B. M. Renick, president 'shjp mingled with the viands and
A t-v s irfil! " !.- 1, A f
01 ine irans muiiug o., nus vwu Qiier tilings
clated Gas & Gasoline Co., which has
just been organized at Irvine with a
capital Ji ci,uuu,uuu. iue nwwij-i
formed company will enter the oil teams were present and joined in the
f eld in Estill County in developing the festivities. One of the features of the
natural oil resources of that section. SOcial hour was the attempt of the
Articles ol incorporation nave Deen losin2. Walsh team to nut Bernard
c of the County Clerk;,. . ffi-, ..... ,, BttBnntn
KjaiiLVii, uiuuui owici auu ouiuouiaii
Toasts were proposed
land responded to, and the affair par
took of the nature of a social recep
'tion. All the members of the various
Hied in the ofli
at Irvinn. Mr. W. E. Hancock, for
merly c Beaumont, Texas, an oil ex
pert, will be general manager of the
new company.
'in the cellar," an un
neverthless amusing
B-4 HRE
Insure witte
W.O.HINTON &SON,Agts
MJDNIGHT FIRE DESTROYS
FINE GEORGETOWN RESIDENCE.
of the League
successful but
1
I stunt
j There being some slight difference
jof opinion regarding the closeness of
I the score the winners proposed that
the game be called a tie. and that an
extra game, to be determined by the
I pin totals, be played. This resulted
ias follows: R. P. Walsh Team Hill
137; Kenton, 145; Bridges, 164; Doug
jlass, 126; Duncan, 159; total, 731.
Bourbon Laundry Team Santen, 141;
Burgin, 123; NeaK 120; Jackson, 156;
Walsh majority
A two-story frame residence belong
ing to W. A. Gaines, at Georgetown,
vaR tntnllv destroyed bv fire about
midniffht Thursdav. The house is lo-JFunk, US; total, 658
cated beyond the citv limits in Royai . 73.
Spring Addition. The loss is about a game is being arranged for to-
$2,000, with ?l,o00 insurance. , nihl t0 be piaye(i at the Fordham
Alleys between the Curtis Henry team,
Vir r n 11 a Tit win n pre: nnrl ;i nfo.kpil tpnm
origin 1 lv" ' ""-" ,.
of the best bowlers representing the
jotner teams ol tnef league, rnis win
,-. - . c f- , - - -be one of the most interesting events
Fire, wma and lightning m-.c the wcek among the b0WlInB fra.
The place had been vacant but
tw days and new tenants were to
have moved in Friday. The
of the fire is unknown.
SUranCC. Iternity.
Thnmas. Woodford & Brvan. The following is the score of
. .7 .-
:
V4
1 .
i
Delicious
Juicy Meats!
VEAL
PORK
CHOPS
STEAKS
The gest Roast Beef
and Breakfast Bacon in
the World.
closing game:
R. P. WALSH.
1
1 Hill 160
Kenton 157
Bridges 136
Douglass 171
Duncan 13S
136
152
138
102
167
the
3
155
146
147
152
172
Totals 762 695 772
BOURBON LAUNDRY.
1
Santen i 167
Burgin 153
Neal 121
Jackson 145
Funk 128
147
140
146
137
160
3
15S
134
188
174
WALLINGFORD.
Death last Thursday removed one
of the oldest citizens of Maysville,
when Mr. Buckner Ashby Wallingford,
eighty-two, retired tobacco merchant
was summoned. He was born near
Maysville, where he had lived practi
cally all his life, with the exception of
a few years, when he was in business
in Cincinnati. He retired many years
ago, due to failing health.
He is survived by his son, Buckner
Wallingford, Jr., a member of the firm
of Walter, Wallingford & CoT, iron
merchants, with offices in the Traction
Building, in Cincinnati; Mrs. David
Anderson, and five grandchildren.
The funeral was. held from the
home of his sister, Mrs. Kate Walling
ford, on East Third street, Saturday
afternoon, at 2:30 o'clock, with ser
vices conducted by Rev. J. H. Field
ing, rector of the Church of the Na
tivity, f-oilowed burial in the Maysville
Cemetery.
3 nao ju&i 1 , , . . '
married to Miss Boulden, of Millers-1 cim Whm5 uie present opportu
burg, who died, leaving two sons, nity of writing regarding your newsy
John Hurst and William Boulden, who Pa,per' whlch is a frequent and wel
survive. Later he married his sister-Lc.ome uest at our Western home,
in-law, Mrs. Margaret Boulden. The .ou are to be congratulated upon pub
remain were taken to Lexington, j "shing such an interesting and help
where funeral services were held at PaPer which is a credit to the
the grave in the Lexington Cemeterv, i Place where it is published, and to all
conducted by Rev. I. J .Spencer. " wno are concerned in the work nec
essary w get it up.
VI was born near North Middletown.
Bourbon county, and lived there until
nineteen years of age, when my father
decided to come West about three
years ago.
"I see that Paris and Bourbon
county have been visited lately by
heavy rainstorms. Out here a good
old-fashioned rainstorm would be higl -ly
appreciated for the reason that it
would cause this twelve-inch-on-the-level
snow to diminish. This has been
a winter that will not soon be for
gotten. Ranchers who have been here
for thirty years say they have never
had such a winter in Montana. Stock
all over the country is dying from cold
and lack cf proper feed, which has
been scarce and hard to get The
mercury frequently registered 52 de
brees below zero. The scarcity of feed
for stock throughout the State has
caused great alarm among the stock
men. "Farm products .are soaring in
price, potatoes, $2.25 to 2.50 per cwt
beans, 15 cents per pound; and all
foodstuffs in proportion. We are locat
ed at a distance of sixty-two miles
from a depot, but the Northern Pa
cific road is planning to nut a road
SULLIVAN.
Mr. Cornelius V. Sullivan,
aged
On Thursday, Friday and Sat
urday, ONLY
(MARCH 22nd, 23rd and 24th)
We Will Sell
Bsst Eating Potatoes At & A
PER PECK Owt
(Remember we give assure enough peck 15 pounds.)
Arbuckle Coffee O A "Search Light'' Matches
per pound UC j 500 count, per box...
"Clean-Easy" Soap, the best of all
Laundry Soaps, at 6 bas for
5c
25c
We reserve the right to limit all purchases,
free delivery to all parts of the city.
Yes, we have
Again We are Offering the Celebrated
BLUE RIBBON GARDEN SEEDS
At 3 Regular 5c Papers For 10c.
,
Bring Us All Your Produce and You'll Get the Highest
Ml D.
tiCl 1 j
i an
rice.
BUSY BEE CASH S
TORE
fifty-three, for thirty-three years in the j through here in the early fall, provid
employ of the Louisville & Nashville !ing the country has not bv that time
road at Lexington, died at St. Joseph's been plunged in war. or there is no
Hospital, in Lexington, after an illness prospect of another strike on the rail
of eight weeks. Mr. Sullivan v.-as a.roa(iS- we will derive great benefit
brother of Mr. Jerre Sullivan, of Lex Ifroni this extension of the Northern
ington, formerly of Centerville, this pacific, as it will enhance the value of
county, who, in an effort to prolong our lands, as well as affording us relief
ins orouiera me, suuimuteu tu iwuifrnm hfi rm n. nn we firn now under.
operations for the transfusion of blood
into his veins. He was depot master
at the Louisville & Nashville freight
depot
"Since the enactment of the 640-acre
homestead law, most of us have been
enabled to secure the additional 320
acres, making a nice lurm 01 b4U acres
Western States. Statics show that iter and coal rights. When we first
Montana has more school buildings, ' came out West we were groatly dis
churches and other improvements con-jgusted and displeased with the coun
structed and projected than any other try, as there seemed nothing to break
State in the Union. We also- boast of ; the monotony, but soon small towns
having a very healthful climate, free and postoffices sprang up in. our im-
iruui lypnoia germs, luoercuiosis. etc. mediate vicinitv. I nnf in nn- nTmiw.
The land here is ver productive, and
we have raised some very fine crops
of wheat, flax, all kinds of gardoii
stuff, with the exception of tomatoes,
for which the season isn't long enough.
"We have a great supply of coal, for
which no money has to be paid out, all
widow, Mrs. Annie McCarty Sullivan,
one sister, Mrs. Mary C. Stewart, and J
ono brother, Mr. Jerre Sullivan.
The funeral was held Sunday after
noon at 2:30 o'clock, at St. Paul's
church, in Lexington, with services
134 ' conducted by Rev. Father Libert de
Waegenaere. rne pau-oearers were
James McCarty, Ed. Birch, Frank B.
Carr, Jas. B. Lyons, Wm. Haydon,
i John Clark, John Scully, and R. J.
788 ' Colbert. The burial followed in the
Laundry Totals "32 uatnonc uemetery at Lexington.
R P Walsh Totals 2229 At a meeting of the Knights of Cn
'lumbus, of which he was a member
, ., . ., o i appropriate resolutions on the death
Launcir iuujuulj ' j nf ATr Cniiivnn wpm nnssRcl. Tim
.. ........ .. - t. .
Knights attended the funeral.
Mr. Sullivan is survived by hi? .Montana is surely coming to the front, I one has to do is to go out and mine it
and will soon surpass some of thelTh government reserves all the wa-
tion for a post-office, and now have a
office of my own. Wo also have a
atore, and all good homesteads, and
last, but not least, good health. Tell
all the good people of Paris who de
sire to regain their health to come to
Paris, Montana. It is imply greaL
"Very Truly,
"MISS LUCY B. RITCHIEL"
Totals 714 730
r IS13! UBBcl
WILMOTH
Grocery Co.
Phone 376
HOUSE PASSES THE
OLIVER TAX LAW.
MARGOLIN'S
SPECIALS
For This Week
We Are Killing
K RAISED STOCK
Fed and Raised in
Bourbon County.
BEEF, PORK,
VEAL AND
LAMB
CLARK.
The funeral of Mrs. Elizabeth '
Griffith Clark, who died Saturday'
At Frankfort, Fridav e House, af-, night at the Massie Memorial Hospital
ter a preliminary W 'x-tweeu in this city, alter a long illness, due
Representative Frank 3. Greens and to a complication of diseases, was held
Harvey Mvers, the latter being in the yesterday afternoon at 2:30 o'clock. I
chair in an appeal, passed Hie Oliver with services conducted at the grave!
Bill, creating the State Tax Commis- in the Paris Cemetery by Rev. Dr. O. f
sion bv a vote of 67 to 26. The bill R. Mangum, pastor of the Paris Bap-!
will now go to the Senate and af tist church, of which she had long
ter being reported to that body, will , been a member. j
be ready for consideration in the up j The pall-bearers were Martin Kin
der house by the middle of this week, i kenney, W. E. Kane, Lawrence Van-'
hook, Hi. iu. itans, uaviu oman anui
Allie Rowland.
Mrs. Clark was the widow of the I
late Mr. Newton Clark, and was for a .
Tmmediatelv before the passage of
the bill the Roach substitute was de
feated by a vote of 28 to 66. The only
onmonHmfmts addpd to the bill were to
make the per diem of the Board of .long time a resident of Pans. Some
County Tax Supervisors $5 and reduc
ing the fee of County Clerks in certi
fying tax receipts from five to two
cents.
The Oliver Bill as passed by the
House creates a State Tax Commis
sion to be composed of the State Au
years ago Mrs. uiarR was cnosen asj
Truant Officer for the public schools I
of Paris, under the provisions of the '
Compulsory School Attendance Act, in
which capacity she gave eminent satis
faction. She was a woman of culture
and refinement and was devoted to her
The Balance of Win
ter Shoes Must Be
Sold at Once to Make
Room For
Spring Goods
Daily Arriving!
SftSii Greater is the Reduction of Prices!
Do as thousands of others are doing. Buy now for
future as well as present needs. Not for a long time
will you be able to buy high grade shoes at prices so
low.
nllnf
" up;
Ladies' Dawn Grey Kid, Also Mahogany Tan, Most Fashionable Boots at Almost
ONE-HALF THE PRICE YOU PAY ELSEWHERE
ditor and a Republican commissioner ' friends, family and her church.
and a Democratic commissioner to ue
appointed by the Governor. An appro
priation of $15,000 is provided annual
ly for the maintenance of the Commis
sion and its subordinates. The salary
of the Auditor is increased $600 .annu
ally, the commissioners will receive
$3,600 annually and the Secretary o
salary of $2,000.
The bill carries an emergency clause
and 'becomes effective as soon as it is
passed, by the Senate and signed by
the Governor.
The House defeated the effort of
Representative Vance to attach to the
Oliver Bill a referendum clause to re
fer it to the people for ratification
The amendment of Representative Mc
Murray giving the taxpayers the right
of appeal to the Quarterly Court from
increases of assessments made by the
County Board of Tax Supervisors in
stead of to the State Tax Commission
ers, was adopted by the House.
She is survived by one son, Mr. .Noah
Clark, of Paris; one Brother, Mr. Ed. S
Griffith, of Chicago, and two half-
brothers, Dr. J. M. Patterson, of Kan
sas City, Mo., and Dr. D. C. Patterson
of Broadwell, Harrison county. A sou,
Air. Rogers Clark, died several years i
age in Madisonville, Ky., where he had
been in business.
NEW MAIL SERVICE.
CALL UP
MARGOLEN'S
first Ciass Meat Market
The new mail schedule on the Lou-
I'isville & Nashville, between Mays
ville and Lexington and Paris. Millers
turg and Carlisle, went into effect
yesterday. The mail from Maysville,
I Carlisle and Millershurg will now be
Brought on the 5:00 p. m. train in
stead or 2: is p. m., under the present
sjstem. The 12:05 train from Pari?
"will cany mail to .Millershurg, Car
lisle and Maysville, instead of the one
at 7:48 a. m. The change will be ben
eficial in many respects.
-r
HUKILL.
Death came suddenly and without
warning yesterday afternoon to Mr.
William Hukill, Sr., aged eighty-five,
one of the best-known residents of
Paris. Mr. Hukill had not been on the
streets for some time, and seemed to
be in his usual good uealth yesterday.
He had for months been in the habit
of sitting in a chair near the front
window which overlooks the court
house and the streets. Yesterday af
ternoon a little before two o'clock Mrs.
Hukill came to him ab ne was sitting
in his chair, with a remark that she
had just received a letter from their
daughter, Mrs. M. H. Davis, of Mays
lick, and would read it to him. As
she started to open the letter Mr. Hu
kill dropper over dead.
Mr. Hukill was a native of Paris. I
where he had spent the most of his
long life. He was for many years in
the .merchant tailoring business, and
was a man of quiet tastes and habits,
and a man whom everyone liked and
respected.
He is survived by his widow, who
was Miss Lizzie Mitchell, of Louis
ville; two- eons, Mr. William R. Hu
kill, of Paris', Deputy State Fire Mar
shal; Mr. James Hukill, of Paris,, well'
Ladies' Dull Kid High Cut Boots
$4.50 values S2.99
Ladies' Dark Russia"Calf Boots
$6.00 values 3.6S
Ladies' Patent Kid Cloth Top Boots
5.00 values 2.49
Ladies' Patent and Gun Metal Shoes
$3.50 values 1 .99
Ladies' Gun Metal. button, $2. 50 val. 1 .69
Ladies' Felt Boudoirs, SI. 00 values .49
Ladies's Felt Juliets, fur trimmed
$1.50 values 79
Men's Russia and Plat. Calf English Walk
Over Samples, $6.00 values $4,00
Men's Russia and Platinum Calf Walk-Over
and Beacon, $4.50 values $3.4-9
Men's Gun Metal English Medium Toe Welts,
$4.00 values $2.99
Men's Gun Metal Button and Lace
S3.00values 1.99
Men's Tan and Black Romeos
$1.50 values 99
Men's Black Felt Slippers
75-cent values .49
Special Ladies' Slippers, Broken Sizes, $3 and $4 Values, at $1.49
Boys', Misses and Children's Shoes at Great Bargain Prices.
FROM TttE
MacDonald-Kiley Bankrupt Sale
Men's High Grade M. Sc K. $ 1 O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to D
ON SALE MERE AT ONE-HALF PRICE
DA
M
Paris' Greatest Shoe Store.
C0HEM
335 Main Street, Paris, Ky.
iHHIMHMHMHi