PAGE EIGHT
'i-i
NEWS, PARIS,, KY.
TUESDAY, FEBRUARr 20, ills.
"
MILLERSBURG
DEATHS.
Mr. and Mrs. Robert Stoekley, of!
Cynthiana, uore at tilie bedside of Mr. ALLEN.
JJ. L. Powell. Sunday. j Warren Hughes Allen, seven-months-
Mr. and Mrs. E. H. Kerr were old son of Mrs. Jessie Hughes Allen,
quests of their mother, Mrs. M&rtha formerly of this county, died at the
Baldwin, at Maysville, from Saturday home of his mother, in Fairfield, Nel
until Sunday. son county, last week, following an at-
Messrs. J. G. Allen and R. L. tack of acute indigestion. Mrs. Allen
Powell, and Mrs. Minnie Hurst are vas a daughter of Mrs. Minta Hughes,
jnvalescent. Mrs. J. B. Cray is on and a granddaughter of Eld. L. II. Rey
lie sick list.P r.olds. of North Middletown.
Mr. W. M. Vimont, of Maysville,!
was the guest of his mother, Mrs I HANNA.
Martha Vimont, and sister. Miss Flor- The remains of Mr. John Hanna,
ice, Saturday and Sunday. well-known throughout Central Ken-
The infant of Mr. and Mrs. Hop- tucky, who died at the Good Samaritan
Xins, residing in a part of the home of Hospital, in Lexington, last week, were
Mrs. Russell Mitchell, died Saturday, taken to Ironton. Ohio, tor interment,
aad was intr-rred Sunday in the Mil-, Mr. Hanna had been ill but a short
Jersburg Cemetery. time, having been taken to the Hos-
Blanche, the eight-year-old daugh YAla suffering :ron an attack of pneu
lr of Mr. and Mrs. Quinn Toadvine nionia. He had for many years been
fijed Wednesday night after a lingering engaged in tjhe piano tuning business,
51messv)f tuberculosis. Funeral Thurs- and had become a familiar figure in
day morning from the home, after Paris, as well as in other towns in
which the body was placed in the vault, this section. He is survived by his
a..-d will be interred later. 'widow and two children, two sisters
The liomc of the late Miss Vina ' and one brother. Mr. Hanna some time
f- Vimont war sold at public sale Sat a no suffered the loss of all his tools in
orday afternoon by Auctioneer George a fire in Lexington, but pluckily re
Speakes, of Faris.'to Mr. G. W. Brain-. fused to be cast down, and went to
Alette, for ?3,950. Mr. Bramblette , w ork with a good will to repair the
will put the property in thorough re- loss. He had b:i in business in this
7air. and make an ideal home out of it. 'section for over forty years.
Mrs. Adella Peterson, aged about
Iwrv-seveiJ, ied Saturday at 10 p. m..I HALEi.
ai her home, after a lingering illness! -Mr. Brent Haley, aged tihirty-three,
ot tuberculosis. Mrs. Peterson has died in a Lexington hospital Sunday
"b-en in failing health for several vears, morning, after a short illness. He was
slid for several months her life has a son of Mr. and Mrs. W. W. Haley, of
wpii p'i but denaired of. She was near Clintonvillo. Besides his par-j
ivrmerlv Miss Adella Allen, and is sur- ents, he is survived by his widow, who
-rWert bv five sisters and one brother, was formerly Miss Mary Weathers,
.About twentv-fivc vears ago she was one son, Mr. Weathers Haley, two
Additional Personals.
united in marriage to Mr. William Pe
terson, a prosperous farmer, their en
tre life (having been spent in and
around Millersburg. Their union w&z
"Messed with one daughter, Miss Mar-r-aret
Peterson, now Mrs. J. E. Poo'.
who, with her husband, resides with
brothers. Mr. Kelley Haley, and Mr
Isaac Haley, all residing near Clinton
ville. The funeral was held at the family
residence near Clintonville yesterday
afternoon at 2:30 o'clock, with services
conducted bv-Rev. Paul Rhodes, pastor pii who have been occunvimr the Clen
Mr. Peterson died about .of the Clintonville Presbyterian church. ),ionin farm, are moving to a cottage in
Mr. L. F. Sinclair, of Georgetown,
uas a visitor in Paris, Saturday.
Mrs. Bunnell and son, Albert, have
returned to their Siome in Georgetown,
after a visit to Mr. and Mrs. A. S
Trimble,
Mr. John Tunis left yesterday af
ternoon for Danville, where he will en
gage in business with his brother, Mr.
Gus Tunis.
Dr. and ATrs. Johnson, of Danville,
were recent guests of Dr. and
Mrs. Raymond McMillan, on Hous
ton avenue.
Mr. J. J. Veatch, District Manager
of the Central Home Telephone &. Tel
graph Co., was in Harrodsburg yester
day, on business.
Mr. and Mrs. E. A. Allen and Mr
and Mrs. Frank Nichols have returned
from a visit to Mr. and Mrs. Vesta
Allen, in Georgetown.
Mr.s Mary Woodford, who is now
in her nineteenth year, is very ill at
the home of her son, Hon. J. Hal Wood
ford, on Winchester street.
John W. and David Prindell, chil
dren of Mr. Frank Prindell, of near
Paris, were sent Friday, to the Chris
tian Church Orphanage Home at Lou
isville. Mrs. Geo. Alexander was a visitor
in Paris yesterday, enroute to her
home in ?kiia, Ohio. She had just
visited Mr. Alexander, who is quite ill
in Frankfort.
--The Girls' Dancing Club will give
a subscription dance at Varden's Hall,
en Main street, in this city, on Thurs
day evening, February 22. Music for
ihe dancers will be furnished by a sax
ophone trio. The hours will be from
?:S0 to 2:30.
Dr. and Mio. William Kenney and
family are moving this week from
their Meadowbrook farm to the Clen
denin place on the Clintonville pike,
near Paris. Mr. and Mrs. Albert Mitcn-
- . -.-vir- -w 'I' m hnrio tniirwx'aii ..in tno Mnipv ni i.:t A.i,i;t;.
n,rno vonrs U JTfJ in JUarCll. lyiO. lUTS. ' "- uiwim iutwt.u ww vv- .... nuuic auuiuun.
'nt-r mother.
Peterson and daughter moved to town in the Clintonville Cemetery. The pal'-,
1rnm ifiPir farm, remaining here one oearers were, oum weuumi. muni
--Mrs. Laura Skillman. oj Chatta-
it rn it-i. t ii. i: iTi,t iintiWAM t . . rf-. ro mnii ir in nic tioon ?i o'lpcr nr
. ..!.:! U t-ntiirnorl f.- thp Weil 1UUIUCK. .AlUlilLl I1U1U, JIUUUCr , i.VWta, x cmiM v m. wvim nw w.
? mu Pntorson and Cantain Pool son Shropshire, Will Crim. and Jeffer- relatives in Paris and Nort.h Middle-
Srfne married last fall. Mrs. Peter-' son Weathers. 'town, who had planned to return nome
'last weuK, whs uuuuueu ueic uj iiuhj
sn belongs to one of the best families
i this community, and was a devout
fJhriKtian woman, uniting with the
-mlil?ct Hi-.irph pnrlv ill life. For
HARDY. jfroni Chattanooga to tne enect tnat
Mr. Manlius Hardy, one of the pio-' mwisles had broken out in the family
neer residents ot Clark county, died iPjOf one of her sisters
iHA-eral Vears her failing health pre j Lexington, Friday night after a shor ; Thc anmi;i, innitary hall given ;u
. , , . .i.: ., .niVn nnrt illnpss nf nnfMimnnia. A fow davs airo
n.u ner ironi lawns . i""- --." ;.- r Y i
in chvrch fcork. She was a devoted his home near Winchester was dc-
wife a kind and loving mother, a stroyed by fire, and Mr. Hardy came
true friend taking a deep interest in near losing his life in an effort to sav-
-rervhing about her that was for th some of his personal effects. He was
od and upbuilding of this commu-, carried from the burning home to the
;,. Tho fiMiornl services were hel-l residence of his son, Mr. Roger Hardy.
-"-." ""- . . . ? i ! i. i i ,.: i r,.
Wonday at Hi a. m., at her late resj- aim was. mti u,Ktu lu a..,61U1. 1Ui: dress, presented a pleasing picture
a . iiv -pv- p r Trisher "Ot tne M. y. iicauiieiii.
Sq?pi1 bv her Lastor Rev. J. W. ! "Dr." Hardy was one of the best-1 The "Silver Tea" given by the
rrdnpr Rev T D iledd P F. of the , known men in Clark county. He was ladies of the North Middletown Wo
vwillV Di--trict and Uev A. S. Ven- a pipe-maker by trade, and had sent a' men's Club at the home of Mrs. Allie
11, 'r 4o PvochvtPrinn rhurch. In- handsomely hand-carved briar root Dickson, in North Middletown. Friday
''";'. , Millerbur" Cemetery'. A pipe to every President of the United afternoon, was a decided success, and
a IlUJU 11LL1U Olllll "Uil i uiliiuv.", " .v-..
turned over to the Robert
"xr;io-ri ATomnnnl Kiincl. n
- ! .Ill icauuuac. i ucac ncic ncaii uj cu in uuiun ,,iioci v.w. .... . .......
llth piatC. . l,ftM ,..5fV. o nornt'iilU- iirViSstV, ATro T?rnnlf P TIWrV ff P.'LriS.
.. , 1 ... n...,.. LllC 1I1C. lUKCUlCl UU a vtillllll UI11V.U iiiiti. j.... . - j j - .
rne writer mas ietuiuu uumciuu.! ! i ,
tlv Universilv of Kentucky, last week.
1; the students, was one of the most
successful affair-; of the season. The
Aiand march was led by Maj. Emory
I-razier, and Miss Mildred Collins, o'
North Middletown. The cadets in their
Military uniform and the ladies in full
lerment in Millersburg Cemetery, a pipe to every i-resiuent 01 me umieu uliuuiuuu.
larce number of relatives and friends States since the Civil War. He had a nice litt:
-followed the remains to their last rest personal letters from all the Presidents will be tin
i ninPP ,in response. These were destroyed in Burns Wil
a caretuuy which lurs.
as having packed is the Chairman.
At the close of the
V. Vi,n "Htstnrr nf made pipe which .he was having packed is the unairman. At tne ciobe ol uie
compliments regarding the History ot gend pre3i(ent wils011t intend. program a salad course was served a la
Millersburg From lbby to ine rreb- inauguration .buffet to the guests, forty-five in num-
nt." Miss Bettie imont sas. I do fa March 4 (ber
not want to miss a single copy of it. aa' iarcn 4. her.
if this continues 1 will subscribe for
thr ROTTRBON NEWS. In time we
REN1CK.
The Millersburg Dancing Club wi'l
give their midwinter dance in Millers-
r it this Kepps up. , n (Tuesday) at two o'clock, with committee m cnarge 01 meuanue ,
ige. of Caliiornia services conducted by the pastor of the composed ol Allen ingeis, juiian Auan.
a. .Miner, aim ...- Winchester Presbvterian church, of " current ami "6C. ,
three living grand- vhich Ir Reniok was a member. The chaperones are Mr. and Mrs. San ford
iller. the founder of ,,,.:, .;,i fnnnxx. ,- fi, winohocto, Allen. Mr. and Mrs. T. W. Curreiu,
-vill all get the'-e. 1 am s-rry that it The funeral of Ir Scott Renick. ot urg on t,he night of Tuesday, Febru
iis not a compete history, but I know Clark counlVj who died suddenly in ary 27, instead of a previously an--i.,-c
M-rmiri hp laborious task." Mrs. u000 r,,u i-at .0l- wimm ho hori nounced date. Smiths Quartette will
America Butler says: "I am enjoying ong for lllis health, will'be held at the furbish the music. The hours will be
m. liictor' nt Millersburg. I will sub- ,,. anna , Axr;oi.octoi. tiiic -.ftor. from 9:00 p. m. to 3:i0 a. m. Ihe
.U J. W '"- 1 i3llll,J, AAA ? uiavjtu Wj tvi -
scribe for the papo
My sister. Mis. S-vji
ray brother. Mr. .J.
self, are 'ie only
.hillron nf .1(1! M
Millersburg. Wliu the t uvn site was cemeterv J Mr. and .Airs. s. t'. liascom; aim mi.
laid off and divided into lots every Mr pjielps Repfck. of Winchester. ,and Mrs. Chas. A. Webber, of Pans,
other lot was given away, so as to m- who went t0 Havana immediately upon ' The recently -organized Coterie
duce buyers." Mr. R. B. Boulden. of receipt of the news cf his father's Club were guests last week or Mrs
Pueblo, Col., says: "I am reading you- (eath telegraphed relatives that the Edward Burke at luncheon-bridge, at
-histoo' oi Millersburg way out here body ,md ,)een s,lipped fronl Havana -her home on High street. The rooms
v-nd must say that 1 am enjoying it. I and would arrive ,n Winchester, Mon--ere beautifully decorated with jon-
am glad Uiat vou have thought of this. d 4 -quils and baskets of cut flowers, while
If I can serve you in any way 1 will be he causp ct Mr Renick-S death it tW same decorative effect was carried
lnd to do so. 1 have in my posses- , . fiPnitiv nPrtMinwi ms aJout in the decorations on the tables.
MATRIMONIAL.
VAUGHN SHI PP.
News has been received here of the
marriage in Calara, Oklahoma, recent
ly of Mr. Ray Shipp, formerly of Paris,
and now a resident of Oklahoma City,
Oklahoma, to Miss Myrtle Vaughn, of
Calara. Mr. Shipp is the son of Mr.
and Mrs. Victor Shipp, of Paris, who
moved to Oklalhoma several years ago
He is now engaged in the grocery bus
iness in Oklahoma City, being a mem
ber of the Northwestern Grocery Com
pany.
Corning
An factions
REAL ESTATE DEALS.
Mr. John Fisher, -of this county, has
sold to Mr. Carl Long, His farm of
seventy-two acres, located on the Col
ville pike, in this county, for about
$150 per acre. Mr. Long will occupy
the farm in March. Mr. Long recently
sold his farm on the Hume & Bedford
pike, near Paris, to Mr. Anderson, of
near Nicholasville.
Mr. James Vice, of near North Mid
dletown, has sold to Dr. Robinson, of
Mt. Sterling, the farm near North Mid
dletown, known as the John Arnold
place. The price paid by the pur
chaser was not given out for publica
tion. Dr. Robinson stated that he
bo u gih t the farm for investment pur
poses. f
Mr. Clark Barnett, who has for sev
eral years has been a member of the
Bourbon county colony in Spencer
county, having purchased a farm near
Taylorsville, has sold out his interests
there, and will return to Paris about
the first of March to reside. It is said
that Mr. Barnett realized a nice profit
on the sale of the Spencer, county farm.
He said he is glad to get back to
Bourbon county again.
Mr. G. S. Feeback, of Carlisle, has
has purchased of Mr. Clarence Hough,
the hitter's small farm near Ruddles
Mills, at a private price. Mr. Hough
recently bought the Sudduth place of
121 acres near Centerville. where he
will move about the first of March.
Mr. Frank G. Collins has purchased
from his father-in-law, Mr. Vice, of Mt. '
Sterling, the farm en the Mt. Sterling
and North Middletown pike, adjoining
t lie. farm of Mrs. J. W. Rice, at a pri
vate price. Mr. Collins will move to
his purchase about March 1. j
PARIS GRAND AND ALAMO
TUESDAY
DOROTHY GISH
IN
"Atta Boy's
Last Race"
A Triangle Fine Arts pro
duction. Comedy, Love, Thrills.
WEDNESDAY.
Theodore Roberts and Anita King
m
"Anton, the Terrible"
Produced by Jesse L. Lasky. Famous
Players Company on Paramount program.
THURSDAY.
Frank Keenon in
M
"Jim Grigsby's Boy
This is one of the best that this fa
mous actor has appeared in. Triangle
K. B.
Hours-Alamo, 2 to 5:30; Paras Grand,
T to 1 0:30, Admission 5 and 1 Oc.
9 i
i y. j.k
THINGS TO WORRY ABOUT.
Several Kentucky towns have inau
gurated "Pay-Up Week" for the pur
pose of having everybody help just ;i
little in releasing come of their stored
away coin by paying their debts, thus
enabling some other fellow to pay his.
We think "Pay-Up-Week" is a bril
liant idea, but just suppose one is in
the condition of
A man who was deeply in debt
Said "Things are as bad as they get:
I'll worry no more.
Let the rest walk the floor;
I'll pay when I can, but not yet."
The Worst Handicap
in the world is WORRY-it ties a man hand and foot
takes off the edge of .his talents and cuts down his
ability.
WORRY as to what will happen to the family if any
thing should happen to you, will do more than anything
else tu reduce your earning power.
LIFE INSURANCE solve the problem -the day you get
your Insurance Policy, is the day you cut your fetters.
LIFE INSURANCE is the only sure cure for WORRY.
"Die Northwestern Mutual Life Insurance Go.
R. F. CLENDENIN, Associate General Agent
Suite 201-202 First Nat'l BanK Bldg.
PARIS, KY.
f
. .1 - .7 r !. minifc u'om
?ion some of the eany ueeub wjiuW recurrence of a paralytic stroke, which e pmce uaius, i. ...,.- b -
in Millersburg, which name the three nad auffered some time ago The re.. hand-painted cupids. Mrs. Margar... I
Otrontc nmnitiir narallel with Mam. ,n!0 wot.Q -nnnmnniaA unma i, mv Sullivan, of Lexington, was awarde i j
v.?c m-oq Arrno n recent years. Up-to t0;l. ,..i, ,,0,i ,ino cnan,i;nr thai the first prize, and Mrs. Charles W
this time they were known as East vinter'in Mlama, Ftorida. ' Heck, of Par's, the second prize. There
-.nri WoRt Back streets. At the time I ; Mr ,. hn(, n larfrp p;rplo nf ere two tables of players. The mem ,
-was writing insurance a represent- friends and acquaintances throughout J-ers of the Uud win ue&uebo, at u .i
'" Central Kentucky, to whom the news! next meeting ot Airs. Jonn lo..uu.
tivp frnm one of the well know
i?o nnmnanies was with me, I
de-
of ibis death came as a shock. He was
The home of Mr.
Fcribed certain property as being locat- yery popular among tne farmers, and 'ciondenin on Cvpress
cd on East oi West Back Street, i-ie v as a man everybody Iiked scene Saturday "aftern
Vimont, one of the early pioneers oi
.a -Tii oca strppts have no names. .
and Mrs. Ilov
street, was the
afternoon of a pleas-
anr r:atnering wnen imis. icuucimh
TT-T T I . i i. 1 f mincta Ot
;u, xv,w - ,..u : iivj-vLiii.. -was ncsLess to a. mimoci ut sucow i
316 ,d;rircomnanr Mr. Baillie Arkle. one of the best- a luncheon-bridge. The guests for the
see that he comPa" J11 RS 0" known of the older generation of Paris i occasion were Mrs. J. V. Bacon. Mrs.
U ,mvn Jd 1 called West Bac builders and contractors, died at his C alia Tihomas Nichols, Mrs Lew Tay
?G lt Tritf Avenue as the Trig J home in this city Saturday night, after! lor. Mrs. J. O. Marshall Mrs Harry
Street Trigg Av emie as tne b, piieumonia. Mr. Ar- Mathers. Mrs. Watson W. Judy, Mrs.
prop , tivu was opened from kle at the time of his death, was in 2iis : Denis Dundon, Mrs. Kicnartt ii. wm?.
many years tl at as opene elghty.fourth year He had al lediMrs. Raymond McMillan, Mrs. Frame
Mam to that street. -" nil ntivo nilff1or4t. lifo 0,, it ' , r Kisr and Miss Clara Bacon.
an active outdoor life, and it was in
Kiser and Miss Clara
Mr fiidnev Arderv. Jr.. was the
Our Big Bargain Giving
UNL
rl
C "
QADIN
SAL
Cotinues Unabated,
bringing you the great
est avalanche of shoe
bargains at a most op
portune moment.
REAP NOW
YOUR HARVEST
of our unlimited re
sources; our many years of merchandising knowledge;
our prestige in the world's greatest shoe markets.
THIS WEEK
more wonderful bargains, greater values, greater
economies that will simply force you to buy ' now for
future as well as present needs.
ii
ii ii
11 I
Jl l f
' rV
i, 11 X
' 11 i
r V
L
M
'bfo-L'a
.i. o.- vimmit street, on ac
tiaK- otici., .:-. ! niirsnif nf hie nallincr tl1at i,0 nano-Vif o!
ntt0fnnpeof the earlv pineers of, severe cold, which finally developed ' KUfM of honor Saturday afternoon at
T.lmoni..CL ,Lrn il the site into pneumonia. a sowing party given by Miss Elizabeth,
Xo thP 'colored Melodist church ! Mr. Arkle n?8 a native of England. . Crutcher at her home on n
-.ml wis a for a long tim'.ana came to America when quite a street, me uuma c o,. .
jiow stands and as a tor a 10 i, . fop guest Q h
f f , S Street. Miller , Kentucky, iere. after various loca-who is a bride of a few weeks, and
S?OTIf w thP fnnnder of Millersburg. tions. he settled in Paris to follow hie who will soon go to housekeeping. Re
t!reet L f?Znninicate with me trade, that of a carpenter. Mr. Arkle ' freshments were served. Besides Mrs
rveep uuo i i,i n snnn hpramp nna nt thn hoct-bniMi-n
frnm time to time, j am ui 'i"!::v v.n. s : .,... w, r7 ..r"w":'
...;c vmi vprv iar back m
property, but will do my best.' "
all
the ; contractors in tne city. He was ac-
tively engaged in working at his trade
until a short time before his death.
Mr. Arkle is survived by his widow.
-ha i nrac R?TS GOOD
JtonM . . nnnrnTinM Mrs. AiriiPK Arklp txen rljimrhtoi-c ATi-
BUSIlNtoo rnvm ' ,"- --o-- "- , ' V -"""' "V0
otiuiKe rosuuie inu juiss iaa ArKie,
.AV.
, I hi rnnneVted with the land and James, of Paris. Thomas Arkle. of
SmenfSf the Tefas Land & Oil Lexington, and Albert Arkle, of Gov-
Co at Port Artnur, "biu".
'pral '.ears, has received The funeral was held at the family
eei. at tnree
" .,.. OQt Tn kpw York. oLiuuiv &Leiuct cLLtiruoon, witn ser-
be" rTe.C.""lnSAn n !k York to take Hce. conducted by Rev. w. O. Sadler,
-r-, .Inn.nont TO.. at POrt
Texas, for sev
a
Arclery the guests present were, Misses
Rachel Wiggins. Martha frerguson,
Frances Clay, Nancy GrifTith, Carolyn
Roseberry, Margaret Ardery, Eliza
beth Crutcher, Nell Crutcher, Virginia
Crutcher, Mary Fitfliian Hutchcraft,
Corinne Collins, Mrs. Fayette Ardery,
Mrs. J. W. Young, Mrs. Frank Sledd,
Mrs. Edward Prichard and Mrs. White
Varcten.
(Otlier Personals on Page 5)
i.. :.e i,o.iminrtrs. having residence on becond street
"r , " ITo New York. i o'clock yesterday aftern
.u. t ,-A ft. 1 nastor of tbp Paris Mptl-mriict rlmmii
harce of a big contract iue - - ; f.onrir(1 TJ ,Z" ."'
Mr. Lucas goes to New
t?liarge oi a ub w assisted by Rev. George H. Harris, rec-
?o;rrAnheirrSoiTin the big, tor of St. Peter's Episcopal church.
uo , , Hawill have charge of ie nuriai ionoweu m tne tamily ot
Texas -1 in the Paris Cemetery. The pall-beav-
p ' : bc;;: Pontract. Mr. Lu-jcrs were, James R. Stivers, Harry
uon ""- "--: , is BOURBON Fitlnan. Roy Turner. E. B. January.
Iws'Sanged to VoungstSwn. Ohio , George Crosda.e. George R. Bel..
The Italian government will estal;-
Mr. Taft is insisting upon a league
to enforce peace. It jmignt try -' usn an experiment station in Tripoli
Its hand on Col: Roosevelt as a begHi-lwith a view to increasing its agricul
tural production. t
its hand
ning.
TELL IT TO US!
If you or any of your family are go
ing away on a visit, or it you have
have friends or relatives visiting you,
we will appreciate it if you make the;
fact known to us by telephone (both
'phones 124) or by telling us in person.
This is a, simple courtesy due your vis
itors, and giving us the information
will be highly appreciated by thio
office. The "personal" column of the
country newspaper is one of its most
widely read departments, and nearly
evfcry one is interested in the comings
and goings of their friends, relatives
and acquaintances.
Ladies' Dark Russia Calf Boots
86.00 values $3.69
Ladies' Dull Kid High Cut Boots
$4.50 values . 2.99
Ladies' Patent Kid Cloth Top Boots
$5.00 values 2.49
Ladies' Patent and Gun Metal Shoes
$3.50 values 1.99
Ladies' Gun Metal, button, 2. 50 val. 1 .69
Ladies' Felt Boudoirs, S1.00 values .49
Ladies's Felt Juliets, fur trimmed
. S1.50 values 79
Ladies' Dawn Grey Kid, Also Mahogany
ONE-HALF THE PRICE
Boys', Misses and Children's
Men's Russia and Platinum Calf Walk-Over
and Beacon, 4.50 values $3.49
Men's Russia and Plat. Calf English Walk
Over Samples, 6.00 values $4,00
Men's Gun Metal English Medium Toe Welts,
$4.00 values $2.99
Men's Gun Metal Button and Lace
$3.00 values -j .99
Men's Tan and Black Romeos
$1.50 values 99
Men's Black Felt Slippers
75-cent values tQ
Tan, Most Fashionable Boots at Almost
YOU PAY ELSEWHERE
Shoes at Great Bargain Prices.
FROM THE
MacDonald-Kiley Bankrupt Sale
Men's High Grade M, & K, $ 1 O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to D
ON SALE HERE AT ONE-HALF PRICE
DAN COHEN
Paris' Greatest Shoe Store.
335 Main Street, Paris, Ky.
i
t
n
9
o
Q
iS