'-V
FAGE EIGHT
THE BOURBON NEWS, PARIS .KY..
TUESDAY, JANUARY , lift-
i"
m
-,
MILLERSBURG
,
DEATHS.
Mr, J. P. Auxier has returned from . STRATTON.
sl business trio to Henrv -countv. tv,, r,,nnroi f m ortnn otTori
Mr. and Mrs. Mingus, of New I eightv-tvo, who died at his home near
York, are guests of their daughtei, Broad well, Harrison county, Saturday.
Mrs. A. J. Thaxton. 0f pirrhnsis of the liver, was held at
Kev. a. s. v enable has been -conducting
a house-to-house prayer meet
ing during the past week.
Mr. and Mrs. J. P. Burroughs and
' ' little son, William Virgil, were guests
of Mr. and Mrs. Albert Potts, at Parii,
Sunday.
t Mr. and Mrs. A. S. Miller enter
tained a number of their young friends ,
.fwith rcok Thursday 'evening. Mrs. A
S. Miller entertained a number of her
"lady friends Friday afternoon.
The officers or the Christian
church in session Thursday evening
oxtended a call to their present pas
tor. Elder 0. O. Cossaboom. tor the
year 1917. which was accepted by bin
Elder
Ice churcu
the family residence Sunday mornin
at eleven o clocck, with services cou
ducted by Revv. J. R. Jones, of Cyiuhi-i
01,0 nooittn) hv T7"lrl 1 HP 2 1 1 a T-r n r r
ana, ooin.tu uj -i. m. ww.-fl. ATrcs
Jaetacnvlll. Cemetery. The paU-bear-lgJ" "
ers were B. F. Spears, David Andor-h,1"' - ' "
son, E. Oder, Earl Anderson and J no.
W. Craig.
Mr. Stratton was a bachelor, anl
had lived all his life in the home
where he was born and where he died
He is survived by one brother, Georgi
Stratton.
Hanson, formerly of Paris, and a sister
of Mrs. William R. Thomas, who was
Miss Carrie Hanson, of Paris. Mr.
Taylor had been in poor health and
some years ago moved to Arizona,
where he resided sc)ne ti(me, later on
moving to Los Angeles, California. He
died at Hollywood, a suburb of Los
Angeles, "where he had been for sev
eral months following a stroke of
paralysis. His home was in Tucson,
'Arizona, where he had been employed
' in the legal department of the South
ern Pacific Railway Compnay. He was
a native of Lagrange, and has two sis-
J. C. CLore and Miss Alice
These sisters.
lve him. Airs.
Clore and Miss Taylor had just re
turned from a visit to Mr. Taylor.
The body will be brought back to his
old home, Winchester, for interment
in the Winchester Cemetery.
MATRIMONIAL.
SAUER.
Mr. Fred Sauer. aged about fifty
five, a former resident of Paris, died
Rumors are afloat of several wed
dings in the near future, one, a
young farmer residing not many miles
in the country and a charming young
miss of the younger set in Paris. The
report is that it may occur about the
15th of this month.
TALBOTT SLEDD.
AMERICAN NEWSPAPERS
FACE A CRISIS.!
The shortage in news print paper is
subjecting the newspapers of the
whole earth to a famine that will be
OUR MORTALITY LIST.
Claims of the Prohibitionists Arc
futed by U. S. Official Statistics.
Ra-
Under the above caption, the Satur-
-J.. 'C.mntnrr Tne- nF "DVi I In 1 r1 TVl ?Q ArH.
disastrous to many of their number " ""'. " Ft '
It is not alone in the United States torial .page, issue of October 21, 1916.
that newspapers by the hundreds have' Sves some very interesting informa-
been compelled to suspend because of llon wnicn ousat to mr'
their inability to secure a supply of
white paper at prices that would per
mit them to continue publication. In
every country newspaper publisher!,
are facing the srfme advance in sup
plies in every country they behold
an ascending scale of prices not only
Hobson and other prohibition agitators
who would 'have us believe that "alco
hol" destroys two thousand lives each
day!
I We quote from the item mentioned:
! "The death rate in the United State
jlast year was the lowest ever reported
I thirteen and a half for each thous
land inhabitants. Fifteen years ago it
was seventeen and a half; so we may
THOMAS.
The funeral of Mrs. Clifton Thomas,
aged sixty-sixt who died at her home! at his home in Lexington, yesterday
.Cossaboom has been pastor of in North Middletown, after a long ill jat six o'clock, 'of cancer of the stom
inrrfi fnr spvomi vnnrs. nnii snm ness of Bri spit's disease, was held attach. Mr. Sauer had been ill tor about
... . . , ---- -.,... -L-.J
The wedding of Miss Marie Talfcott.
Im.mlttm. rt AT r- n n 1 ATrc Willj.m f!
Talbott, of near Paris, and Mr. Frank for paper, but for other materials.
W. Sledd, Assistant Cashier of the' Thus we notice that m London, ac
take place at St. Peter's Episcopal ing to the cost of production a number, say that about four hundred thousand
church in this city on next Monday,' of leading newspapers are being con- more people would have died m this
Januarv 15. Rev. George II. Harris, ducted at heavy tosses. The Grea (Country last year but for the better
rector of the church, will be the ofiici- Thunderer has increased its selling care we take of our health mainly by
price and' other important daily news- public sanitation. This ratio, of course
papers have followed suit." As in is for the "registration area," which
London, so everywhere throughout the embraced only two-thirds of the popu-
' British possessions, but the news- lation. Probably the remaining third
ating clergyjman.
hold at Winchester. February 2S and
March 1 and 2, Commissioner of Agn-
tihie ago tendered his resignation,, the lamny residence in iNorui .Mia- a year, previous iu mai hc uuu uw
which the officers in their last meeting deltown, Saturday morning at 9:3 in the Lexington hospitals at intervals
refused to accept This speaks tK o'clock with a short service, after under treaflnent for relief from the
high esteem in which this clergyman which the body was taken to the Log malady that finally caused his death.
.... .. " . 1 Jl- .-.-. -...- tr Plol- nnitntv wlor,l l "XT'.. Count. ll'OO 111 illf OTflPPfV 111IR1-
35 neiu oy ins congregation. u,A.mcic mv.u.v.., "" I -'. . "?- '" ""- -"r "" . l,.itnro Tnt s Polien has announced
services were conciucteu at me grave ness in rans ior several yeuis, mwv " " ; ,, r V i rtAo-r;P1)if ,,,.,
Cards are out announcing the mar- Mrs. Thomas is survived by her ing to Lexington, where he engaged that tne btate tsoaru oi Agricuiiuit-
riage of Mr. C. B. Bastin to Miss husband. Mr. Cliften Thomas, and two in busines. He is survived by two chil
Adelaide Clingman. both of Detroit, step-sons, Mr. Walter Thomas and , dren, Keller, pged twenty-five, and
Mich. The wedding will take place Mr. Clay Thomas, of North Middle-jjohn Wesley, aged twenty-three; and
on the evening of January IS. Mr. town, one sister, Mrs. Pleas Hill, of the following brothers and sisters.
Bastin is well known here, and fo Winchester, and two step-daughters, William Sauer, John Sauer, Mrs. Jas.
several months was local manager for Mrs. Williafn Collins, of Maysville, andiDotv and I Irs. Ida Batterton, of Paris;
the Bourbon Home Telephone Oo. Ii Mrs. Lucy Dayton, of ML Olivet. Mrs Mrs. Wm. Mayfield, Dayton, O., Mrs
FARMERS' INSTITUTE TO BE
HELD IN WINCHESTER. papers of the United States long havp fared in about the same way, though
been strutrelimr with conditions even tihe fact that it is not enough inter-
was durinjr his stay here that he was Thomas was an aunt of Mrs. J. W.
united in marriage to Miss Curly In King, wife of Patrolman J. W. King
skor After leaving here he went U cf Paris.
Detroit, and in the autumn of VJlo i
Wrs. Bastin died. Her remains were FRANCE.
interred in the Millersburg cqiietcry j Mr ag w France, a well-known
- Her funeral services was conducted and prchlinent citizen of Plemings
,oy her pastor. Elder Clingman, of Be- b died at hjs home in that city at
trOiU It IS Ills aaugiuer mat ia nuw n.ninni. curt,yr mnrnim?. nftor
a short illness. Mr. France had been
ill but a short time, and while it was
as
no
Mason,
Of. Aimity UOOge iVO. U. lliun mdiij ,. Tnnoo wn ihn fnfhor of Mrs
mends about MHieisburg extend con- w Q Sa(ller wife of ReV- w. 0. Sad-
Ashbrook, Elgin, Ills.; Mrs. Thomas
Rice, Maysville.
The funeral arrangements have not
been announced, but the burial will
take place in Lexington.
to be tilie second bride of Mr. Bastin.
Mr. Bastin is a devout Christian and
RELIGIOUS.
is entering the ministerial work in the knowil that lhis condition was such
Christian church. He is also a good . warrant apprehension, it was i
lsoii, ami at one uiue wa a muu.uc; ;Ul0Ught the end was so near.
Amity Lodge No. 40. Their many France was the fathe
The States Farmers' Institute will be more difficult than those their foreign ested in the matter to make a proper
contemporaries face. report of vital statistics rises a pre-
We note that the New York Globo sumption against it"
has informed advertisers: "On ac-l Accepting the figures of the Satur
count of the limited supply of whit day Evening Post, the year now ap
paper the demand in the United proaching its end shows the best ren
States seriously exceeding the supply ord of any as to the Nation's death,
had decided upon the time and plac
On alternate years the institute is
held at Frankfort. With the assump
tion of all agricultural extension work the Globe will be forced, at least rate.
by a committee of University of Ken- temporarily, to limit the amount ot ad-- The figures of the International Re
tucky trustees, the county farmers' in- vertjsjng which it can print." In fa 'enue Department in Washington for
stitutes have been abandoned, and the cilitation of llhat poiicy the Globe has the same period show a steady in
State institutes is the only gathering ... , enrips nf rather strintrent 'rronsp in Tntprnnl Rp.Vfinne receints.
The plan of work now fostered by rules. The New York city papers gen-1
the Governor through co-operativo erally have made a considerable re
funds is bv dfhionstration rather than (taction in the amount of white paper
lectures and conferences, the iatte" used. Taken collectively, tney are cirawals from uonu anu increasea saies
being limited to local farmers' clubs printing about 100 less pages of read-. to dealers and consumers for the sani3
for discussion of community Prolj-,ing matter than they were a year ago. 'period of time,
lems and co-operative enterprises. In the central section of the coun-i Were our prohibition friends capa-
try, under the leadership of the more ble of learning anything, these facts
prominent papers, prices have been and figures should be highly discourag-
SWAT 'EM NOW.
The books of every distiller, brewer,
wine dealer and wholesale liquor deal
er in the country show increased witli-
cratulatious.
ler, pastor of
church. Rev.
CELEBRATES TWENTY-SECOND I called to his
ANNIVERSARY OF PASTORATE.! wnen jt Was
the Paris Methodist
and Mrs. Sadler were
bedsile last Thursday
Sadler having cancelled an
...s.. tn .itr- nnrl in t.lo nillll
; Midi". IV uirt jui i. mii ., . ".
Dr. I. J. Spencer, pastoi of the Cei:
tral Christian church, in Lexington
and father of Mrs. William I.. Ardery. stallation of officers of the Knights
of near Paris, on Sunday celebrates pvthias at the Baptist church. Th
ihe twenty-second anniversary of his funeral will take place in Flcniingn-,
pastorate with that church, l ne event mrs to-day
was marked by the delivery oi two
special sermons, one
very generally advanced. Canada, that ( ing to their unsupported claims as to
'supplied a considerable part of the, the accomplishments of prohibition.
This is the time tor the housewife print pa(per used in America, can give On the one hand we have an enor-
ruviiin- tr, Hip ih?pncp of Rev W O to fetch out the hy swatter ana gee no relief. jmously diminished deatn rate ana on
Sadler, who was in Flemingsburg, tto work on those old, dreamy flics j The Kansas City Star conoludes its ( the other a largely increased sale and
where' he was called by the death of which are the bane of the well-heated ( "Scores of newspapers are likely to be ( consumption of wine, beer and whisky,
his father-in-law, Mr. J. W. France, the hoUSe in winter. There is no reason put out of business. The others must I The prohibition agitators will meet
drastic .means for increasing these facts and figures with their usual
their revenue or they must cut down evasion and misrepresentation, but
In either case the puo- facts, and especially government fig
jmust finally foot the ures, are stubborn things to deal with.
i Sane people who are honest with
thought that the coiuli- pulpit at the Methodist church was fill for letting these half-hibernating in f,n(i
I.S -P tV.. nni.'nnf woe nln t Irtiiifr liof Cd bUlKlay mOoling UJ lte. W. -l-' , rnmnin with 11 nil Winter. laV- tlioi
I ' 4 "- i.iw. ..w.. u..... ..D, ! ,i: e iu r. 1'uw v.... , . "'" .w.....-
engage- aunt, oi uei ifaiuii. t"ltu.1 "l " " hig eggs and living on the fat of the, their service.
& o"; "- or Ger b UA- Tb-y -o to be found .un He or eorSe,
, mi . electric fixtures, roosting upon pict- bill."
TAYLOR.
Dispatches to the daily papers Sa-
in the moraine
on 1 ne t Our lilg L s. aim unc in uiu
cveninir on "A Look Forward Into the .
Book of Hebrews." More than half or unlay told of the death in California'
Br Spencer's life has been spent as .i ot Mr. Gibson Taylor, a former resi-j
-ministpr of the GosDel. and the Cen- dent of Winchester, where he was a.
i
BIRTHS.
ure rails; and in all the other numer
ous crevices about the house.
THE NEWS is not sufficiently vers
themselves will draw the conclusion
GREAT POSSIBILITIES IN SILENCE that the nation is going along under
constantly improving conditions of
At a tuberculosis sanitarium in sailitat;.jn ami sobriety, and while us-
dmatics to be able to give' the exacr ' -Maryland a cuie has been effected TOore fre(jl k fe u,. but
yy . , lX , . f r U ; with only unbroken silence as medt- . , .
figures; but Uie slauguter of the win- inont Pniumn mm- not abusing.
In almost every city the colored
ed in insectology or the higher math-1
HARP.
John W. Throckmorton.
. i, i t.i .,:.. tl.n
ter Hies in an nouseb woum ' f!W,flirw l.-pnt silpnf. f.ir a vear to frive
'community a good start next spring, tl)e tjssues 0f hs vocal organs a death rate is substantially higher than
of when those which have wintered out'nhance t0 strengthen and thus resist the white. In a number of cities, in-
- t u: :., ni.ur.nh mc nnro inn.-, nrnmiiipni aiinrnnv. :iiiii iar liiiiiiv ! . aut.
doubled its niemberhip and has more vears identified actively with the bu Lexington, one of the best know a 0f doors, or in warehouses and like the spread of the tuberculosis infec- eluding Northern as well as Southern
than trebled its Sunday school under iness life -of the community in whicn former conductors on the Louisville v: places brjng forth their offspring to tion. He is now in good health. The towns, it is donble that of the whites,
his ministrv He has held "more than he lived so long. t Nashville, is the proud grandfather ol contaminate the entire community .treatment is such as we should like to and in a feu, place3 mUch more than
TOne hundred evangelistic meetings Mr. Taylor, who was fifty-four years a fine boy born to Mr. and Mrs. Roger The numbel at all events, will be see prescribed by physicians ma double For all resistration cities m
outside of his pastorate, in as many as old at the time o nis .deatn jns weu iiar ?. in - b-- - . ---;-- 8ufficienUy large to make interesting - ' uS rruiV "hich the colored population formed
Hie &tfl.UllU Villllll Ul L IIUIWWUUIU, ..lw 4J MIUUIU UIIMIU, - ln-vJW. .wwv. -. w- ,
?. score
of States, and has receive-l known in Paris, having married Miss
thousands of persons into the churcb Sarah Hanson, daughter of Mrs. Chas. been named Roger Harp, Jr,
the winter extermination.
KSI
BANKRUPT
HHHHHMUM
SALi
Bought From
R. de V. CAROLL, Trustee of
MacDONALD-KILEY, BANKRUPT
Men's High Grade M. & K. $ 1 O.OO and $ 1 2.00 Shoes
ON SALE HERE AT ONE-HALF PRICE
A WALK
GREAT
Clearance Sale!
' -
l
11
11 11
11 ll I
11 W I
i (
11 II I
Ji ll I
Js l ll L
Jy 11 11
Jy ll ll I vV
ii ii i v
m 11 11 v
ll 1
II JJ II A
II Cs II W
i JL II l
f m
M(-(5ua
All short and broken lines must be sold at once.
Prices marked are far less than the actual whole
sale prices.
Shoes Rubbers Slippers
Included in this extraordinary value giving sale. The following are
but a few of the many bargains that await you here tomorrow:
A. -C i.1. A Al J .- Al
n hPinjr nnssihlv svmtomatic of grave- ten per centoronore ol uie tuiai ueaciL
'complications. Scilencing the great rate in 1914 was twenty-six per
.army of people with colds, who insisc thousand, against fifteen for whites,
o ntelling how they got them, and as to the higher death rate among
how they are trying to get rid of theai, (jie colored population, to which the
would be something, in fact much. Saturdav Evening Post draws atten-
But we iook Deyona any umiutuuu .. .. . ,1llo , u niwav, hn4;
UllAly U J V.V- vw
of broncHiial or pulmonarj' disorders
Now that we have heard of the cura
tive power of silence, something in
the efficacy of which we have always
believed, no pent-up utica shall con-
been, to the wretched habitations in
which they live. This is especially true
of the cities where they are unfortun
atelv crowded into the districts not
Ladies7 Felt Boudoirs, SI. 00 value, at 59c
Ladies' Felt Juliets, fur trimmed, S1.50 value, at 99c
Ladies Dark Russia Calf Lace Boots $3,95
Ladies' Dull Kid High Cut Boots .'$3.49
Ladies' Patent and Dull Kid Shoes $2.99
Ladies' Patent and Dull Kid High Shoes $2.49
Ladies' Gun Metal, Button, Low Heel $1.69
Ladiei Dark Gray Milady Boots, all sizes AA to D, $9.00
Quality, at Bargain Prices.
Men' Tan and Black Romeos. $1.50 values, at v . -99c
Men's Black Felt Slippers. . . .'- ". --49c
Men's Russ and Platinum Calf English Walk
Over, samples $4.50
Men's Russ. and Plat. English Walk-Over $3.50
Men's Gun Metal English, button and lace $2.99
Men's Gun Metal, button and lace, good quality $1.99
Men's Heavy Work Shoes, good quality $1.99 up
T-
3D
.A.
3ST
Paris' Greatest Shoe Store.
COHEN
335 Main Street, Paris, 'Ky.
tract our powers, but the whole bound- deemed desirable by whites.
less continent of disease is ours. The That contains about the whole story
man who regales his friends with de- o a faiing death rate, for undoubtedly
tails of his pains and aches; the one colored population of cities lives
SvZm&STtf 'whEo under .esS sanitary conditions than tno
fearful soul imagines fatal ills at any wnite..
visitation of pain through which kind ! Of the million and a third persons-
mature may be setting aright some ir- roughly who died in the United State3
regularity in his system; all and sin-iast year, about one-quarter were un-
igular the multitudes who die everyjg,. five years of age, and over two
day the death of fear, and who afflict nundred thousand were under one
Uheir friends with their dolorous cries j probably. that at
7ef the SLSSSSToZ nV11 rtac,s upon the death rate car .be most
(have trained nurses set over them 10 successfully made; for tuiere is no
see that they take their medicine. doubt that an important part of the m-
There is hope in the Maryland expe- fant deaths is prevantable.
riment from more than one point of ignorance, not alcohol, is accounta
view. If silence is curative, let it be e for tne large percentage of infan
used on those who are really afflicted. tn d iuveniie mortality.
If its compulsory use can be made to
disband one great army of hypochon
1 driacs, so much the better. St. Louis
Globe Democrat.
Divide the family responsibilities
with the older children, but do not ex
pect them to use your head in carrying
them. These should make a sort of
training school for the big ones that
they will have to handle later.
s-a.
tSilJ
&Plfl
lMk ffcw,,A"v
yV..3L '
IfAoS
IH1 hiTL(
t7yyf!J3Sw7-
7m old
KmgCoaL
oldsouZ,
WsJTndlma&e
JtJio1rom
pole to pole
WWMjW
COAL is the king of Na
ture Chief Engineer
of the world's prpgress
toward comfort. For cen
turies the sun has been stor
ing in the bowels of the
earth the heat values we
find in coal. The quality
coal we sell is impregnated
with the proper caloric units
to make a comfortable heat.
It is the fuel for your fam
ily furnace.
FOX RIDGE
Hot -Stuff
. C. D0DS0N
- - - .
The falling death rate is a result of
social action, a strictly co-operative
product. This has been most vigor
ously applied in cities; so the death
rate, the country over, is but slightlv
above that of the rural districts. In
New York, in fact, the city death rate
is lower than the rural.
And yet, it is in the cities that
liquors, especially among the unsani-
tary, are the more freely used.
Every statement and all the figures
of the Post's item tend to refute the
nrohibition asseveration that the in
j creased use of liquor is the cause ot
increased mortality.
I The year's record shows just the
(contrary greatly increased use of
liquor and enormously diminished mor-'
talitv. From "The Bulletin."
COURTESY OF THE EDITOR.
Authors not infrequently get miffed
with editors who for one good reason
I or another decline to publish their
I "manuscripts. Perhaps the men of the
quill are not quite so courteous as the
'editor of a paper in Peking, China.
who in declining a manuscript wrote.
'Illustrious brother of the sun and
moon! Look upon the slave who rolls
Jat thy feet, who kisses the earth be
Ifore thee, and demands of the charity
I permission to speak and live. "We
I have read the manuscript with delight.
(By the bones of our ancestor -we
i swear that never before have we en- ,
countered such a masterpiece. Should
jwe print it, his Majesty, the Emperor.
I would order us to take it as a criterion
and never again print anything which
was not equal to it. As that would
not be possible before 10,000 years, all i
tremblingly we return the manuscript "'
and be: thee 10.000 D&rdons. Sa
my head is at thy feet and I am tk
shvr of thy servant" Biblical Ro-ord.-
I Ifthamewspaercttka,,!!
iO kttirv omll--i im m. hit kard tin .uJ 7
"&Vr -. -ax . M. ,,, . .
i
"IIW1, AMfTUI n. U.J
r
X
V