PAGE EIGHT
THE BOURBON NEWS, PARIS, KY.
FRIDAY, JANUARY M, HIT.
'
;!
c -
4
Hi
l '
'H
! if
I .
M
'W
t
s
ii
-
IV
U
i
H
U
r l
;!
f
j
,i
i
i
Mi
i
J
3I i
Ii
:
t
MILLERSBURG
a
if dead. This should awaken an inter- -est
in Millersburg not only with the
good people of Millersburg, but '
throughout Bourbon county, and at the
same time should largely increase the
circulation of THE BOURBON NEWS. ,
DEATHS.
, Grannan, both, of Cincinnati, and Mr. f ,
' Joseph Grannan, of Kansas City, Mo.,
all of whom were at (her bedside when
a nie ena came.
Mrs. Clara Shanks continues quite Tnis is 0le only paper that will ex
ML plain this history. It will be prepared
FOREST NOTES.
r
RELIGIOUS.
SOPER.
(ln 1711.. r I l.l.j ,. I T'rkofr- of tlin rnnnr. "TO.. !...,. T1 .
Mrs. Neppie Rigdon is confined 1-. Sr STTnS Sin?; ?? .. died at the home of her sister, Mrs. atory, at Madison, Wisconsin, indicate
A. U. Robbins. between Grassv JAp'x tihat hv thp iisr nf tnnr nririitinnni rm?i,-
BIRTHS.
tier home with the grippe.
THE BOURBON NEWS only. If you
are not now a subscriber, send your
unu Liuie iujck, in tins county, rues- in each end an increase of 300 per
"T7!'orTT.;,.i nto!. mju.i r suhsp.rinHnns tn tthf nffino nr if in nr U1IU 1-1i-" "
"Sverywoman." will be given in th- about Millersburg, send it to the cor- (la.y m?rnim?' aftepr1 at1(mS illness of cent in the strength of canned-foo'I
M. C. Auditorium this evening at respondent, R. M. Caldwell, who will fj"11 J:r?ubJe- . h? ba?yTT7a,s k111 boxes is secured,
eight o'clock. A pleasant evening give it immediate attention. The l ACa f e J01 ednSfday-1
awaits Uiose who attend. Admission writer also asks the good people ol ,,ie uas a daughter- of Mrs. Frau There were 135,442 more cattle and
25 cents. Millersburg to render all the assisi- &Per. ana a sister of Mrs. Robbing horses, and 605,338 more sheep and
ance possible in the making up of this'aml Mr- Frank sPer of thls county goats using the' NatIonal Forests in
f7 Ml'ri"" SCi? IJJJIl 55Tn. I1916 ian in WW. This increase was
cay meeting Wednesday, at the home as the work nrosresses. This can be! The funeral of Mary Ellen Logan, n spite of large ehmitations of gra-
10:45 a. m.
--
:t- peters Episcopal church. Re .I Near ML Carmel, in this county. In
.' i n 'on warris rector. Sunday the wife of Mr. R. D. Worthingtou, a
school, 9:30 a. m.: service and sermon, rimihtr
I To the wife of Mr. Malcolm Arjtn-
tm,o. rn -r, , , , . ,. , stroiis, au rarmvuie, irKiaia. a. own.
doovnr c;t p u ,..-. ,". christened
UwU.Ut uuv-icij, ui me uribtian cuurcn
Will linvo nVioirrn f r.n:..l
Simdav PvpnTnt n ii yi."bi;1"1 Nora Foster, of the Cumberland Tele
SES&ZTh'eMSM ." ,"'0ne exchange at MUler-sbu
Z01" ''"i.il1.?.1:1? FieUU" a:thousands of dollars lost
Rev. W. A. Hopkins, of Lexintr-
ton, who was sometime ago extended
Malcolm Armstrong, Jr.
Mrs. Armstrong was formerly Miss
THROUGH RUSTING MACHINERY
All farm implements should now bo
of their pastor. Rev. j W. Gardnci made indeed interesting -If the f cUiiens ?ve,l?oUls-?,d dausl,ter f Mr' and mg fTr , Fre, ' , 'acaJb pastorate of the P,' , Tt ""Tr 7
An interesting nrogram was rendereo. will co-operate with fine writer, and K 1Mrs' J56 LSan' who died at the counted for by improved methods of prbVterIa: -hurrf? vmLllJjlS under shelter and be put m first-lass
and a delightful lunch served at noon they will also mianifest an interest in no.me ?f its Parents, on West Street, in handling the stock and by more inti
I desire to thank the good peoph
T Millersburg for their many demon
stations and acts of sympathy ex
tended during the illness, death and
Tiurial of my wife, also to Dr. John I".
alhoun. and the undertaker, M. E
Pruitt for their professional efforts.
&ad Bros. Cossaboom and Gardner, and
;tlie singers for their consolation.
STROTHER INSKO.
the work
NEWS.
by subscribing for THE tl,is city' Wednesday morning, was mate knowledge of the forage on the
.nexu ul uiu lanuiy nome ai ten.o cioci:; ranges and their carrying capacity,
'yesterday ,morning, with services
'conducted by Rev. W. E. Ellis, pastor Tne number of fires suppressed on
'of the Paris Christian church. The .National Forest lands during the cal-
. burial followed in the Paris Cemetery. , en,dar year 1915 was 6,324, as against
Mr. and Mrs. Logan came to Paris' 7,018 in 1914, and an average annual
frcVn Nicholas county some months number of 4,759 during the past five
O
STOCK, CROP, ETC.
f
ago.
Tarr & Mitchell, of near Millers-'
TiiTrr o"v1l -
- . . UU1L,. ouiu ui
miss Kings class m expression ,, " ,.01.flhni,en ;
JVI-1 :. . """ "o'cuuuoo, in.
The M. C. auditorium. This is the sec-
GRANNAN.
uurg, sold on the breaks of the Bour-' The funeral of Mrs. Anna Grannan. ui i V i , pu UL uie 'ouowing circular k
i. v. j t-: n- ,' ., .,... , ' . . . . u,d"' the averase number of fires occurred i frnm thn P.-Qfnfl;nn n..
ii x . . . . uuu naicuuuau. iii. zru.i is. .iiii iiniiiiiis jiithii piirni.v-ii vo wnn riiori nr inr -r.i .---,. .. i. uutvinv, lycuaiuncui
.I"? u" a.?iiL.JS.e,Ye!lins al of loose leaf tobaca) that averaced idence. on Main street, near Tenth fn. the timbered area burned over was ; Washington, in wfliich his co-opera tion
(J1C Q1 rfV V t rl -Vl Mtn1n
-vnfl initiiKnr f i, T w.m n ,. ',10-01 C1 uuuuicu Kouima.
and we kny w that it will be well ren-1 W. B. Burton, biule buyer, of Lan
aered, as this gifted woman never caster, recently sold a car load o'
plages any thing but good things. Ad- mules to R. H. Best, at "Warsaw, N. C.
mission, 25 cents. Let everybody go. There were 25 mules in thr shintrmn-
and they brought an average of $185.
ouimu wiuicii. win oe extenueu condition for next season. The binder
a Call tO tlhe Msivsvillp rlmrili oiil ' . . . . . ,
if ic tHr.ncrv.f i, ,..-n -."" should be repaired, now ana not wneu
it is thought he will accept. Rev. , . . . , , L
Hopkins preached a trial sermon ai you aro ready to begIn work- Delay at
Maysville last Sunday at the Central harvest time may mean the loss of
Presbyterian church. inany dollars. The same principle
! holds true for all other farm machines.
j Too many farmers are careless with
ENCOURAGING PARCEL POST tue equipment which .makes farming a
SHIPMENTS OF FOOD PRODUCTS paying business. In every section of
the State farm machinery can be seen
PoStTTflKtPr .T Wflltop Pavnu ic in T-r ..i. r .!. tt e i. i
port just published. While more than ceiDt of the fnllvfmr o.vV. Tnr w or UUL 1U uie "eaLmjr 1UI weeK: rtUU
:, . , ceipt ot tne toll-owing circular letter months at. a timn. Such nrantices car
at ,, i.l.n. ,. f V. r.ln TUhnf
ixy inc yiuiivo ui 111c iuiu. m uuk
would the farmer think of the manu-
years, says Henry S. Graves, Chief of
the Forest Service, in ihis annual re-
this city, "Wednesday morning, after but M16 acres, or 30 per cent, lesd is asked in the matter of encouraging
' The Cemetery Board met Wednes
day morning and released A. T. Hillock
Myers & McClintock, of Paris,
as sexton, who :iad tendered his resig- bought from farmers in Nicholas er ine PaiI-earers win oe ur. v.
nation some weeks ago, and appointed i Harrison, Fleming and Motgomcn C" Usserj' E- M- Costello, William H
in his place Mr. S. E. Bruce. Mr. r.onntis. ?R bond nf nA mS fi,Webb, Dr. F. P. Campbell, James M.
Hillock retires Februarv 1st. at -ivliip.h j ssn o oo r cn-rr .. i tO'Brien and E. M. Dickson
time Mr. Bruce will take possession l The samo firm sniri n inri nf Tn,,i" Mrs Grannan was the widow of Mr.
Mr. Hillock .purchased a 320-acre to a Lexington buyer for an average of
sarm in. iuisbissippi. last lan. iie amr about $185 per head
ims ramaiy win moe to it early in
a short illness of pneumonia, will be j than the average per year for the pe
held at the Ohurch of the Annuncia-iriod 1911-1915 inclusive. The average
tion, in this city, at 9:30 o'clock this loss per fire was $60.41. Forty-four
(Friday) morning, with services con- per cent, of the fires were confined to
ducted by Rev. Father Eugene De- areas of less than one-quarter of an
Bruyn. The burial will follow on tlw'acre
luuiuy ruL in me runs uliioiic jem-:
During line fiscal year 1916, 705,872
acres of National Forest timberlands
were estimated and mapped intensive
ly, and 1,093,006 extensively. In all,
farmers and others to hsr Hip. nnrw.!? racturer wno neglected nis machinery.'
post system in disposing of their foodThe manufacturer would be a mighty
products. : poor business man, yet the farmer, whu
"In view of the high prices of lood is the greatest producer, allows his
products now prevalent throughout the machines to rust and go without care,
country, it Is desired that you adver I Every farmer should have a ,place to
use and advocate in everv wav ,nrac L i x.- u Z -i-
ticable the facility offered' by tjie par foreaus machinery. A small building
eel post for the shipment of fanm pro-io sltnPIe construction, located be
ducts directly from the producer to the .tween the house and barn is best. A
consumer. Investigate thoroughly this! long shed not more than 18 feet wide,
matter as it affects your city and be provided with continuous doors along
20,815.798 acres have been mapped by i prepared to advise patrons and civil one side, is more convenient for re-
intensive methods and 47,291,660 by ex-1 organizations in an intelligent and j moving implements than a wider
S"LnS?1!?n rLomDare . P5' building. A small shop included at ons
cpPnnri ynnA of vrmv mo f uiny. end is a great convenience in keeping
The work of classifying and opening ' r,.!0, f ? i ? 'imolements in reDair
. . . , . ,i i ii eggs, fresh meat, and other farm pro-. umpiemenis m repair,
to homestead entry such ands m theiduce with the ices for theM
National Forests as are chiefly valua- ;modities by your patrons. The differ- SECOND KENTUCKY REGIMENT
ble for agriculture is .progressing rap-jence is the "present cost to the con ( TO GO TO FT. THOMAS,
idly. Already over seventy million jsumer in your city of bringing thesM
rimrton. Mr. Pence will move his shon eniofl whirh i mmiiriMi nf cnor.i nmi Mrs RiHinrri WniKh nnd nnii.acres nave Deen covered oy neia ex-i.oon proaucts irom tiie fanm to th"! The Second regiment. Kentucky Na-
frri-n Uie room now occupied by him. ' glass to absorb certain of the ravs of grated from the old country to Amor--animations and the final reports acted table. Compare this cost on various tional Guard, which it was planned to
Slie WaS mar- UPOn. u.nwwi ..iuh uic JJUH.Ci'pul. tlWlge JH UIIUK UI LiU.XUlgUJIl 1UI UUUlUUllttlLlUil.
February.
Mrs. T. R. Rigdon and Alfred
Ponce will open a barber shop and pool
room in the property oi the I. 0. O. P
lodge, on Main street, recently vacated j developed to a diigh degree of perfec
Such a la;np has now been pat
SCIENTIFIC LAMP.
The electric reflecting lamp, some
times known as the projector, is bein- native county Waterford, Ireland,
Joseph Grannan, who was a well
known resident of Paris for many
years, having been engaged in the : tensive onetlrods
.merchant tailoring business here for
the greater part of his life. Mr. Gran
nan preceded his wife to the grave In
heoruary, su. iurs. urannan was a
&y tjhe dry goods store of C. W. Coi- tion.
where she was born on October 19.
1832. She was tfie daughter of Mr.
The new shop when completed, and light which are recognized as more or a in tne Garl' da's
TV0 Tr"1 T"VtV 11ffV 11 f -- niim
rrr. "mTr "rVVr"."i"'.less injurious to the eye
Ajjcu.ua, w in ij; uiic vjl uir luuai. vjju-I .
plete in Central Kentucky.
The writer proposes, beginning
vith the next issue of THE NEWS to
Sive a brief history of all the property
of Millersburg, beginning with Mai eh,
1SS9, at which time die .moved to Mil
lersburg. He proposes to take up the
property systematically, beginning at
the head of a street, and taking the
The injur-
ried to Mr. Grannan in Maysville,
coming to Paris in 1860. where they
occur toward, and beyond, had bth resided c011tinuously sIllc
end of the spectrum, oy , MrS- Grannan was a woman of re-
i lueutifui mpiueius iuoui in sman iois win ue sent to rort l nomas, accord
Investigations by the Forest Pro- and m 50-pound packages.) This dif ing to plans submitted by Adjutant
ducts Laboratory, at Madison, Wiscon- ference, in each case, is what may be General Tandy Ellis to the War de-
naa oeeu
ious rays
the violet end of the spectrum. By, MrS- Grannan was a woman of re-'e,-,, w mcitmi ,ft iio'nf nPn saved on a commodity by those who S partment. A proposition
moulding tiie reflector of a greenish- mnrk-nhin mpniniifv nnri nno nf Iip.- . ', , . , " r. .,. to tno trouble ot making an arrangi- made to d"piobiliz th Second reel
yellow glass these upper rays of light chief pleasures in her later days was J?"" " lZ "., niipn nTnP ,n?"L for securm- foo(1 supplies by par -ment at Lexington, but as given up
are absorbing, and the reflector gives to ihave friends call and tell her of sh,g, I? the extent ot 100 tons pei ce ost. atter a Board of Commerce cosnmittco
off a soft yellow. It has been found the important news happenings of th- week- T.hc value ,i the ,a nas been farmers within the first and set- had made an in cstigatisn and foun-1
treated light is' day, both at home and abroad. She 'e,e.v ":i-uuht:u uum- w iit& f unu .unw sutmm ue mspirpu y inj io suitaoie quarters wnicn couiu db
hnil n kppn rpusp nf hnmnr mid m.-, 2.50 per ton. uui.jhi uuiiiui eu opporrunity to ex- nmup avauxoie without consiueraoie
that this specially treated light is
more effective in piercing fog and mist ,
than ordinary electric light, and tht
at her happiest when relating som
of the events of past days in Pari.-,.
She was a companionable, whole
tanT.3si unnmreu opportunity to ex-
. XT .. . panel tho luiiupss or producing and expense Tl:e First and Third regi-
There were cul irom the iNatiomu soni,lg dirpctly to xhe consumers ii meiUs w ill probably be demobilized at
Forests in the fiscal year U16, 604, your city butter, ectrs and such meat i nnicvillp. mid nrrnmrpments are beinir
souled woman, a charitable one who -"."" uuuiu letx ul lhuwci. ui una aim veiieuuiie pronucis as your nivos- made tor the mustering out or tne
never let anyone suspect her manv amount 110.483,000 board feet was cut tigation shows can be shipped in that State troops there. The demobiliza
kind rtpprts Shp was a devoted meni- under free use privilege by 42,055 indi- way with a sufficient margin of profit tion of the troops will not sever the
property in order. This will also fur- new lamps are being used successful
nish fairly a good history of Millers- for fog-lamps.
burg fnTi 1SS9 down to the present. ,
If this plan is carried out it will re-' FEED THE BIRDS,
quire about two years to .publish the
same, wilih one piece of property each The Fish and Game Commission ha - strictly up to its teachings in all her were made, of which 97 ppr cent were that this buesiness can
ibue. ne iisu piue w ten :u iu. uuen requesting peopie to leeu me life and in Uer dealings with the world uuder $100 in value, indicating the ex
as he can where the occupants of the birds. It has been our observation , and the people ar0und her. tpn, to which the .homesteader ranch-
various pieces of property, who were- that some Paris people have been feed-! she is survived bv the following . ,, uiomesi .aaer, rdrn.ii
here at the time of his arrival, or have ine several "birds" who snpnt their -u.-i.i-.,. Air.-m n x. er,nuiier, hiuuu muuuaii. .nm uLnuia u.
moved from here since then, now re- money last summer riding the Sunday .Elizabeth Grannan. both of Paris; nee(l or a limlle(1 Quantitj
side af living, or where they are buried excursions to Cincinnati. Miss Marv Grannan and Mr. Edward draw upon the Forpsts.
ber of the Catholic church, and lived viduals. In all. 10,810 sales of timber
of timber
IjljJJIilliiJSI u
&WALK
&OVER
z
In All Departments!
All Winter Shoes and
Rubbers Must Go!
Despite the great advance in the price of Shoes and Rubbers, w e
have greatly reduced all short and broken lines in Men's, Ladies' an d
Children's Footwear.
PREPARE NOW!
An opportunty offered you to supply yourself for present and future needs,
and take advantage of this BARGAIN CLEARANCE SALE!
ILK mWlSL. JftlStt JPeL$?
Wmr BHI fi kM
They should be cautioned, however, connection of the individual melnbers
n-.it be de- with the national guard. Those mem-
veloped and maintained unless they bers cf the guard who took the re-
are willing to share liberally with the quired Federal oath will remain mem
customer in the city the saving whicL hers of the guard and as such will be
is effected by parcel post shipment reserves of the United States army
Farmers must be brought to under- until the expiration of tiheir enlist
stand Unit the city customer in dealing ment. Other members of the Ken
with thefm by mail foregoes the advant- tucky companies may leave the im
ages of credit, -personal inspection of tional guard after thirty days from do
goods, and immediate delivery, aii'I mobilization.
that he naturally can not be expected
to deal by parcel post unless he can
be assured of better products at less EVERY TIME WE WINK WE
price. j GIVE THE EYE A BATH
Come here tomorrow
Ladies' Dark Russia Calf Boots
6.00 values $3.95
Ladies7 Dull Kid High Cut Boots
$4.50 values
Ladies' Patent Kid Cloth Top Boots
$5.00 values
Ladies' Patent and Gun Metal Shoes
$3.50 values
Ladies' Gun Metal, button, $2.50 values
Ladies' Felt Boudoirs, $1.00 values
Ladies's Felt Juliets, fur trimmed
$1.50 values
3.49
2.99
2.49
1.69
.59
Men's Russia vnd Platinum Calf English Walk
Over Samples, $6.00 values $4,00
Men's Russia and Platinum Calf Walk-Over
and Beacon, $4.50 values 3.49
Men's Gun Metal English Medium Toe Welts,
$4.00 values 3.99
Men's Gun Metal Button and Lace
$3.00 values
.99
S Men's Tan and Black Romeos
$l.o0 values
Men's Black Felt Slippers
75-cent values
1 .99
99
.49
j Every few seconds we wink both our
'ENTERPRISING LEXINGTON eyelids at once, although not pur-
HANDS OUT ADVICE posely. If we stop winking, our eyes
became uncomfortable and gradually
1 The following editorial appeared in cense tv uork as they should. When
'n recent issue of the Lexington L)ail.. uhe eye is open the front of it is ex
Leader. Coming frr.m Lexingtor. posed to dirt and dust and is apt l
.which is always grabbing off ever- become so drv that a painful stinging
thing in the way it can from the mer- sensation results or would do so if con
chants of the surrounding towns, r L moistlu.0 were not provided to
does have a strange sound. Pans peo , , . , n ?.
pie who have been admonished tod, cleansc and othe the tissues
'their trading with home people, and! As a matter of fact each tune we
who seemingly prefer to give their pat wink we wash the eye. says the PopU
ronage to Lexington merchants should lar Science Monthly. Up above each
read every line of this editorial ani eye is a tiny water bag cailed the tear
see if it doesn't have a strange sound giand, and all the time we are awak
somewhere: ;it makes tears when the front of the
'TURCHASES WITHOUT SERVICE le'e feels itself becoming a little too
i dry or dusty a communication it sent
' " 'Going farther and faring worse. for a supply of moisture. The eyelid
How truly this trite old .phrase applies theu COlmes down with a tear inside
in buying home supplies. People will R to WMh dean the front of eye
Jpay car fare to some distant city, ex- . . . . .. d Derfect
haust themselves with a dav of shop- lhls 1S V e , ". e, periecu
jping, waste valuable time, and return washin5 m the world.
with goods they could have bought a "
Ihome. And they admit it. .THR1CE-A-WEEK EDITION
".Making a wise purchase is not OF THE NEW YORK WORLD
I simply handing over your money to o
Boys', Misses' and Children's Shoes af Bargain Prices.
FROM THE
MacDonald-Kiley Bankrupt Sale
Men's High Grade M. & K. $ 1 O.OO and $ 1 2.00 Shoes
Varsity Shoes AA to D
ON SALE MERE AT ONE-HALF PRICE
machine. You want siViie personal
service. You don't get that out of a
. 'nail order house shipment, or from
'some stranger clerk in a distant de
partment store.
, "On tcie contrary, the home me:
, chant and his clerks try to make a
'sale that will fit your needs. Thsv
give you the benefit of their intei!:
gence and experience. They speak of
defects to be avoided and give infor
mation about goods. In making this
, kind of purchase, you get service,
something more than the tnerc good i
! handed over the counter. And if they
j don't fit, you get satisfaction."
3D-a:n" ooHEiisr
Paris' Greatest Shoe Store.
335 Main Street, Paris, Ky.
The value and need of a newspaper
in tihe household was never greater
than at the present time. The great
war in Europe is now half-way into
, its third year. and. whether peace be
at hand or yet be far -off. it and thn
events to follow it are sure to be of
absorbing interest for many a month
to c :411c
These are world-shaking affairs, in
wdiich the United States, willing or un
willing, is compellc. to take a part.
Xo intelligent person can ignore sucit
issues.
' THE THRICE-A-WEEK WORLD'S
j regular subscription price is only S1.00
per year, and this pays for 756 pa
pers. We offer this unequalled nev3
paper and THE BOURBON" NEWS to
gether for -one year for $2.75.
The regular subscription .orice of th.
The Nenana coal field, Alaska, wiil . two papers is $C.OO. ftf)
be tributary to the Government rail- j
road now under construction from Sew- j RAINBOW TROUT FOR "UPPER
'ard to Fairbanks. Though the coal of CUMBERLAND ARE SECURED
this field is lignite and hence of lo j
grade, yet it has great value as a I li 10,000 rainbow trout secured frcyn
J source of fuel and power for Fairbanks tne Government hatchery at Louisville '
'and other Yukon place camps. The,D' tno Kentucky Game and Fish Com
(field is about 60 miles south of Fair-,mission thrive in the headquarters o"
I banks. It is estimated by the United, tne Cumberland in Harlan countj.
t States Geological Survey Department where they will be placed the first of
,of the Interior that the Nehana fieid 'next week. Kentucky mountaia
contains sone ten billion tons of lig- streams soon will be stocked with game
mite. The Nenana coal field lies in; fish, which have attracted snnrfesmon
TEN BILLION TONS OF COAL.
attracted sportsmen
what it known as the Bonnifield re-. and made fam'ous northern and wesL
gion, which also contains some goldjern fishing camps.
,H.io uittu u.o uccu luincu iu n. xmc ii out require cool water and
small way for the last 10 years. Thij Poor and" Clover Forks of the Cumber
district is described in a report en- land were selected by Executive
titled "The Bonnifield Region. Alaska" Agent J. Q. Ward as the imot fryor
(Bulletin 501), which can be obtained able waters for the experiment The
on application to the Director of the fish lecured are fine specimen and.
Geological Survey, Washington, D. C. tke experimeat will lbbrTwl wikk v
i
' ra wtchfules.
tt