r-yTT" J-fr-' '
' "- Wrp.iJdl
TSacT-'
$ w- ? - '
'Vifrm
15
7
i
(INCOBPOBATED)
- u
Capital Stock $1,000,000
Executive Office Paris, Kentucky
Operating Office Scottsyille, Ky.
Par Value $1.00
-r--. -
JSgmr
neater
h
mm
mm
m
M'l
M
ill
iff
i II
!.'
I
I
k
OFFICERS
Frank Pe White, President and Director
George L. Doyle, Treasurer and Director
.Thomas J. Day, Vice President and Director
George W. Stuart, Director
Thomas J. Day, Field Manager
PROPERTIES
John M. Stuart, Secretary and Director
0. T. Hinton, Chief Counsel
1. 38 Acres in Barren County
Near the Winlock wells.
2. 20 Acres in Allen County
Two miles south of Scottsville,
wells aiitl Dalton pool
between Boxtown
1-30 Interest in McReynolds 20-Acre Lease
In Allen county, in the famous McReynolds pool.
Four wells now drilled and tanks erected. Now
pumping oil. Fifth well now drilling and offsetting
150-barrel well.
87 1-4 Acre Lease, Knox County, Texas
7 1-4 Acres of this territory offsets a well now
drilling and down over 2,000 feet.
.
I" rfS r Tf-.
Allen County, A Paradise For
"Poor Oil Operators"
!
i
Mi
te -;
t
EE
-v
-1
i
f
&
(from Louisville Eeraid, April If, 1919)
1 By B. W. GBATZER. ' . . .
' r .
Krst it was Estill, then later Lee that sent the Kentucky oil boom a sizzling. Now it is Allen': At'
least it is Allen County for the oil nien of moderate means who wish to lease some property and "digahafe",.
For, it .costs lets to drill a well and and operate a" 'lease in Allen County than any of the' oil producing
counties .of Zentueky1 . This is not merely a guess, or brought out by careful complication of costs and ex
penditures that go hand, in hand withe oil development, but the cost of operating' in Allen County is so
much cheaper than other counties of Kentucky, that right now it is drawing more new operators than even
in Lee, the end of the Kentucky oil "prospector's rainbow.
"There ar more drills in Allen County right now than any other county in the State," said a Louis
ville, oil man recently ;after returning from a tour of inspection of Allen County in search of a suitable lease
for his company. There is a reason for this condition. Oil men of experience state without hesitation
that a well cam be drilled in Allen County for $1,200, while in other oil producing districts the cost can
easily run to $5,000 or more if roads are bad and one of the many oil mishaps sets itself in the path of the
drill. Water is plentiful in Allen County, which is another factor highly favoring the prospector. In the
Eastern oil section of the State, quite frequently during the hot summer months operations ceased on some
of the biggest leases because of water shortage.
; ;, ' BABBEN AND WAEBEN, TOO.:
Barren and vWarren counties, two of the latest comers, in 'the Kentucky oil boom, are sharing' the popu
larity of ABem County as cheap. operatine,-districts. - In -Barren, and Warren counties there. is much ezcite-
..!'''. - - - . - -
ment at thjsjome, not only because it costs little to operate, there, Jrat because the percentage of drv holes run .
swmnabkoJ'eroent. which, is an, exceedingly low axerage.r ' , " r'
At!fcetejx'new drills are being; set1 up in Allen, arren and Barren-counties, Western Kentucky bids'
fail to become the center of oil activity .in 'Kentucky this, summer, unless another Lee county springs up in
the vast possible oil areas that so far have not been scratched by the drill.
IS OPEN COUNTRY
Allen County terrain is the oil man's delight. It is an open country and promises a long life -for oil
production as it is gottenunder a limestone formation. In drilling a well in Allen, casing pipe, which is al
ways a thorn in the driller's side because of so many things that can happen to it and ruin the well, is al
most unnecessary. It never requires more than 60 feet of casing for an Allen county well, and this is mere
ly to keep surface waters out of the well as the drill goes down to the limetsone formation.
The Gainesville pool is the heart of the Allen County field as tested out to date. A drill put down with
in the limits of this pool is sure to get oil in paying quantities. Production is spreading from the Gains
vifle Pool toward Half Way and Allen Springs, several good wells and domes being found in the vicinity -of
the latter places indicating the good structure of the Gainsville Pool extends farther than is generally
believed. Allen is strictly a "dome afield," but it is just this feature that makes it possible to drill into oil
in almost any section of the county. The productive area is not limited to certain localities as much as it
is in Lee, Estill and other Eastern Kentucky counties. x(J . . . .
't?"",V-rlVnji:r,fy,i 'l'! LEASES HELD HIGH. ' " " ' ' ' -'""' --V
The property owners of Allen, Barren and' Warren counties are wide awake. They know what they
ha?e,anxl-no better proof of this is seen than the prices they demand for leases. Wild cat territory, where
oil production is only a chance, is selling for $150 an acre. The same land would have sold for $1.00 am
acre before oil was found, ne leases .are much higher in proportion to the other oil producing counties,
but this is as it shojjldjbep for none other offers the easy develonment of Allen County.
The oil man or oil .company .holding a lease on Allen County property does not have to spend a fortune
in developing'it; or simkimg a test well to ascertain just what he has bought. This in itself, is enough to
mlake it certain the bulk of summer development in Kentucky will center in the western countie of Allen,
Warren and Barren.
i at bl&Jl
rir
impi
BR
it
k
Mf
v
in
A Company Organized to Develop Properties in the Great Fields of Western Kentucky
r:i ic cFnirk in A I Ion Cnuntv at a dDth of 250 feet, and
by running two shifts a well can be brought in within a
week's time.
The cost of putting down a well In this field is only a frac
tion of what it costs to drill a well In Lee and Estill Counties;
visile aieairutK in uen with a flow of n rst
sss&xs ar of ssfc? JStf?? firas
m
ilr-
m
i
Sv-i
t
GET IN NOW AT 10 CENTS